{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "http://geonetwork.iode.org/id/bf6febae-a2a0-4b26-a0e7-4e5f8c5a149c",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((10 -40, 10 -22, 43 -22, 43 -40, 10 -40))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "Terrestrial protected areas were assigned to the \"Take\" category unless their entire\ncoastline was a \"No-take\" MPA. The Biodiversity Target of 20% was used in the evaluation, as is the\nstandard practice for all NBA 2010 assessments. In addition a supplementary \"No-take\" target was derived\nfrom the marine offshore protected area targets contained in the National Protected Areas Expansion\nStrategy (DEAT SANBI, 2009), which includes targets for marine protection at 20% (i.e. the same as the\nbiodiversity target) , and a \"No-take\" target of 15% of the habitat. The level of protection of each ecosystem\nwas evaluated against the 20% biodiversity target, and then \"No-take\" areas were evaluated against the\n15% target. The protection levels were defined according to the following categories. Ecosystems were\nclassified as \"Not protected\" if there was no formal protection; as \"Hardly protected\" if under 5% of target\nwas met in protected areas; as \"Poorly protected\" if from 5% to just under 50% of biodiversity target is met\nin protected areas; as \"Moderately protected\" if from 50% to just under 100% of the Biodiversity target is\nmet in protected areas; and as \"Well protected\" if the biodiversity targets are fully met and the No-take\ntarget is met. Ecosystems where the biodiversity targets are fully met but where there is insufficient Notake\narea, were down-graded to a \"Moderately protected\" classification.",
    "keywords": "benthic,coastal,protection,south africa",
    "name": "South Africa: Benthic and Coastal Protection"
}