{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "http://geonetwork.iode.org/id/4fbf9f39-c747-499a-888b-259805767b32",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((30 -37, 30 -5, 57 -5, 57 -37, 30 -37))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "GLOBE is a project to develop the best available 30-arc-second (nominally 1 kilometer) global digital elevation data set.  This version of GLOBE contains data from 11 sources, and 17 combinations of source and lineage.  It continues much in the tradition of the National Geophysical Data Center's TerrainBase (FGDC 1090), as TerrainBase served as a generally lower-resolution prototype of GLOBE data management and compilation techniques. The GLOBE mosaic has been compiled onto CD-ROMs for the international user community.  It is also available from the World Wide Web (linked from the online linkage noted above and anonymous ftp.        Improvements to the global model are anticipated, as appropriate data and/or methods are made available.  In addition, individual contributions to GLOBE (several areas have more than one candidate) should become available at the same website. GLOBE may be used for technology development, such as helping plan infrastructure for cellular communications networks, other public works, satellite data processing, and environmental monitoring and analysis.  GLOBE prototypes (and probably GLOBE itself after its release) have been used to help develop terrain avoidance systems for aircraft.  In all cases, GLOBE data should be treated as any potentially useful but guaranteed imperfect data set. Mission- or life-critical applications should consider the documented artifacts, as well as likely undocumented imperfections, in the data.",
    "keywords": "Land Surface, Topography, Landforms, Land Surface, Topography, Relief, Land Surface, Topography , Terrain Elevation, Madagascar",
    "name": "Madagascar: Global Land One-km Base Elevation (GLOBE) Project"
}