{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "http://geonetwork.iode.org/id/5f56f457-8b96-4565-b4e4-a87c79c3e5ac",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((10 -40, 10 -25, 40 -25, 40 -40, 10 -40))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "Data on Marine Protected Areas (including their Take or No-Take status) was obtained from the Offshore\nMarine Protected Area project (Sink et al. 2010), while data on terrestrial protected areas which have a\ncoastal element was obtained from the National Protected Areas Expansion Strategy dataset (DEAT\nSANBI, 2009) . Terrestrial protected areas were assigned to the \"Take\" category unless their entire\ncoastline was a \"No-take\" MPA.",
    "keywords": "Coast, South Africa, Protection, Marine, Topography, Level, Coast, BiodiversityThe layer was prepared as part of the spatial assessment of the threat status and protection levels of South African marine and coastal ecosystems for the 2011 National Biodiversity Assessment. Prepared by Stephen Holness, Trevor Wolf, Kerry Sink, Linda Harris and Mandy Lombard with inputs from Ben Halpern and Hedley Grantham., Coast, South Africa, Protection, Marine, Topography, Level, Coast, BiodiversityThe layer was prepared as part of the spatial assessment of the threat status and protection levels of South African marine and coastal ecosystems for the 2011 National Biodiversity Assessment. Prepared by Stephen Holness, Trevor Wolf, Kerry Sink, Linda Harris and Mandy Lombard with inputs from Ben Halpern and Hedley Grantham., Coast, South Africa, Protection, Marine, Topography, Level, Coast, BiodiversityThe layer was prepared as part of the spatial assessment of the threat status and protection levels of South African marine and coastal ecosystems for the 2011 National Biodiversity Assessment. Prepared by Stephen Holness, Trevor Wolf, Kerry Sink, Linda Harris and Mandy Lombard with inputs from Ben Halpern and Hedley Grantham.",
    "name": "South Africa: Coastal Habitat Protection Level"
}