{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://raw.githubusercontent.com/iodepo/odis-arch/schema-dev-jm/code/notebooks/Exploration/data-ama/ama-a8d98d9d-a96c-4988-aebb-c0d13d0badcf.json",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((37 -37, 37 -5, 57 -5, 57 -37, 37 -37))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "Les écosystèmes côtiers et marins de la planète, y compris ceux de l’OIO, sont de plus en\nplus exposés à une multitude de facteurs de changement. L’identification, la quantification\net la cartographie des facteurs de changement représentent une étape importante dans le\nprocessus de planification de la conservation et pour la gestion des écosystèmes. Dans cette\nétude, nous avons identifié 15 facteurs de changement anthropiques qui peuvent être\nregroupés en 8 catégories : pêche industrielle pélagique, pêche côtière, pêche à pied,\nsédimentation terrigène, pollution des bassins versants par les activités urbaines et\nagricoles, dégradations locales dues aux activités urbaines, tourisme et transport maritime.\nLes facteurs de changement ont été cartographiés en utilisant plusieurs techniques d’analyse\nspatiale dont celle de la logique floue, de l’analyse de voisinage et l’analyse d’image satellite\nocéanographique. Les 8 catégories de facteurs de changement ont ensuite été classées et\npondérées par des experts de la région réunis au cours d’un atelier, sur la base de leur\nimpact potentiel sur les cinq principaux types d’habitats : récifs coralliens, mangroves,\nherbiers, autres habitats côtiers et habitats pélagiques (profondeur > 200m, distance de la\ncôte > 25km). Afin de développer un système de pondération valide, nous avons utilisé un\nprocessus analytique de hiérarchie basé sur la comparaison par paires de facteurs de\nchangement.\nL’objectif était d’étudier une partie des facteurs de changement (FdC) dans l’OIO et de\ncartographier leur distribution spatiale et leur intensité en se basant sur des données de\ntélédétection et socio-économiques et en utilisant les techniques de modélisation spatiale\ndes SIG.\nLa technique de logique floue et l’analyse d’images satellites ont été utilisées pour\ncartographier les FdC. La logique floue est une forme d’algèbre utilisant une gamme de\nvaleurs comprises entre « vrai » et faux » qui est appliquée dans la cartographie de données\nimprécises ou peu sûres (Ross 2004). Les données sont codées de 0 à 1 rapportant à une\nfonction d’appartenance floue. Par exemple, une valeur de 1 indique qu’un site est\nfortement affecté par un FdC alors qu’une valeur de 0 indique que le site ne fait pas partie\nde la catégorie des sites affectés",
    "keywords": [
        "Activites, Portuaires, Madagascar",
        "Activites, Portuaires, Madagascar",
        "Activites, Portuaires, Madagascar",
        "Activites, Portuaires, Madagascar"
    ],
    "name": "Madagascar AOI: Influences des Activites Portuaires",
    "url": "None"
}