{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://raw.githubusercontent.com/iodepo/odis-arch/schema-dev-jm/code/notebooks/Exploration/data-ama/ama-97b0cab4-ab1a-4b25-b4c2-0adbc5647073.json",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((30 -37, 30 -5, 57 -5, 57 -37, 30 -37))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "A historical review of vegetation classification in Madagascar reveals that the classical map and \"phytogeographic\" territories of Perrier de la Bâthie and Humbert are largely a subjective reflection of climatological factors, and do not adequately reflect fundamental biogeographic patterns. Delimitation of phytochoria based on the distribution patterns of taxa provides an objective framework for comparing and mapping vegetation types using a simple physiognomic classification. The application of this approach in Madagascar would make it possible to test the validity of the classical divisions and circumscribe alternative ones, and to determine the current extent of natural and anthropogenic formations (principally secondary grasslands, often called \"prairies\", \"pseudosteppes\", etc., which cover about three quarters of the country). Before the arrival of man, the original woody vegetation types in the drier west (forest, woodland, bushland, etc.) were in a fragile equilibrium and could quickly have been converted to secondary grassland by fires; in the moister center more active human intervention (clearing) was likely required to alter the vegetation. Contrary to recent claims, native grasslands were not widespread immediately prior to the arrival of humans, but were probably restricted to small patches. Today, human impacts can be seen in all Malagasy vegetation types, even supposedly undisturbed \"native\" forest.",
    "keywords": [
        "Land Surface, Landforms, vegetation",
        "Land Surface, Landforms, vegetation",
        "Land Surface, Landforms, vegetation",
        "Madagascar"
    ],
    "name": "Madagascar: Remaining vegetation",
    "url": "None"
}