{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://raw.githubusercontent.com/iodepo/odis-arch/schema-dev-jm/code/notebooks/Exploration/data-ama/ama-45378b2a-8699-4568-b3c9-370004269f00.json",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((14.4093 -46.9697, 14.4093 -22.1364, 37.8922 -22.1364, 37.8922 -46.9697, 14.4093 -46.9697))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "Derivation of ecosystem Threat status for features\nThe ecosystem threat status of a feature was determined by evaluating the area of each feature in a\ncondition against thresholds or targets. This method is designed to give comparable answers and\ncategories for the marine environment to those used in the South African National terrestrial, freshwater\nand estuarine conservation assessments, and to ensure that the assessment remains within a systematic\nframework. The methodology and categories also allows quick conceptual links to be made to IUCN Red\nList categories for species which are immediately understood by a broad range of biologists and\nconservationists.\nBiodiversity threshold (Targets): The basic biodiversity thresholds were set at 20% of the area of each\necosystem type. The 20% target is a default value commonly used in South Africa when targets derived\nfrom the underlying characteristics (e.g. species area curves) of biodiversity features are not available. A\nreview of targets for marine systems is being undertaken by the South African National Biodiversity\nInstitute, which will inform target setting for marine ecosystems in the future.\nThe ecosystem threat status of an ecosystem was determined by evaluating the area of each feature in a\nspecific condition state against thresholds or targets. A number of categories were defined that are\ncomparable with those used in the South African National terrestrial, freshwater and estuarine conservation\nassessments (Driver et al. 2005). The categories were:\nCritically Endangered: These are ecosystems where the remaining area in good condition is less than the\nidentified biodiversity threshold (20% of habitat). Conceptually, these are features where there are almost\nno remaining areas of pristine or natural habitat, and we expect that important components of biodiversity\npattern have been lost and processes are heavily modified.\nEndangered: These are ecosystems where the remaining area in good condition is less than the identified\nbiodiversity threshold plus 15% (i.e. 35% of habitat). Conceptually, this is a \"red flag\" category for systems\nthat are approaching the point where important components of biodiversity pattern will be lost, and which\nalready have significant impacts on processes.\nVulnerable: These are features where the remaining area in good condition is greater than the identified\nbiodiversity threshold plus 15% (i.e. are not Critically Endangered or Endangered), but where the remaining\narea of good or fair condition habitat is less than 80% of habitat area. Conceptually, these are habitats\nwhere there are sufficient areas of intact biodiversity of this type to meet our targets, but outside of these\nareas there has been broad loss of ecosystem processes.\nLeast threatened: These are features where the remaining area in good condition is greater than the\nidentified biodiversity threshold plus 15% (i.e. they are not Critically Endangered or Endangered), but\nwhere the remaining area of good or fair condition habitat is greater than 80% of habitat area.\nConceptually, there are sufficient areas of intact biodiversity of this type to meet our biodiversity target, and\nthere has been little broad modification of processes. Large portions of these systems remain in a natural\nor pristine state.",
    "keywords": [
        "Coast, Ocean, Vulnerable, Status, Habitat, Biodiversity, South Africa",
        "Coast, Ocean, Vulnerable, Pelagic, Status, Habitat, Biodiversity, South Africa",
        "Atlas, Coast, Ocean, Pelagic, Vulnerable, Status, Habitat, Biodiversity, South Africa"
    ],
    "name": "South Africa: Pelagic Habitat Threat Status",
    "url": "http://www.sanbi.org.za"
}