{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "http://164.214.12.45/MSISiteContent/StaticFiles/NAV_PUBS/WPI/WPI_Shapefile.zip",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((-11 -4, -11 9, 10 9, 10 -4, -11 -4))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "A key objective of Ghana’s decentralization programme is the promotion of small towns, particularly district capitals, as a means of reducing rural-urban migration and the rapid growth of large towns and cities. While small towns have grown significantly in both number and population over the last three decades, the proportion of the total urban population living in these urban centres has changed very little or has even declined slightly. This contradicts the view that the growth and proliferation of small towns is leading to declining growth rates of the larger urban centres. This conclusion leads to the question of whether there is a justification for the promotion of small towns under Ghana’s decentralization programme. This article examines the reasons accounting for the growth of small towns and concludes that promoting small towns, especially the district capitals under the current decentralization programme, is a positive response to rural development and the development of dispersed urbanization in the long term.\n\nUrban centres in Ghana are officially defined as settlements with populations of 5000 or more.[10] Besides other limitations, definitions of this sort significantly failed to delimit the various urban hierarchies found within each country or region.\nIt is impossible to give total protection to the entire coastline against oil pollution from navigation or oil exploration and exploitation activities. It is therefore necessary to carefully plan how to minimise the risk for the most sensitive and important areas and further to prioritise the oil spill combat activities in the event of oil pollution threatening the marine environment and the coastal zone areas.\n\nMapping the ecological and human use features sensitive to marine oil spill, the coastline ?eld surveys and aerial photography was classi?ed into different geological coast types. Protected areas and areas that serve as important habitats for birds, ?sh, plankton, marine turtles, marine mammals and benthic fauna were mapped. Marine turtles nest on many of the sandy beaches in Ghana. The juvenile turtles are very sensitive to oil spill in the period shortly after hatching. Furthermore there are more than 90 lagoons along the coast serving as important areas for migrating birds and spawning areas for ?sh. The human use activities depending on access to marine resources such as ?shery, hotels and recreation, water intakes etc. were also mapped. The ?shing industry is one of the most promising in West Africa, in terms of resources and experience of the people engaged in the industry. All the data was stored in a GIS database.\n\nRanking of the coastline: Ecological features and Human use features where subsequently ranked in four categories in terms of sensitivity to oil spill: Very high sensitivity, High sensitivity, Medium sensitivity, and Low sensitivity.  The entire coastline was sub-divided into segments of 1 km. Each segment was ranked according to ecological sensitivity of oil spill and human use features separately. The most sensitive feature in each particular segment determines the overall rank.\n\nThree main classifications can be made: small towns, medium-sized/intermediate towns, and large towns/cities. Adding rural settlements, Ghana’s settlement hierarchy can be placed within a four-tier system. At the top of Ghana’s urban hierarchy are the large towns/cities of Accra, Kumasi, Tema and Sekondi-Takoradi, with populations of 250,000 or more. This is followed by the intermediate (medium-sized) towns with populations of 50,000 to 250,000, typified by the regional capitals. After this are the small towns, exemplified by district capitals/administrative centres with populations between 5000 and 50,000. Lastly, there are rural settlements. It should be noted that this classification and the definitions are for the purpose of analyses and discussions in this article since no official definitions exist in Ghana other than the official definition of an urban centre.",
    "keywords": "Sensitivity map, World",
    "name": "Environmental Sensitivity Mapping of the Coastal Zone of Ghana",
    "url": "http://164.214.12.45/MSISiteContent/StaticFiles/NAV_PUBS/WPI/WPI_Shapefile.zip"
}