{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "http://www.vliz.be/vmdcdata/marbound/download.php",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((50 -30, 50 0, 95 0, 95 -30, 50 -30))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "The Maritime Boundaries Geodatabase (MARBOUND) is developed by the Flanders Marine Institute and bundles the boundaries of the Exclusive Economic Zones (EEZ) of all countries worldwide. The database also includes all original documents of the treaties concerning these borders (in digital format). Through a forum on the MARBOUND website users can contribute to the further development and optimization of the MARBOUND database by providing information about new border developments.\n\nThe concept of maritime boundaries is a relative new concept. Coastal states now want to delimit an area in the ocean where they have exclusive rights over the mineral and biological resources.\n\nThe basis for the calculation of maritime boundaries is the declaration of a baseline. The conditions under which a state may establish such baseline are described in the United Nations Convention on the Law of the Sea (UNCLOS). A baseline of a country can be the low water line, a straight baseline (a line that encloses bays, estuaries, inland waters,...) or a combination of the two.\n\nThe zone extending 12 Nautical Miles from the baseline is the Territorial Sea and the zone extending 24 Nautical Miles is the Contiguous Zone of a country.\n\nThe legal Exclusive Economic Zone is the zone extending 200 Nautical Miles from the baseline. When the space between two countries is less than 400 Nautical Miles, the boundary should be the Median Line or should be described in a multilateral treaty.\n\nMultilateral treaties and documents describing the baselines of countries can be found on the website of the United Nations.",
    "keywords": [
        "Human Dimensions",
        "Maritime Boundaries",
        "Political Divisions",
        "Mauritius",
        "Atlas"
    ],
    "name": "Maritime Boundaries of Mauritius",
    "url": "http://www.vliz.be/vmdcdata/marbound/download.php"
}