{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "http://geonetwork.iode.org/id/dbc8100d-b3ea-484f-8be1-d3059b1e3b73",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((37 -37, 37 -5, 57 -5, 57 -37, 37 -37))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "Avec 20 millions d’habitants pour une superficie atteignant 587 041 km², soit un peu supérieure à celle de la France, Madagascar n’a qu’une faible densité démographique d’un peu plus de 30 habitants au km2. \nEt comme cette population n’est urbanisée qu’à environ 15%, on comprendra que les grandes agglomérations soient rares. Les plus importantes sont Antananarivo, la capitale nationale et les cinq chefs-lieux des anciennes Provinces, soit par ordre alphabétique, Antsiranana, Fianarantsoa, Mahajanga, Toamasina et Toliara.\n\nAux temps coloniaux, bien avant la suppression des six provinces et leur remplacement par les vingt-deux régions actuelles, le nom de ces six villes que les colonisateurs ne parvenaient pas à prononcer avait été changé en Tananarive, Diégo Suarez, Fianarantsoa, Majunga, Tamatave et Tuléar, des noms qui ont toujours été rejetés par les autochtones.\n\nCes villes ont fini par retrouver leur identité initiale peu après l’indépendance en 1960. Avec le grand changement politique de 2002 et la mise en place de la décentralisation, elles ont presque toutes perdu une bonne partie de leur importance administrative et politique, mais non leur poids démographique et économique. C’est d’ailleurs ce dernier facteur qui nous a conduit à leur ajouter deux ports : l’un à l’extrême Sud-est qui se développe énormément en raison de l’exploitation et l’exportation de l’ilménite, minerais dont on extrait le titane et le second dans le creux de la côte ouest, avec un arrière-pays prometteur au plan charbonnier (Sakoa) et pétrolier (Bemolanga). Il s’agit respectivement de Taolagnaro, nom original de Fort Dauphin, et de Morondava.",
    "keywords": "Villes, villages, localites, Madagascar, Villes, villages, localites, Madagascar, Villes, villages, localites, Madagascar, Madagascar",
    "name": "Madagascar AOI: Les villes et villages"
}