{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-the-last-taboo-research-on-managing-menstruation-in-the-pacific",
    "@type": "Dataset",
    "description": "Key findings from this research into women’s and girl’s experiences of menstruation in Fiji, Papua New Guinea and Solomon Islands are:\n\n- Adolescent girls and women face a number of challenges that influence their ability to manage menstruation effectively and with dignity; these challenges interact, and have the potential to negatively influence physical and emotional health, participation at school, work and in the community, and impact the environment. \n\n- Many adolescent girls in Solomon Islands and Papua New Guinea lack comprehensive knowledge about menstruation and are unprepared for menarche. In Fiji, they have reasonably good access to education and information. \n\n- Common beliefs and attitudes around menstruation being “dirty” create needless stigma, making it more difficult to manage menstruation, contributing to some unwanted behavioural restrictions, and negatively affecting emotional wellbeing. \n\n- Girls reported teasing/harassment by boys, contributing to feelings of humiliation and embarrassment, and potentially absenteeism from school. \n\n- Reputable sanitary products are available in urban areas in Fiji and Papua New Guinea; but less available in rural areas. In Fiji and Papua New Guinea, products were affordable for those with an income. In Solomon Islands, they are prohibitively priced and much less available.\n\n- Girls and women with less access to money may rely on home-made solutions (of variable efficacy) to manage menstruation.\n\n- Women and girls commonly experience fear of leakage and staining, and are subsequently distracted from school or work. Some opt to disengage with community life, stay home from school, or miss work on days of heavy bleeding.\n\n- In Solomon Islands and Papua New Guinea, WASH facilities in schools and workplaces are commonly inadequate to meet the needs of menstruating girls and women. Inadequate WASH facilities contribute to unhygienic menstrual management practices (such as improper disposal of used materials) or extended (uncomfortable) delays in changing materials. Some prefer to return home to change used materials contributing to absenteeism from school and work. In Fiji, WASH facilities are generally of a high standard. \n\n- The access needs of those with physical disabilities (notably wheelchair users) are commonly overlooked in Solomon Islands and Papua New Guinea, and to a lesser extent in Fiji.",
    "keywords": "Education, Health, enhancing-agency, human-rights, land-sea-and-livelihoods, literature-review, pacific-women, research-report, social-norms",
    "name": "The Last Taboo: Research on Managing Menstruation in the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-the-last-taboo-research-on-managing-menstruation-in-the-pacific"
}