{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/koweek2017aa-year-in-the-life-of-a-central-california-kelp-forest-physical-and-biological-insig",
    "@type": "Dataset",
    "description": "Kelp forests are among the world's most productive marine ecosystems, yet little is known about their biogeochemistry. This study presents a 14-month time series (July 2013–August 2014) of surface and benthic dissolved inorganic carbon and total alkalinity measurements, along with accompanying hydrographic measurements, from six locations within a central California kelp forest. We present ranges and patterns of variability in carbonate chemistry, including pH (7.70–8.33), pCO2 (172–952 µatm), and the aragonite saturation state, $Ømega$Ar (0.94–3.91). Surface-to-bottom gradients in CO2 system chemistry were as large as the spatial gradients throughout the bottom of the kelp forest. Dissolved inorganic carbon variability was the main driver of the observed CO2 system variability. The majority of spatial variability in the kelp forest can be explained by advection of cold, dense high-CO2 waters into the bottom of the kelp forest, with deeper sites experiencing high-CO2 conditions more frequently. Despite the strong imprint of advection on the biogeochemical variability of the kelp forest, surface waters were undersaturated with CO2 in the spring through fall, indicative of the strong role of photosynthesis on biogeochemical variability. We emphasize the importance of spatially distributed measurements for developing a process-based understanding of kelp forest ecosystem function in a changing climate. ",
    "keywords": "algae, biogeochemistry, biological-response, chemistry, field, north-pacific, ocean-acidification",
    "name": "A year in the life of a central California kelp forest: physical and biological insights into biogeochemical variability",
    "url": "https://pacificdata.org/data/dataset/koweek2017aa-year-in-the-life-of-a-central-california-kelp-forest-physical-and-biological-insig"
}