{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/south-pacific-sea-level-climate-monitoring-project-six-monthly-consolidated-reports-5",
    "@type": "Dataset",
    "description": "This records holds the 12 months Consolidated reports of the South Pacific Sea Level & Climate Monitoring Project. The reports  provide a consolidated overview of the data collected, analysed and presented in the monthly data reports for the South Pacific Sea Level and Climate Monitoring Project (SPSLCMP). \nThese reports are available here for download from the Distribution Info Section and is also available from the Sea Level & Climate Monitoring Projects Official Website. This project is sponsored by the Australian Agency for International Development (AusAID) and managed by the Australian Bureau of Meteorology.Project Implementation partners include Australian Bureau of Meteorology , National Tide Center, National Climate Center, Geoscience Australia and SPC ,SOPAC Division.To monitor changes in sea level and climate in the South\nPacific.The first two phases of the project (from July 1991 to December 2000) established sea level/meteorological monitoring stations at eleven sites, one each in Cook Islands, Fiji, Kiribati, Marshall Islands,Papua New Guinea, Solomon Islands, Tonga, Tuvalu, Vanuatu, and Samoa. Another station was established in December 2001 in the Federated States of Micronesia during the project's third phase (January 2001 to December 2006). The third phase also involved installation of continuous global positioning systems (CGPS) at many of these locations in order to monitor vertical movements of the islands upon which the sea level monitoring stations are based.",
    "keywords": "pacific, south-pacific-sea-level-and-climate-monitoring-project, southwest",
    "name": "South Pacific Sea Level & Climate Monitoring Project, Six Monthly Consolidated Reports #5",
    "url": "https://pacificdata.org/data/dataset/south-pacific-sea-level-climate-monitoring-project-six-monthly-consolidated-reports-5"
}