{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-voter-education-project-final-report",
    "@type": "Dataset",
    "description": "The Voter Education Project was targeted at the ‘lost generation’ of Bougainville (people aged 35 to 45 years). Over 20 months, the Bougainville Women’s Federation and International Women’s Development Agency provided education about voting rights and responsibilities to 22,463 women and female youth, including 206 with disabilities and 21,368 men and male youth, including 383 with disabilities and another 53 people with disabilities. These voters were able to use these skills in the 2017 Papua New Guinea national elections. \n\nWhilst the project targeted both women and men, it paid particular attention to engaging women. This is because the experiences of post-conflict trauma and disadvantage suffered by this particular group intersects with more generalised patterns of women’s disenfranchisement from democratic processes in Bougainville and across the Pacific. \n\nUsing a community trainer model, the project provided on-the-ground education about voting, elections and making informed decisions as a voter in over 740 communities. Women were seen by communities in leadership roles, as 22 of the 43 community trainers were women. The voter education workshops included mock elections, which many participants viewed as the highlight. The use of local languages, good governance DVDs and mock elections were critical in distilling complex processes into accessible information. \n\nThe project’s monitoring data, observations from election observers and the election results all indicated that the voter education workshops increased voters’ confidence in understanding the Limited Preferential Voting system, casting their votes correctly, and understanding their right to freely choose their preferred candidate. Reports from election observers evidenced that women were well represented in the ballot boxes. Women reported confidently casting their votes based on their own decisions, rather than as a result of influence or coercion from male family members.",
    "keywords": "Education, Report, autonomus-region-of-bougainville, data, leadership-and-decision-making, leadership-and-politics, pacific-women, social-norms",
    "name": "Voter Education Project Final Report",
    "url": "https://pacificdata.org/data/dataset/pwl-voter-education-project-final-report"
}