{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/cooper2016ametabolic-responses-of-the-north-pacific-krill-euphausia-pacifica-to-short-and-long-",
    "@type": "Dataset",
    "description": "While ocean acidification is likely to have major effects on many marine organisms, those species that regularly experience variable pCO2 environments may be more tolerant of future predicted changes in ocean chemistry. Euphausia pacifica is an abundant krill species along the Pacific coast of North America and one that regularly experiences varying pCO2 levels during seasonal upwelling, as well as during daily vertical migrations to depth where pCO2 is higher. Krill were collected from Monterey Bay, California (36.8°N, 121.9°W), and experiments were performed from June to August 2014 and maintained at two pCO2 levels (400 and 1200 µatm). Three metabolic responses (oxygen consumption, ingestion rate, and nutrient excretion rates) of E. pacifica were measured. Oxygen consumption declined by 31 % in the first 24 h following exposure to high pCO2 and remained low after 21 days. Oxygen consumption at low pCO2 was low for the first 12 h, increased by 34 % at 24 h, but returned to initial values by 21 days. After 3 weeks of continuous exposure, oxygen consumption rates were 32 % lower in the high pCO2 group. Ingestion and ammonium excretion rates were both significantly lower in the high pCO2 group after 24-h exposure, but not after 7 or 21 days. There was no effect of pCO2 on phosphate excretion. Taken together, these results indicate that E. pacifica has a lower metabolic rate during both short-term (24 h) and longer-term (21 days) exposure to high pCO2. Such metabolic depression may explain previously reported declines in growth of E. pacifica exposed to high pCO2.",
    "keywords": "biological-response, crustaceans, laboratory, north-pacific, ocean-acidification, performance, physiology, respiration, zooplankton",
    "name": "Metabolic responses of the North Pacific krill, Euphausia pacifica, to short- and long-term pCO2 exposure",
    "url": "https://pacificdata.org/data/dataset/cooper2016ametabolic-responses-of-the-north-pacific-krill-euphausia-pacifica-to-short-and-long-"
}