{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/marshall-islands-majuro-atoll-sand-and-gravel-resources-survey-bathymetry-maps-10",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((157.4605437804716 1.777313889000837, 157.4605437804716 17.946061498439633, 175.5217631574444 17.946061498439633, 175.5217631574444 1.777313889000837, 157.4605437804716 1.777313889000837))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "SOPAC conducted a 478 kilometers of high resolution multibeam bathymetry survey in Majuro , Marshall Islands. Areas covered included the eastern part portion of the lagoon from the airport to Uliga in the east , the inner margin of the lagoon and the northern margin from Calalin channel to Rita. A single reconnaissance multibeam line was also completed along the lagoon reef slope of the western margin of the atoll. Seismic information and data on the physical properties of the water were collected concurrently. \nTogether with previous survey data were plotted onto high resolution IKONS satellite imagery to show the effects of past dredgings. Data collected was used to produce bathymetry maps and are available here in PDF formats for download with appropriate permission from the SOPAC secretariat.   \n\nThe government of Australia and Taiwan were the major funding of the project and the project had the support and assistance of the government of the Republic of the Marshall islands through the Marshall islands Marine Resources Authority (MIMRA).Majuro Atoll is located 7 deg 04'N, 171deg 16'E. Uliga is the island town located is located 7 deg 05' 53\"N, 171 deg 23' 56\"E.",
    "keywords": "calalin-channel, conductivity-depth-profiler, jetprobe, laura, majuro-atoll, marshall-island, multibeam-bathymetry, oceanography, rita, sampling-and-analysis, sediment-composition, uliga-peace-park",
    "name": "Marshall Islands, Majuro Atoll, Sand and Gravel Resources survey, Bathymetry Maps #10",
    "url": "https://pacificdata.org/data/dataset/marshall-islands-majuro-atoll-sand-and-gravel-resources-survey-bathymetry-maps-10"
}