{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-witch-hunts-in-papua-new-guinea-s-eastern-highlands-province-a-fieldwork-report",
    "@type": "Dataset",
    "description": "The issue of sorcery and witchcraft-related accusations and violence in Papua New Guinea is receiving increasing attention domestically and internationally. A growing body of literature is also focusing on the issue, providing non-government organisations, donor agencies, and the Papua New Guinea government with an evidence base for addressing the problem in locally appropriate ways. Little of the literature, however, deliberates upon the perpetrators of these violent attacks. This is a serious shortcoming, since if culturally appropriate and meaningful prevention strategies are to be developed, there is a need to understand the worldview of the perpetrators and the factors propelling their violent, often repeated, attacks. \n\nThis short paper shares the reflections of perpetrators of sorcery accusation-related violence, presenting their perspectives on why they have killed people accused of witchcraft.  Accusations, and the violence that follows, occur when someone is seriously ill or dies. Witch-hunts are referred to as ‘operations’ and are justified by taking the view that ‘rubbish’ (pipia), ‘weeds’ (gras no gut), or ‘dangerous snakes’ (snek no gut) must be removed from the community. In all of the cases studied, the community sanctioned the violence and killing of the person accused of being a witch. \n\nThe research suggests that there is a need for a primary prevention approach — to address the violence before it takes place. This would entail working more closely with communities and, importantly, the perpetrators, because violent actions against accused witches are generally widely supported. Potential perpetrators in the community not only will begin to hear wider views as the issue is discussed, but may also realise that they cannot rely on community support.",
    "keywords": "data, development-programming, ending-violence-against-women, pacific-women, short-paper, social-norms, violence",
    "name": "Witch hunts in Papua New Guinea’s Eastern Highlands Province: A Fieldwork Report",
    "url": "https://pacificdata.org/data/dataset/pwl-witch-hunts-in-papua-new-guinea-s-eastern-highlands-province-a-fieldwork-report"
}