{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/sinutok2011warmer-more-acidic-conditions-cause-decreased-productivity-and-calcification-in-subt",
    "@type": "Dataset",
    "description": "The effects of elevated CO2 and temperature on photosynthesis and calcification in the calcifying algae Halimeda macroloba and Halimeda cylindracea and the symbiont-bearing benthic foraminifera Marginopora vertebralis were investigated through exposure to a combination of four temperatures (28°C, 30°C, 32°C, and 34°C) and four CO2 levels (39, 61, 101, and 203 Pa; pH 8.1, 7.9, 7.7, and 7.4, respectively). Elevated CO2 caused a profound decline in photosynthetic efficiency (FV : FM), calcification, and growth in all species. After five weeks at 34°C under all CO2 levels, all species died. Chlorophyll (Chl) a and b concentration in Halimeda spp. significantly decreased in 203 Pa, 32°C and 34°C treatments, but Chl a and Chl c2 concentration in M. vertebralis was not affected by temperature alone, with significant declines in the 61, 101, and 203 Pa treatments at 28°C. Significant decreases in FV : FM in all species were found after 5 weeks of exposure to elevated CO2 (203 Pa in all temperature treatments) and temperature (32°C and 34°C in all pH treatments). The rate of oxygen production declined at 61, 101, and 203 Pa in all temperature treatments for all species. The elevated CO2 and temperature treatments greatly reduced calcification (growth and crystal size) in M. vertebralis and, to a lesser extent, in Halimeda spp. These findings indicate that 32°C and 101 Pa CO2, are the upper limits for survival of these species on Heron Island reef, and we conclude that these species will be highly vulnerable to the predicted future climate change scenarios of elevated temperature and ocean acidification. ",
    "keywords": "101594pangaea774792, algae, biological-response, calcification, laboratory, morphology, mortality, multiple-factors, oaiccdb, ocean-acidification, photosynthesis, protists, south-pacific, temperature",
    "name": "Warmer more acidic conditions cause decreased productivity and calcification in subtropical coral reef sediment-dwelling calcifiers",
    "url": "https://pacificdata.org/data/dataset/sinutok2011warmer-more-acidic-conditions-cause-decreased-productivity-and-calcification-in-subt"
}