{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-pacific-young-people-s-srhr-factsheet",
    "@type": "Dataset",
    "description": "In the Pacific region 56 per cent of the population is under the age of 25. Pacific young people have diverse needs, opportunities and experiences, living as they do across 20,000 islands around the Pacific Ocean. This dynamic group of young people live in urban and rural areas, on remote islands and in large cities. They have diverse sexualities and gender identities. They are young people living with disabilities, they are sex workers, they are young women and men living with HIV and AIDS. They are from diverse socioeconomic backgrounds, they are students, politicians, homemakers and business people. They are young mothers and fathers, brothers and sisters and daughters and sons. They face discrimination due to multiple, intersecting challenges, such as poverty, migration, climate change, religion, ethnicity, gender and age. \n\nOne thing that too many Pacific Island young people share is a disproportionate burden of poor sexual and reproductive health and rights. There are high rates of adolescent pregnancies, endemic levels of sexual and gender based violence and a growing prevalence of sexually transmitted infections. Restrictive abortion laws in most countries mean information about abortions, including the prevalence and effects of unsafe abortion, is limited. Restrictive laws around sexual orientation and gender identity, also prevent many young people from accessing their sexual and health rights. \n\nThese sexual and reproductive health and rights challenges directly contribute to a wide range of negative short and long-term consequences for the health and wellbeing of Pacific young people, their families and communities. It is also increasingly contributing to broader social and economic challenges that significantly hinder the development of Pacific Island Countries and Territories. Therefore, Pacific Island Countries are unlikely to reach their development goals without addressing the sexual and reproductive rights and health of their young people.",
    "keywords": "Health, enhancing-agency, fectsheet, pacific-women, social-norms, violence",
    "name": "Pacific Young People’s SRHR Factsheet",
    "url": "https://pacificdata.org/data/dataset/pwl-pacific-young-people-s-srhr-factsheet"
}