{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/su2018ocean-acidification-affects-the-cytoskeleton-lysozymes-and-nitric-oxide-of-hemocytes-a-po",
    "@type": "Dataset",
    "description": "An enormous amount of anthropogenic carbon dioxide (CO2) has been dissolved into the ocean, leading to a lower pH and changes in the chemical properties of seawater, which has been termed ocean acidification (OA). The impacts of pCO2-driven acidification on immunity have been revealed recently in various marine organisms. However, the mechanism causing the reduction in phagocytosis still remains unclear. Therefore, the impacts of pCO2-driven OA at present and near-future levels (pH values of 8.1, 7.8, and 7.4) on the rate of phagocytosis, the abundance of cytoskeleton components, the levels of nitric oxide (NO), and the concentration and activity of lysozymes (LZM) of hemocytes were investigated in a commercial bivalve species, the blood clam (Tegillarca granosa). In addition, the effects of OA on the expression of genes regulating actin skeleton and nitric oxide synthesis 2 (NOS2) were also analyzed. The results obtained showed that the phagocytic rate, cytoskeleton component abundance, concentration and activity of LZM of hemocytes were all significantly reduced after a 2-week exposure to the future OA scenario of a pH of 7.4. On the contrary, a remarkable increase in the concentration of NO compared to that of the control was detected in clams exposed to OA. Furthermore, the expression of genes regulating the actin cytoskeleton and NOS were significantly up-regulated after OA exposure. Though the mechanism causing phagocytosis seemed to be complicated based on the results obtained in the present study and those reported previously, our results suggested that OA may reduce the phagocytosis of hemocytes by (1) decreasing the abundance of cytoskeleton components and therefore hampering the cytoskeleton-mediated process of engulfment, (2) reducing the concentration and activity of LZM and therefore constraining the degradation of the engulfed pathogen through an oxygen-independent pathway, and (3) inducing the production of NO, which may negatively regulate immune responses.",
    "keywords": "biological-response, laboratory, molecular-biology, mollusks, north-pacific, ocean-acidification, physiology",
    "name": "Ocean acidification affects the cytoskeleton, lysozymes, and nitric oxide of hemocytes: a possible explanation for the hampered phagocytosis in blood clams, Tegillarca granosa",
    "url": "https://pacificdata.org/data/dataset/su2018ocean-acidification-affects-the-cytoskeleton-lysozymes-and-nitric-oxide-of-hemocytes-a-po"
}