{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-pacific-feminists-and-activists-re-framing-re-articulating-and-re-energizing-sexual-and-reproduc",
    "@type": "Dataset",
    "description": "In this statement, Pacific feminist, Sexual and Reproductive Health and Rights advocates call for: \n\n- Papua New Guinea State to repeal the Sorcery Act and investigate and prosecute all criminal cases to prevent further torture and extrajudicial killing of women and girls under the guise of eliminating witchcraft and sorcery. There must also be concerted efforts by States and regional and global institutions to ensure that the seriousness and frequency of these crimes are acknowledged and that these responses are immediate, strong and effective. \n\n- Rights to legal and safe abortion for all Pacific women and girls. \n\n- Address the alarming levels of sexually transmitted infections (STIs) amongst Pacific women and girls. \n\n- Recognition that lesbian, bisexual and trans* rights are women's rights and human rights, and to fulfill those rights. \n\n- Repeal of all laws and policies in Pacific island states that criminalise same-sex relationships, and recognise all people with non-heteronormative sexual orientation and gender identity as full and equal rights-holders. \n\n- Decriminalision of sex work and elimination of the unjust application of noncriminal laws and regulations against sex workers. \n\n- The immediate ratification of Convention on the Eliminatin of All Forms of Discrimination against Women (CEDAW) by Palau, and Tonga. \n\n- Regional leaders to prioritise an immediate end to small arms trade and trafficking and the militarisation of states that serve to perpetuate and reinforce patriarchal forms of power and control.",
    "keywords": "Health, enhancing-agency, outcome-statement, pacific-women, social-norms, violence",
    "name": "Pacific Feminists and Activists: Re-framing, Re-articulating and Re-energizing Sexual and Reproductive Health and Rights",
    "url": "https://pacificdata.org/data/dataset/pwl-pacific-feminists-and-activists-re-framing-re-articulating-and-re-energizing-sexual-and-reproduc"
}