{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/hu2015effect-of-ph-and-temperature-on-antioxidant-responses-of-the-thick-shell-mussel-mytilus-c",
    "@type": "Dataset",
    "description": "This study evaluated the combined effects of seawater pH decrease and temperature increase on the activity of antioxidant enzymes in the thick shell mussel Mytilus coruscus, an ecological and economic bivalve species widely distributed along the East China Sea. Mussels were exposed to three pH levels (8.1, 7.7 and 7.3) and two temperatures (25°C and 30°C) for 14 days. Activities of superoxide dismutase (SOD), catalase (CAT), glutathione peroxidase (GPX), glutathione (GSH), acid phosphatase (ACP), alkaline phosphatase (AKP) and glutamic-pyruvic transaminase (GPT) were measured in gills and digestive glands after 1, 3, 7 and 14 days of exposure. All enzymatic activities were significantly impacted by pH, temperature. Enzymatic activities at the high temperature were significantly higher than those at the low temperature, and the mussels exposed to pH 7.3 showed significantly higher activities than those under higher pH condition for all enzymes except ACP. There was no interaction between temperature and pH in two third of the measured activities suggesting similar mode of action for both drivers. Interaction was only consistently significant for GPX. PCA revealed positive relationships between the measured biochemical indicators in both gills and digestive glands. Overall, our results suggest that decreased pH and increased temperature induce a similar anti-oxidative response in the thick shell mussel.",
    "keywords": "biological-response, laboratory, mollusks, multiple-factors, north-pacific, ocean-acidification, physiology, temperature",
    "name": "Effect of pH and temperature on antioxidant responses of the thick shell mussel Mytilus coruscus",
    "url": "https://pacificdata.org/data/dataset/hu2015effect-of-ph-and-temperature-on-antioxidant-responses-of-the-thick-shell-mussel-mytilus-c"
}