{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/zha2017alaboratory-simulation-reveals-significant-impacts-of-ocean-acidification-on-microbial-c",
    "@type": "Dataset",
    "description": "It has been suggested that climate change may promote the outbreaks of diseases in the sea through altering the host susceptibility, the pathogen virulence, and the host-pathogen interaction. However, the impacts of ocean acidification (OA) on the pathogen components of bacterial community and the host-pathogen interaction of marine bivalves are still poorly understood. Therefore, 16S rRNA high-throughput sequencing and host-pathogen interaction analysis between blood clam (Tegillarca granosa) and Vibrio harveyi were conducted in the present study to gain a better understanding of the ecological impacts of ocean acidification. The results obtained revealed a significant impact of ocean acidification on the composition of microbial community at laboratory scale. Notably, the abundance of Vibrio, a major group of pathogens to many marine organisms, was significantly increased under ocean acidification condition. In addition, the survival rate and haemolytic activity of V. harveyi were significantly higher in the presence of haemolymph of OA treated T. granosa, indicating a compromised immunity of the clam and enhanced virulence of V. harveyi under future ocean acidification scenarios. Conclusively, the results obtained in this study suggest that future ocean acidification may increase the risk of Vibrio pathogen infection for marine bivalve species, such as blood clams.",
    "keywords": "101594pangaea888196, abundance, biological-response, community-composition, laboratory, molecular-biology, mollusks, mortality, north-pacific, oaiccdb, ocean-acidification, otherprocess, performance, physiology, prokaryotes",
    "name": "Laboratory simulation reveals significant impacts of ocean acidification on microbial community composition and host-pathogen interactions between the blood clam and Vibrio harveyi",
    "url": "https://pacificdata.org/data/dataset/zha2017alaboratory-simulation-reveals-significant-impacts-of-ocean-acidification-on-microbial-c"
}