{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/hamilton2017aspecies-specific-responses-of-juvenile-rockfish-to-elevated-pco2-from-behavior-to-",
    "@type": "Dataset",
    "description": "In the California Current ecosystem, global climate change is predicted to trigger large-scale changes in ocean chemistry within this century. Ocean acidification-which occurs when increased levels of atmospheric CO2 dissolve into the ocean-is one of the biggest potential threats to marine life. In a coastal upwelling system, we compared the effects of chronic exposure to low pH (elevated pCO2) at four treatment levels (i.e., pCO2 = ambient [500], moderate [750], high [1900], and extreme [2800 $μ$atm]) on behavior, physiology, and patterns of gene expression in white muscle tissue of juvenile rockfish (genus Sebastes), integrating responses from the transcriptome to the whole organism level. Experiments were conducted simultaneously on two closely related species that both inhabit kelp forests, yet differ in early life history traits, to compare high-CO2 tolerance among species. Our findings indicate that these congeners express different sensitivities to elevated CO2 levels. Copper rockfish (S. caurinus) exhibited changes in behavioral lateralization, reduced critical swimming speed, depressed aerobic scope, changes in metabolic enzyme activity, and increases in the expression of transcription factors and regulatory genes at high pCO2 exposure. Blue rockfish (S. mystinus), in contrast, showed no significant changes in behavior, swimming physiology, or aerobic capacity, but did exhibit significant changes in the expression of muscle structural genes as a function of pCO2, indicating acclimatization potential. The capacity of long-lived, late to mature, commercially important fish to acclimatize and adapt to changing ocean chemistry over the next 50-100 years is likely dependent on species-specific physiological tolerances.",
    "keywords": "adaptation, biological-response, fish, laboratory, molecular-biology, north-pacific, ocean-acidification, otherprocess, performance, physiology",
    "name": "Species-specific responses of juvenile rockfish to elevated pCO2: from behavior to genomics",
    "url": "https://pacificdata.org/data/dataset/hamilton2017aspecies-specific-responses-of-juvenile-rockfish-to-elevated-pco2-from-behavior-to-"
}