{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-i-am-not-a-lost-cause-young-women-s-empowerment-and-teenage-pregnancy-in-the-pacific",
    "@type": "Dataset",
    "description": "This report focuses on the experiences of adolescent pregnancy and motherhood. It highlights the challenges that adolescent mothers face when pregnant and as mothers. \n\nOver the last decade, young women’s fertility rates (ages 15-19) across the Pacific have declined in eight countries. However, in five countries (Marshall Islands, Nauru, Papua New Guinea, Solomon Islands and Vanuatu) rates have remained high, at over 50 of births to women 15-19 years per 1,000 women 15-19 years. \n\nInvesting in adolescent girls’ and young women’s SRHR will contribute to preventing teenage pregnancy and sexually transmitted infections including HIV. Ultimately, however, such interventions can also enable and encourage girls to stay in schools; it will improve their understanding of their rights to live free from violence; equip them with understanding about safe options and enhance their ability to make informed choices. \n\nA number of initiatives are underway across the Pacific to empower girls and young women, address the multi-faceted barriers that young people face in their access to information and services and to challenge the stigma that teenagers confront when they are pregnant or young mothers: Enhancing access to and delivery of SRHR, including contraception, information and services in rural areas, informal settlements and outer islands; Institutionalising Comprehensive Sexuality Education in the school curricula for primary, secondary and tertiary educational institutes; Providing CSE for out of school youths, parents and communities; Creating enabling environments for the prevention of teenage pregnancy by addressing its underlying determinants including by involving young people in decision making processes.",
    "keywords": "Education, Health, Report, data, development-programming, enhancing-agency, human-rights, pacific-women, social-norms, violence",
    "name": "I Am Not A Lost Cause: Young Women’s Empowerment and Teenage Pregnancy in the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-i-am-not-a-lost-cause-young-women-s-empowerment-and-teenage-pregnancy-in-the-pacific"
}