{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/tatters2013bshort-and-long-term-conditioning-of-a-temperate-marine-diatom-community-to-acidific",
    "@type": "Dataset",
    "description": "Ocean acidification and greenhouse warming will interactively influence competitive success of key phytoplankton groups such as diatoms, but how long-term responses to global change will affect community structure is unknown. We incubated a mixed natural diatom community from coastal New Zealand waters in a short-term (two-week) incubation experiment using a factorial matrix of warming and/or elevated pCO2 and measured effects on community structure. We then isolated the dominant diatoms in clonal cultures and conditioned them for 1 year under the same temperature and pCO2 conditions from which they were isolated, in order to allow for extended selection or acclimation by these abiotic environmental change factors in the absence of interspecific interactions. These conditioned isolates were then recombined into ‘artificial' communities modelled after the original natural assemblage and allowed to compete under conditions identical to those in the short-term natural community experiment. In general, the resulting structure of both the unconditioned natural community and conditioned ‘artificial' community experiments was similar, despite differences such as the loss of two species in the latter. pCO2 and temperature had both individual and interactive effects on community structure, but temperature was more influential, as warming significantly reduced species richness. In this case, our short-term manipulative experiment with a mixed natural assemblage spanning weeks served as a reasonable proxy to predict the effects of global change forcing on diatom community structure after the component species were conditioned in isolation over an extended timescale. Future studies will be required to assess whether or not this is also the case for other types of algal communities from other marine regimes.",
    "keywords": "101594pangaea835476, biological-response, community-composition, laboratory, multiple-factors, oaiccdb, ocean-acidification, otherprocess, phytoplankton, south-pacific, temperature",
    "name": "Short- and long-term conditioning of a temperate marine diatom community to acidification and warming",
    "url": "https://pacificdata.org/data/dataset/tatters2013bshort-and-long-term-conditioning-of-a-temperate-marine-diatom-community-to-acidific"
}