{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/rivest2014responses-of-the-metabolism-of-the-larvae-of-pocillopora-damicornis-to-ocean-acidific",
    "@type": "Dataset",
    "description": "Ocean acidification and warming are expected to threaten the persistence of tropical coral reef ecosystems. As coral reefs face multiple stressors, the distribution and abundance of corals will depend on the successful dispersal and settlement of coral larvae under changing environmental conditions. To explore this scenario, we used metabolic rate, at holobiont and molecular levels, as an index for assessing the physiological plasticity of Pocillopora damicornis larvae from this site to conditions of ocean acidity and warming. Larvae were incubated for 6 hours in seawater containing combinations of CO2 concentration (450 and 950 microatm) and temperature (28 and 30 degrees C). Rates of larval oxygen consumption were higher at elevated temperatures. In contrast, high CO2 levels elicited depressed metabolic rates, especially for larvae released later in the spawning period. Rates of citrate synthase, a rate-limiting enzyme in aerobic metabolism, suggested a biochemical limit for increasing oxidative capacity in coral larvae in a warming, acidifying ocean. Biological responses were also compared between larvae released from adult colonies on the same day (cohorts). The metabolic physiology of Pocillopora damicornis larvae varied significantly by day of release. Additionally, we used environmental data collected on a reef in Moorea, French Polynesia to provide information about what adult corals and larvae may currently experience in the field. An autonomous pH sensor provided a continuous time series of pH on the natal fringing reef. In February/March, 2011, pH values averaged 8.075+/-0.023. Our results suggest that without adaptation or acclimatization, only a portion of naive Pocillopora damicornis larvae may have suitable metabolic phenotypes for maintaining function and fitness in an end-of-the century ocean.",
    "keywords": "101594pangaea835576, biological-response, corals, laboratory, multiple-factors, oaiccdb, ocean-acidification, physiology, south-pacific, temperature",
    "name": "Responses of the metabolism of the larvae of Pocillopora damicornis to ocean acidification and warming",
    "url": "https://pacificdata.org/data/dataset/rivest2014responses-of-the-metabolism-of-the-larvae-of-pocillopora-damicornis-to-ocean-acidific"
}