{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/zhao2017einsights-from-sodium-into-the-impacts-of-elevated-pco2-and-temperature-on-bivalve-shel",
    "@type": "Dataset",
    "description": "Ocean acidification and warming are predicted to affect the ability of marine bivalves to build their shells, but little is known about the underlying mechanisms. Shell formation is an extremely complex process requiring a detailed understanding of biomineralization processes. Sodium incorporation into the shells would increase if bivalves rely on the exchange of Na+/H+ to maintain homeostasis for shell formation, thereby shedding new light on the acid-base and ionic regulation at the calcifying front. Here, we investigated the combined effects of seawater pH (8.1, 7.7 and 7.4) and temperature (16 and 22 °C) on the growth and sodium composition of the shells of the blue mussel, Mytilus edulis, and the Yesso scallop, Patinopecten yessoensis. Exposure of M. edulis to low pH (7.7 and 7.4) caused a significant decrease of shell formation, whereas a 6 °C warming significantly depressed the rate of shell growth in P. yessoensis. On the other hand, while the amount of Na incorporated into the shells of P. yessoensis did not increase in acidified seawater, an increase of Na/Cashell with decreasing pH was observed in M. edulis, the latter agreeing well with the aforementioned hypothesis. Moreover, a combined analysis of the shell growth and sodium content provides a more detailed understanding of shell formation processes. Under acidified conditions, mussels may maintain more alkaline conditions favorable for calcification, but a significant decrease of shell formation indicates that the mineralization processes are impaired. The opposite occurs in scallops; virtually unaffected shell growth implies that shell mineralization functions well. Finding of the present study may pave the way for deciphering the mechanisms underlying the impacts of ocean acidification and warming on bivalve shell formation.",
    "keywords": "101594pangaea872396, biological-response, calcification, growth, laboratory, mollusks, multiple-factors, north-pacific, oaiccdb, ocean-acidification, physiology, temperature",
    "name": "Insights from sodium into the impacts of elevated pCO2 and temperature on bivalve shell formation",
    "url": "https://pacificdata.org/data/dataset/zhao2017einsights-from-sodium-into-the-impacts-of-elevated-pco2-and-temperature-on-bivalve-shel"
}