{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-gender-based-and-sorcery-related-violence-in-papua-new-guinea-an-analysis-of-data-collected-from",
    "@type": "Dataset",
    "description": "This report details data from 6,176 icidents of gender-based or sorcery accussation-related violence collected by seven women’s and human rights defenders’ organisations working across five provinces in Papua New Guinea.  These organisations provide safe houses, counselling and crisis support to survivors of violence.  The data analysis seeks to understand the type of violence inflicted, who is affected and who are reported as the perpetrators.\n\nWomen are more affected by violence than men with 78% of women being complainants. When the complainant was in an\nintimate partner relationship 84% were female. \n\nFinancial disagreements emerged as a key cause of violence, and mostly occurred in intimate partner relationships. Women\nwere mostly affected (84.1%), and the majority of complainants were not in formal employment (83.6%). However, a third of\nperpetrators (32.1%) were in formal employment. This suggest that there is disagreement with the way money is spent within\nthe family, and that this often results in violence in the home.\n\nThe analysis showed that sorcery accusations affect men and women almost equally. In addition, sorcery accusations\nare often directed towards families and perpetrators are more likely to be immediate family members or known community\nmembers. The data also showed that widow(er)s were strongly affected by sorcery related accusations and violence.\n\nRecommnedations from the data analysis are:\n\n- Greater investment by government to implement the National Strategy to Prevent and Respond to Gender Based Violence\n2016-2025, particularly the following areas:\n-  Gender responsive budgeting of national and local budgets, increased funding going towards projects which meet women\nand girls needs.\n-  Funding to be allocated to initiatives which focus on addressing sorcery related violence.\n-  Government recognition and support of the front line human rights defenders and organisations.\n- Continue to establish more Family Support Centres and Family Sexual Violence Units in every Province and the establishment\nof national shelters.\n\n- Increased commitment from government in implementing the Gender Equality and Social Inclusion policy at all levels of\ngovernment and provision of support/incentives to provincial and local governments who take the lead in innovative practices.\nto reduce the gender disparity within the work force.\n\n- Setting up of a Papua New Guinea Human Rights Commission to promote and protect the citizens’ human rights.",
    "keywords": "data, ending-violence-against-women, pacific-women, research-report, social-norms, violence",
    "name": "Gender-Based and Sorcery-Related Violence in Papua New Guinea: An analysis of data collected from Oxfam partners 2013-2016",
    "url": "https://pacificdata.org/data/dataset/pwl-gender-based-and-sorcery-related-violence-in-papua-new-guinea-an-analysis-of-data-collected-from"
}