{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/barry2014use-of-a-free-ocean-co2-enrichment-foce-system-to-evaluate-the-effects-of-ocean-acidif",
    "@type": "Dataset",
    "description": "The influence of ocean acidification in deep-sea ecosystems is poorly understood, but is expected to be large owing to the presumed low tolerance of deep-sea taxa to environmental change. We used a newly developed deep-sea Free Ocean CO2 Enrichment (dp-FOCE) system1 to evaluate the potential consequences of future ocean acidification on the feeding behavior of a deep-sea echinoid, the sea urchin, Strongylocentrotus fragilis. The dp-FOCE system simulated future ocean acidification inside an experimental enclosure where observations of feeding behavior were performed. We measured the average movement (“speed”) of urchins as well as the time required (“foraging time”) for S. fragilis to approach its preferred food (giant kelp) in the dp-FOCE chamber (-0.46 pH units) and a Control chamber (ambient pH). Measurements were performed during each of 4 trials (days -2, 2, 24, 27 after CO2 injection) during the month-long period when groups of urchins were continuously exposed to low pH or Control conditions. Although urchin speed did not vary significant in relation to pH or time exposed, foraging time was significantly longer for urchins in the low-pH treatment. This first deep-sea FOCE experiment demonstrated the utility of the FOCE system approach and suggest that the chemosensory behavior of a deep-sea urchin may be impaired by ocean acidification. ",
    "keywords": "biological-response, echinoderms, field, north-pacific, ocean-acidification, performance",
    "name": "Use of a Free Ocean CO2 Enrichment (FOCE) system to evaluate the effects of ocean acidification on the foraging behavior of a deep-sea urchin",
    "url": "https://pacificdata.org/data/dataset/barry2014use-of-a-free-ocean-co2-enrichment-foce-system-to-evaluate-the-effects-of-ocean-acidif"
}