{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/vargas2013co2-driven-ocean-acidification-reduces-larval-feeding-efficiency-and-change-food-sele",
    "@type": "Dataset",
    "description": "We present experimental data obtained from an experiment with newly hatched veliger larvae of the gastropod Concholepas concholepas exposed to three pCO2 levels. Egg capsules were collected from two locations in northern and central Chile, and then incubated throughout their entire intra-capsular life cycle at three nominal pCO2 levels, ∼400, 700 and 1000 ppm (i.e. corresponding to ∼8.0, 7.8 and 7.6 pH units, respectively). Hatched larvae were fed with natural food assemblages. Food availability at time zero did not vary significantly with pCO2 level. Our results clearly showed a significant effect of elevated pCO2 on the intensity of larval feeding, which dropped by \\textgreater60%. Incubation also showed that pCO2-driven ocean acidification (OA) may radically impact the selectivity of ingested food by C. concholepas larvae. Results also showed that larvae switched their clearance rate based on large cells, such as diatoms and dinoflagellates to tiny and highly abundant nanoflagellates and cyanobacteria as pCO2 levels increased. Thus, this study reveals the important effect of low pH conditions on larval feeding behavior, in terms of both ingestion magnitude and selectivity. These findings support the notion that larval feeding is a key physiological process susceptible to the effects of OA.  ",
    "keywords": "biological-response, laboratory, mollusks, ocean-acidification, performance, south-pacific",
    "name": "CO2-driven ocean acidification reduces larval feeding efficiency and change food selectivity in the mollusk Concholepas concholepas",
    "url": "https://pacificdata.org/data/dataset/vargas2013co2-driven-ocean-acidification-reduces-larval-feeding-efficiency-and-change-food-sele"
}