{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/guo2015aeffects-of-ocean-acidification-caused-by-rising-co2-on-the-early-development-of-three-m",
    "@type": "Dataset",
    "description": "Increasing atmospheric CO2 can decrease seawater pH and carbonate ions, which may adversely affect the larval survival of calcareous animals. In this study, we simulated future atmospheric CO2 concentrations (800, 1500, 2000 and 3000 ppm) and examined the effects of ocean acidification on the early development of 3 mollusks (the abalones Haliotis diversicolor and H. discus hannai and the oyster Crassostrea angulata). We showed that fertilization rate, hatching rate, larval shell length, trochophore development, veliger survival and metamorphosis all decreased significantly at different pCO2 levels (except oyster hatching). H. discus hannai were more tolerant of high CO2 compared to H. diversicolor. At 2000 ppm CO2, 79.2% of H. discus hannai veliger larvae developed normally, but only 13.3% of H. diversicolor veliger larvae. Tolerance of C. angulata to ocean acidification was greater than the 2 abalone species; 50.5% of its D‑larvae developed normally at 3000 ppm CO2. This apparent resistance of C. angulata to ocean acidification may be attributed to their adaptability to estuarine environments. Mechanisms underlying the resistance to ocean acidification of both abalones requires further investigation. Our results suggest that ocean acidification may decrease the yield of these 3 economically important shellfish if increasing CO2 is a future trend. ",
    "keywords": "biological-response, laboratory, mollusks, morphology, mortality, north-pacific, ocean-acidification, reproduction",
    "name": "Effects of ocean acidification caused by rising CO2 on the early development of three mollusks",
    "url": "https://pacificdata.org/data/dataset/guo2015aeffects-of-ocean-acidification-caused-by-rising-co2-on-the-early-development-of-three-m"
}