{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/nand2018a-simple-colorimetric-method-for-determining-seawater-alkalinity-using-bromophenol-blue",
    "@type": "Dataset",
    "description": "The development of small portable USB‐spectrophotometer systems makes monitoring alkalinity and pH possible in the field and remote locations. Here, we present a method utilizing purified bromophenol blue (BPB) as an end‐point indicator for making simple one‐point alkalinity measurements with spectrophotometric detection. The approach utilizes purified BPB dye whose absorbance characteristics have been determined over a range of temperatures and salinities. The end‐point pH for titrated samples was determined using the BPB absorbance ratio (R(t) = 25 A590/A436) for the acid and base forms via the following equation: urn:x-wiley:15415856:media:lom310253:lom310253-math-0001, where, e1 = 0.00533, e2 = 2.232, e3 = 0.0319. A pKa of 3.513 was determined for the dissociation of the second proton from the BPB dye. The temperature (t) dependence of R can be expressed using the following relationship: urn:x-wiley:15415856:media:lom310253:lom310253-math-0002. The dependence of the pKa on salinity (S) was weak and can be expressed as urn:x-wiley 15415856:media:lom310253:lom310253-math-0003. Application of the method for determining the alkalinity of in‐house and certified standards typically produced an uncertainty of ± 1.5 $μ$mol kg−1 for purified BPB dye. When the impure BPB dye was used as an end‐point indicator the uncertainty for alkalinity measured was slightly higher at approximately ± 3–4 $μ$mol kg−1. Hence, if high‐precision alkalinity measurements are not required (≥ 4 $μ$mol kg−1) then utilization of the unpurified BPB maybe suitable. We also compared the use of BPB to two other dyes: bromocresol purple (BCP) and bromocresol green (BCG). The utilization of all three dyes for end‐point determination produced comparable results with an overall precision of ± 4 $μ$mol kg−1. The one‐point titration method using BPB was utilized at a remote field location, One Tree Island, Australia and was found to be suitable for producing accurate and precise alkalinity data in a timely manner; ∼ 10–15 samples can be determined per hour. When combined with seawater pH measurements, the one‐point titration method allows the full marine carbonate system to be fully constrained without the need for high‐tech spectrophotometric equipment and comprehensive laboratory facilities.",
    "keywords": "chemistry, field, methods, ocean-acidification, south-pacific",
    "name": "A simple colorimetric method for determining seawater alkalinity using bromophenol blue",
    "url": "https://pacificdata.org/data/dataset/nand2018a-simple-colorimetric-method-for-determining-seawater-alkalinity-using-bromophenol-blue"
}