{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/leung2018boosted-nutritional-quality-of-food-by-co2-enrichment-fails-to-offset-energy-demand-of",
    "@type": "Dataset",
    "description": "The CO2-boosted trophic transfer from primary producers to herbivores has been increasingly discovered at natural CO2 vents and in laboratory experiments. Despite the emerging knowledge of this boosting effect, we do not know the extent to which it may be enhanced or dampened by ocean warming. We investigated whether ocean acidification and warming enhance the nutritional quality (C:N ratio) and energy content of turf algae, which is speculated to drive higher feeding rate, greater energy budget and eventually faster growth of herbivores. This proposal was tested by observing the physiological (feeding rate, respiration rate and energy budget) and demographic responses (growth and survival) of a common grazing gastropod (Phasianella australis) to ocean acidification and warming in a 6-month mesocosm experiment. Whilst we observed the boosting effect of ocean acidification and warming in isolation on the energy budget of herbivores by either increasing feeding rate on the more nutritious algae or increasing energy gain per feeding effort, their growth and survival were reduced by the sublethal thermal stress under ocean warming, especially when both climate change stressors were combined. This reduced growth and survival occurred as a consequence of depleted energy reserves, suggesting that the boosting effect via trophic transfer might not sufficiently compensate for the increased energy demand imposed by ocean warming. In circumstances where ocean acidification and warming create an energy demand on herbivores that outweighs the energy enhancement of their food (i.e. primary producers), the performance of herbivores to control their blooming resources likely deteriorates and thus runaway primary production ensues.  ",
    "keywords": "algae, biological-response, laboratory, mesocosms, mollusks, morphology, mortality, multiple-factors, ocean-acidification, performance, physiology, respiration, south-pacific, temperature",
    "name": "Boosted nutritional quality of food by CO2  enrichment fails to offset energy demand of herbivores under ocean warming, causing energy depletion and mortality",
    "url": "https://pacificdata.org/data/dataset/leung2018boosted-nutritional-quality-of-food-by-co2-enrichment-fails-to-offset-energy-demand-of"
}