{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-actions-and-impacts-for-a-peaceful-pacific-2015-and-beyond",
    "@type": "Dataset",
    "description": "This publication brings together the perspectives of women involved in the Leitana Nehan Women’s Development Agency of Bougainville, Vois Blong Mere Solomon of Solomon Islands and Ma’a Fafine mo e Famili of Tonga. Women in these groups are active in peace building and service in many spheres of their communities, connected through FemLINKPACIFIC’s Pacific Women’s Media and Policy Network on UN Security Council Resolution 1325 (Women, Peace and Security). \n\nHuman security requires multiple and diverse actors to develop solutions to interdependent threats and the Regional Action Plan on Women, Peace and Security provides the framework for ensuring the inclusion of women, particularly as part of civilian oversight, participation and ownership of the security sector and reform processes. \n\nWomen are ‘waging peace’ and are spearheading the critical shift from commitments to operationalization of SCR 1325, and CEDAW to ensure an effective response to the complex and multifaceted threats and challenges to human security in the Pacific. An effective response requires the participation, recognition and valuing of the experiences and role of women. \n\nThe women who have crossed conflict lines to promote non-violence, peace and human rights, usually ignoring the personal risks that such actions could cause, still often remain outside of the formal peace process, excluded from the structures that make the decisions to sustain peace or engage in conflict.",
    "keywords": "autonomous-region-of-bougainville, climate-change-and-environment, ending-violence-against-women, enhancing-agency, human-rights, leadership-and-politics, pacific-women, policy-notes-and-papers, social-media-and-popular-culture, social-norms, violence",
    "name": "Actions and Impacts for a Peaceful Pacific: 2015 and Beyond",
    "url": "https://pacificdata.org/data/dataset/pwl-actions-and-impacts-for-a-peaceful-pacific-2015-and-beyond"
}