{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-swimming-against-the-tide-lessons-learned-from-field-research-on-violence-against-women-in-the-s",
    "@type": "Dataset",
    "description": "Lessons from the UNFPA’s process of conducting researching violence against women in Kiribati and Solomon Islands included: \n\n- There is overwhelming evidence that the studies in the Solomon Islands and Kiribati were generally been carried out appropriately and effectively. \n\n- There is an overriding sense of achievement, all field workers came back safely and intact, a phenomenal job was done and an enormous amount of data was collected with high response rates and disclosure rates. \n\n- Respondents generally felt satisfied, relieved and valued for having been able to share their stories. \n\n- There were many issues and challenges and that lessons have been learned that should be taken into consideration for future work. \n\n- Success is largely thanks to the regional and country research teams who had effectively mobilised stakeholders and achieved buy-in from many levels, and (when they realised they did not have all the technical and gender background in the team) knew how to tap expert support all along the process of the project. \n\n- Important contributions were made by a number of technical advisors, representatives from donors, and expert consultants throughout the process. \n\n- Entering unknown territory and using approaches for surveys on sensitive topics that they had not used before, with due consideration for ethics and safety, the teams managed to bring the research to a good end. They successfully accessed, involved and used mentors and technical experts for moral and technical support, to develop structures and links and maintained relationships and were able to learn by doing.\n\n- The researchers and fieldworkers developed an increased understanding and commitment to work on reducing violence against women. • The project can serve as a best practice model for researching violence against women as a data collection activity and as a participatory approach with capacity and awareness building.",
    "keywords": "data, development-programming, ending-violence-against-women, huamn-rights, pacific-women, research-report, social-norms, violence",
    "name": "Swimming Against the Tide: Lessons Learned from Field Research on Violence Against Women in the Solomon Islands and Kiribati",
    "url": "https://pacificdata.org/data/dataset/pwl-swimming-against-the-tide-lessons-learned-from-field-research-on-violence-against-women-in-the-s"
}