{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-eliminating-violence-against-women-evaw-in-pohnpei-and-chuuk-federated-states-of-micronesia",
    "@type": "Dataset",
    "description": "This three-part report contains a mapping of essential services for survivors of violence against women and actions, outlining the assessment of what is in place that needs strengthening and gap areas. The assessment aims to inform stakeholders at national and state level on the strength of available services aimed at eliminating violence against women in the two states of Pohnpei and Chuuk and to identify gaps in services so as to provide a way forward for eliminating family and sexual violence and for assisting government to report on regional and international obligations. The report situates domestic violence in the context of gender inequality. Brief information on gender equality indicators is provided and background on the State Women’s Machinery. An introduction to the Essential Services Package follows and leads into the assessment of Chuuk State essential services against the model. \n\nInformation available suggests that the Federated States of Micronesia generally, and Pohnpei State and Chuuk State individually, have made some progress in addressing violence against women and children but generally lack quality essential services to eliminate violence against women and girls. This is especially the case for women and children with disabilities, other especially vulnerable communities, those living in rural and remote areas and those made vulnerable by other circumstances, eg, poverty. There are women’s and youth groups that raise awareness about family and sexual violence and have been instrumental in creating momentum for legislation.",
    "keywords": "development-programming, ending-violence-against-women, pacific-women, social-norms, violence",
    "name": "Eliminating Violence against Women (EVAW) in Pohnpei and Chuuk, Federated States of Micronesia",
    "url": "https://pacificdata.org/data/dataset/pwl-eliminating-violence-against-women-evaw-in-pohnpei-and-chuuk-federated-states-of-micronesia"
}