{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-state-of-the-world-s-population-report-2013-motherhood-in-childhood",
    "@type": "Dataset",
    "description": "Every day, 20,000 girls below age 18 give birth in developing countries. Births to girls also occur in developed countries but on a much smaller scale. Most of the world’s births to adolescents— 95 per cent—occur in developing countries, and nine in 10 of these births occur within marriage or a union. About 19 per cent of young women in developing countries become pregnant before age 18. Girls under 15 account for 2 million of the 7.3 million births that occur to adolescent girls under 18 every year in developing countries. \n\nA pregnancy can have immediate and lasting consequences for a girl’s health, education and income-earning potential. And it often alters the course of her entire life. How it alters her life depends in part on how old—or young—she is. \n\nUnderlying causes of adolescent pregnancy are: \n\n- Child marriage. \n\n- Gender inequality. \n\n- Obstacles to human rights. \n\n- Poverty. \n\n- Sexual violence and coercion. \n\n- National policies restricting access to contraception, age-appropriate sexuality education. \n\n- Lack of access to education and reproductive health services. \n\n- Underinvestment in adolescent girls’ human capital. \n\nMany countries have taken up the cause of preventing adolescent pregnancies, often through actions aimed at changing a girl’s behaviour. Implicit in such interventions are a belief that the girl is responsible for preventing pregnancy and an assumption that if she does become pregnant, she is at fault. Such approaches and thinking are misguided because they fail to account for the circumstances and societal pressures that conspire against adolescent girls and make motherhood a likely outcome of their transition from childhood to adulthood. \n\nWhat is needed is a new way of thinking about the challenge of adolescent pregnancy. Instead of viewing the girl as the problem and changing her behaviour as the solution, governments, communities, families and schools should see poverty, gender inequality, discrimination, lack of access to services, and negative views about girls and women as the real challenges, and the pursuit of social justice, equitable development and the empowerment of girls as the true pathway to fewer adolescent pregnancies.",
    "keywords": "Education, Health, Report, development-progamming, enhancing-agency, human-rights, pacific-women, social-norms, violence",
    "name": "State of the World’s Population Report 2013: Motherhood in Childhood",
    "url": "https://pacificdata.org/data/dataset/pwl-state-of-the-world-s-population-report-2013-motherhood-in-childhood"
}