{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/cornwall2014diffusion-boundary-layers-ameliorate-the-negative-effects-of-ocean-acidification-on",
    "@type": "Dataset",
    "description": "Anthropogenically-modulated reductions in pH, termed ocean acidification, could pose a major threat to the physiological performance, stocks, and biodiversity of calcifiers and may devalue their ecosystem services. Recent debate has focussed on the need to develop approaches to arrest the potential negative impacts of ocean acidification on ecosystems dominated by calcareous organisms. In this study, we demonstrate the role of a discrete (i.e. diffusion) boundary layer (DBL), formed at the surface of some calcifying species under slow flows, in buffering them from the corrosive effects of low pH seawater. The coralline macroalga Arthrocardia corymbosa was grown in a multifactorial experiment with two mean pH levels (8.05 ‘ambient' and 7.65 a worst case ‘ocean acidification' scenario projected for 2100), each with two levels of seawater flow (fast and slow, i.e. DBL thin or thick). Coralline algae grown under slow flows with thick DBLs (i.e., unstirred with regular replenishment of seawater to their surface) maintained net growth and calcification at pH 7.65 whereas those in higher flows with thin DBLs had net dissolution. Growth under ambient seawater pH (8.05) was not significantly different in thin and thick DBL treatments. No other measured diagnostic (recruit sizes and numbers, photosynthetic metrics, %C, %N, %MgCO3) responded to the effects of reduced seawater pH. Thus, flow conditions that promote the formation of thick DBLs, may enhance the subsistence of calcifiers by creating localised hydrodynamic conditions where metabolic activity ameliorates the negative impacts of ocean acidification.",
    "keywords": "101594pangaea836665, algae, biological-response, calcification, growth, laboratory, oaiccdb, ocean-acidification, photosynthesis, reproduction, south-pacific",
    "name": "Diffusion boundary layers ameliorate the negative effects of ocean acidification on the temperate coralline macroalga Arthrocardia corymbosa",
    "url": "https://pacificdata.org/data/dataset/cornwall2014diffusion-boundary-layers-ameliorate-the-negative-effects-of-ocean-acidification-on"
}