{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-rio-20-important-issues-for-pacific-island-women",
    "@type": "Dataset",
    "description": "Pacific Islands Forum Leaders have acknowledged the importance of gender equality through the Pacific Plan and in various Forum Communiqués. The purpose of this brief is to draw the attention of Pacific delegates attending the Rio +20 conference to the importance of gender equality and to ensure contributions to the global sustainable development agenda and negotiations take into consideration gender equality commitments made at the regional and international levels. It is recommended the gender specific information contained in this brief be used by representatives of member countries in their own national statements, country interventions and in various other high-level meetings running in parallel with the Rio +20 Summit. \n\nKey messages in the brief are: \n\n- Increasing poverty is increasing women’s burden. \n\n- Women’s economic empowerment is one of the critical areas of the Pacific Platform for Action on Gender Equality and the Advancement of Women. \n\n- Gender-blind macroeconomic policies may have adverse effects on women and increase gender inequalities. \n\n- The development of a green economy that will benefit both women and men requires gender-responsive economic policies and programmes. \n\n- Promoting gender equality through education will prepare the younger generation to address the emerging issues that Pacific Islands face. \n\n- The well-being of Pacific Island people requires the development of an enabling environment for women’s rights to health care services and for their reproductive and sexual rights. \n\n- Gender-based violence has tremendous individual, social and economic costs. \n\n- Depletion of natural resources and environmental stresses do not have the same impacts on women and men. \n\n- Women’s role as farmers and in fisheries is often overlooked. \n\n- Women’s participation in policy making and design of training and services in relation to land use are fundamental for adapting to environmental stresses and climate change. \n\n- Developing sustainable sources of energy to address the needs of both women and men is critical for sustaining the development of Pacific Island countries and territories. \n\n- Numerous international and regional platforms and conventions state the importance of gender equality for achieving development, peace, prosperity and resilience. \n\n- The Pacific Island region is still struggling to meet the commitments towards gender equality and improve women’s human rights. \n\n- The Pacific Platform for Action on the Advancement of Women and Gender Equality is a key instrument in the promotion of gender equality for sustainable development in the Pacific Islands region. \n\n- Delegations from Pacific Island countries and territories can play a significant role in putting forward gender equality and women’s human rights during Rio +20 negotiations.",
    "keywords": "Education, Health, climate-change-and-environment, enhancing-agency, human-rights, land-sea-and-livelihoods, leadership-and-decision-making, pacific-women, policy-notes-and-papers, social-norms, violence",
    "name": "Rio+20: Important Issues for Pacific Island Women",
    "url": "https://pacificdata.org/data/dataset/pwl-rio-20-important-issues-for-pacific-island-women"
}