{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-review-of-unicef-pacific-child-protection-programme-report",
    "@type": "Dataset",
    "description": "This review found that UNICEF’s Child Protection Programme is aligned with Pacific country commitments to upholding children’s rights, and its approaches largely target regional priorities, structures and gaps.  Specific findings included: \n\n- There is a need to better contextualise child protection system strengthening approaches to national and local circumstances, and to sharpen messages so that the goals are explicitly communicated and the intended impact is more in focus.  \n\n- Strengthening relationships and collaborating with national and regional actors working to end violence against women and improve Pacific justice systems could help to strengthen child protection systems. \n\n- A tailored national framework to track child protection system strengthening progress, and other relevant tools, would improve child protection coordination. \n\n- There is limited evidence that the programme’s community mobilisation and behaviour change approaches and tools strengthened skills, knowledge and behaviours, or was effective in developing child protection systems. \n\n- Advocacy for child protection systems building has been less influential in raising the visibility and gravity of all forms of violence against children, and in highlighting the link between child protection system building and prevention of and response to violence, abuse and exploitation of children. \n\n- Collaboration on child protection work has been uneven, and increased coordination and learning with multi-stakeholder partners, including those working to end violence against women and other protection systems, is needed. \n\n- The limited number of national child protection policies or plans contributed to a fragmented, project-oriented programme in most countries. \n\n- Funds and expertise could have been better used to achieve results through assessing and prioritising partners’ readiness for funding support, and by identifying more realistic technical and institutional requirements. \n\n- The child protection systems building approach is conducive to achieving sustainable outcomes, but increased attention to appropriate institutional arrangements, planning and budgeting processes is needed to help strengthen and protect programme investments. \n\n- Mainstreaming child protection in various national and community based protection system interventions and referral pathways, and deepening alliances with other networks, such as those working on eliminating violence against women and girls, has been limited, but are important strategies for sustainability in the Pacific context. \n\n- In most countries, child protection system strengthening is highly dependent on UNICEF funding.",
    "keywords": "Report, development-programming, ending-violence-against-women, human-rights, pacific-women, social-norms, violene",
    "name": "Review of UNICEF Pacific Child Protection Programme Report",
    "url": "https://pacificdata.org/data/dataset/pwl-review-of-unicef-pacific-child-protection-programme-report"
}