{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/spc_cok_2001_phc_v01_m",
    "@type": "Dataset",
    "description": "-HOUSEHOLD: Household listing, household characteristics, energy, communication and primary activities.\n\n-INDIVIDUAL: Individual characteristics, education, economic activity, income and fertility.\n\nThe scope of the early Cook Islands censuses was limited, in fact they consisted of head counts only. With the passage of time the census has expanded. Gradually, questions on sex, age, marital status, religion, education, employment, etc have been included. Questions on unpaid work and income earned were included for the first time in the 1996 Census. In the 2001 Census, questions on disability and waste management was included.\nA personal questionnaire is completed for every man, woman and child alive at midnight on census night within the geographical boundaries of the Cook Islands. The Census excludes those persons on foreign vessels, yachts and aircraft flying through or stopping temporarily (transit). A dwelling questionnaire is completed for every occupied dwelling as at midnight on census night.\n\nThe format of the questionnaires for the 2001 Census of Population and Dwellings was similar to that of the 1996 Census. The dwelling questionnaire contained 26 questions, requesting information on the number of persons in the dwelling, type of dwelling, year dwelling was constructed, appliances and amenities, subsistence agricultural and fishing activities, etc.\nThe personal questionnaire was split into several parts:\nQuestions 1 to 6 - relates to every person in the Cook Islands on census night.\nQuestions 7 to 11(ii) - relates to every person in the Cook Islands on census night excluding visitors and those that were currently serving a sentence in jail.\nQuestions 11(iii) - relates to every person over the age of 1 year.\nQuestions 11(iv) to 12(d) - relates to every person over the age of 5 years.\nQuestions 12(e) to Q21 - relates to every person over the age of 15 years.\nQuestions 22 - relates only to females 15 years and over.\n\nThe Cook Islands are geographically divided into a number of Census Districts coinciding with the electoral boundaries, and these were further divided into enumeration areas. An enumerator is then assigned to collect the census forms for each enumeration area.",
    "keywords": "census, cook-islands, economic-activity, education, household-characteristics, income, population",
    "name": "Cook Islands Population and Housing Census 2001",
    "url": "https://pacificdata.org/data/dataset/spc_cok_2001_phc_v01_m"
}