{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-solomon-islands-family-health-and-safety-study",
    "@type": "Dataset",
    "description": "The Solomon Islands study shows that violence against women is prevalent: \n\n- 64% of ever-partnered women aged 15–49 reported experiencing physical or sexual violence, or both, by an intimate partner. \n\n- Women in Solomon Islands are more likely to experience severe forms of physical partner violence, such as punching, kicking, or having a weapon used against them, rather than just moderate violence. \n\n- 56% of women aged 15–49 who had ever been in a relationship reported experiencing emotional abuse by a partner at least once. \n\n- Among women aged 15–49, 18% reported experiencing physical violence by someone other than an intimate partner. \n\n- Childhood sexual abuse (sexual abuse before the age of 15). \n\n- 37% of women aged 15–49 had been sexually abused before the age of 15. \n\n- Among women who reported that they had ever had sexual intercourse, 38% reported that their first sexual experience was either coerced or forced and the younger the girl at first sexual encounter, the more likely sex was forced. The relatively high prevalence of intimate partner violence in Solomon Islands likely relates to a multitude of factors at all levels of society. \n\nSignificant contributors may include: \n\n- The acceptability of violence against women – the majority of women (73%) in Solomon Islands believe that a man is justified in beating his wife under some circumstances (in particular, for infidelity and disobedience). \n\n- The frequent use of physical punishment to discipline women who are seen as transgressing their prescribed gender roles. \n\n- The common practice of physically disciplining children, which means that children learn from a young age that physical violence is normal (cycle of violence). \n\n- The fact that the law does not define partner violence, particularly marital rape, as a crime and p the lack of formal support services, which makes it difficult for women to seek help.",
    "keywords": "Report, data, ending-violence-against-women, pacific-women, social-norms, violence",
    "name": "Solomon Islands Family Health and Safety Study",
    "url": "https://pacificdata.org/data/dataset/pwl-solomon-islands-family-health-and-safety-study"
}