{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/xu2015beffects-of-co2-and-seawater-acidification-on-the-early-stages-of-saccharina-japonica-dev",
    "@type": "Dataset",
    "description": "In this paper, we demonstrated that ocean acidification (OA) had significant negative effects on the microscopic development of Saccharina japonica in a short-term exposure experiment under a range of light conditions. Under elevated CO2, the alga showed a significant reduction in meiospore germination, fecundity, and reproductive success. Larger female and male gametophytes were noted to occur under high CO2 conditions and high light magnified these positive effects. Under conditions of low light combined with high PCO2, the differentiation of gametophytes was delayed until the end of the experiment. By contrast, gametophytes were able to survive after having been subjected to a long-term acclimation period, of 105 days. Although the elevated PCO2 resulted in a significant increase in sporophyte length, the biomass abundance (expressed as individual density attached to the seed fiber) was reduced significantly. Further stress resistance experiments showed that, although the acidified samples had lower resistance to high light and high temperature conditions, they displayed higher acclimation to CO2-saturated seawater conditions compared with the control groups. These combined results indicate that OA has a severe negative effect on S. japonica, which may result in future shifts in species dominance and community structure. ",
    "keywords": "adaptation, algae, biological-response, laboratory, light, morphology, multiple-factors, north-pacific, ocean-acidification, otherprocess, photosynthesis, reproduction, temperature",
    "name": "Effects of CO2 and seawater acidification on the early stages of Saccharina japonica development",
    "url": "https://pacificdata.org/data/dataset/xu2015beffects-of-co2-and-seawater-acidification-on-the-early-stages-of-saccharina-japonica-dev"
}