{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/papua-new-guinea-sea-level-information-12",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((139.20137452543452 -14.748448665973001, 139.20137452543452 2.5923770264788, 162.80337908773708 2.5923770264788, 162.80337908773708 -14.748448665973001, 139.20137452543452 -14.748448665973001))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "In September 1994, a SEAFRAME (Sea Level Fine Resolution Acoustic Measuring Equipment) gauge was installed in Manus Island, Papua New Guinea. Information recorded from the gauge, is held in this record and provided in the form of Yearly Reports, Tide Prediction Calendars and Hourly Sea Level and meteorological data from the Manus - Lombrum station. This is downloadable from the Distribution Info Section of this metadata record and dataset available in digital text format.Aside from a ten month interval when the wharf was being refurbished, the gauge has been returning high resolution, good scientific quality data since installation.SEAFRAME gauges not only measure sea level by two independent means, but also a number of \"ancillary\" variables - air and water temperatures, wind speed, wind direction and atmospheric pressure. This is part of the AusAID-sponsored South Pacific Sea Level and Climate Monitoring Project (\"Pacific Project\") for the FORUM region, in response to concerns raised by its member countries over the potential impacts of an enhanced Greenhouse Effect on climate and sea levels in the South Pacific region. Project Implementation partners include Australian Bureau of Meteorology , National Tide Center, National Climate Center, Geoscience Australia and SPC ,SOPAC Division.To monitor changes in sea level and climate in the Pacific. The SPSLCMP project information is a unique detailed record of Tide predictions and Meteorological information from the different member Pacific Island countries. These information can be used for diverse purposes by boats, fishermen, government agencies, surveyors, planners, consulting scientists, environmental engineers and other individuals. These purposes include navigation purposes in shallow and narrow ports and intra-coastal waterways, improving fish catches , planning coastal rehabilitation, construction projects, recreation purposes such as catching big waves for surfers and a variety of other applications.Station Location: PNG, Manus, Lombrum,  Height of Seaframe Sensor Bench Mark above Tide Gauge Zero -4.5813, Latitude - \t02° 02' 10\" S, Longitude - 147° 22' 31\" E.Tide gauges measures relative sea level change, i.e., the change in sea level relative to the tide gauge, which is connected to the land. SEAFRAME location: Papua New Guinea; Minimum recorded air temperature (degrees C): 21.5; Maximum recorded air temperature (degrees C): 31.8.",
    "keywords": "lombrum, manus, marine, oceanography, papua-new-guinea, sea-level-and-climate-change-in-papua-new-guinea, water",
    "name": "Papua New Guinea Sea Level Information #12",
    "url": "https://pacificdata.org/data/dataset/papua-new-guinea-sea-level-information-12"
}