{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-fiji-young-women-s-forum-outcomes-statement-2013",
    "@type": "Dataset",
    "description": "The Fiji Young Women’s’ Forum convened by Diverse Voices and Action for Equality (DIVA), Emerging Leaders Forum Alumni, Young Women Producers and Broadcasters - FemLINKpacific and the Young Women’s Christian Association, brought together young women leaders and activists aged 18 – 30 years from Fiji to discuss barriers and strategies to young women’s meaningful participation and representation in Fiji’s democratisation process. \n\nYoung Fijian women leaders including transwomen, women living with disabilities, LGBTQI women, rural women, mental health consumers and young women in all our diversities affirmed their power as implementers and contributors of positive change, decision makers, partners and leaders of today and the future. ‘Our strength is in our numbers and in our diversity.’ \n\nThe forum builds on the initial Fiji Women’s Forum and a rich tradition of activism of Fijian women throughout our national history and is committed to representing young women throughout the country. The Fiji Young Women’s’ Forum acknowledges and recognises the work of the many women who have gone before and the gains that they have made for young women today. \n\nThe Outcomes Statement from the Forum addresses: \n\n- Young women’s political participation and representation. \n\n- Rights based, participatory democratisation processes. \n\n- Sustainable development.",
    "keywords": "climate-change-and-environment, development-programming, human-rights, leadership-and-decision-making, leadership-and-politics, outcomes-statement, pacific-women, social-norms",
    "name": "Fiji Young Women’s Forum Outcomes Statement 2013",
    "url": "https://pacificdata.org/data/dataset/pwl-fiji-young-women-s-forum-outcomes-statement-2013"
}