{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/farfan2018mineralogy-of-deep-sea-coral-aragonites-as-a-function-of-aragonite-saturation-state",
    "@type": "Dataset",
    "description": "In an ocean with rapidly changing chemistry, studies have assessed coral skeletal health under projected ocean acidification (OA) scenarios by characterizing morphological distortions in skeletal architecture and measuring bulk properties, such as net calcification and dissolution. Few studies offer more detailed information on skeletal mineralogy. Since aragonite crystallography will at least partially govern the material properties of coral skeletons, such as solubility and strength, it is important to understand how it is influenced by environmental stressors. Here, we take a mineralogical approach using micro X-ray diffraction (XRD) and whole pattern Rietveld refinement analysis to track crystallographic shifts in deep-sea coral Lophelia pertusa samples collected along a natural seawater aragonite saturation state gradient ($Ømega$sw = 1.15–1.44) in the Gulf of Mexico. Our results reveal statistically significant linear relationships between rising $Ømega$sw and increasing unit cell volume driven by an anisotropic lengthening along the b-axis. These structural changes are similarly observed in synthetic aragonites precipitated under various saturation states, indicating that these changes are inherent to the crystallography of aragonite. Increased crystallographic disorder via widening of the full width at half maximum of the main (111) XRD peaks trend with increased Ba substitutions for Ca, however, trace substitutions by Ba, Sr, and Mg do not trend with crystal lattice parameters in our samples. Instead, we observe a significant trend of increasing calcite content as a function of both decreasing unit cell parameters as well as decreasing $Ømega$sw. This may make calcite incorporation an important factor to consider in coral crystallography, especially under varying aragonite saturation states ($Ømega$Ar). Finally, by defining crystallography-based linear relationships between $Ømega$Ar of synthetic aragonite analogs and lattice parameters, we predict internal calcifying fluid saturation state ($Ømega$cf = 11.1–17.3 calculated from b-axis lengths; 15.2–25.2 calculated from unit cell volumes) for L. pertusa, which may allow this species to calcify despite the local seawater conditions. This study will ideally pave the way for future studies to utilize quantitative XRD in exploring the impact of physical and chemical stressors on biominerals.",
    "keywords": "biogeochemistry, biological-response, corals, field, laboratory, north-atlantic, north-pacific, ocean-acidification, physiology",
    "name": "Mineralogy of deep-sea coral aragonites as a function of aragonite saturation state",
    "url": "https://pacificdata.org/data/dataset/farfan2018mineralogy-of-deep-sea-coral-aragonites-as-a-function-of-aragonite-saturation-state"
}