{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/rocker2015bexpression-of-calcification-and-metabolism-related-genes-in-response-to-elevated-pco",
    "@type": "Dataset",
    "description": "Declining health of scleractinian corals in response to deteriorating environmental conditions is widely acknowledged, however links between physiological and functional genomic responses of corals are less well understood. Here we explore growth and the expression of 20 target genes with putative roles in metabolism and calcification in the branching coral, Acropora millepora, in two separate experiments: 1) elevated pCO2 (464, 822, 1187 and 1638 $μ$atm) and ambient temperature (27 °C), and 2) elevated pCO2 (490 and 822 $μ$atm) and temperature (28 and 31 °C). After 14 days of exposure to elevated pCO2 and ambient temperatures, no evidence of differential expression of either calcification or metabolism genes was detected between control and elevated pCO2 treatments. After 37 days of exposure to control and elevated pCO2, Ubiquinol-Cytochrome-C Reductase Subunit 2 gene (QCR2; a gene involved in complex III of the electron chain transport within the mitochondria and critical for generation of ATP) was significantly down-regulated in the elevated pCO2 treatment in both ambient and elevated temperature treatments. Overall, the general absence of a strong response to elevated pCO2 and temperature by the other 19 targeted calcification and metabolism genes suggests that corals may not be affected by these stressors on longer time scales (37 days). These results also highlight the potential for QCR2 to act as a biomarker of coral genomic responses to changing environments.",
    "keywords": "biological-response, calcification, corals, laboratory, molecular-biology, morphology, multiple-factors, ocean-acidification, physiology, south-pacific, temperature",
    "name": "Expression of calcification and metabolism-related genes in response to elevated pCO2 and temperature in the reef-building coral Acropora millepora",
    "url": "https://pacificdata.org/data/dataset/rocker2015bexpression-of-calcification-and-metabolism-related-genes-in-response-to-elevated-pco"
}