{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/moya2012whole-transcriptome-analysis-of-the-coral-acropora-millepora-reveals-complex-responses-",
    "@type": "Dataset",
    "description": "The impact of ocean acidification (OA) on coral calcification, a subject of intense current interest, is poorly understood in part because of the presence of symbionts in adult corals. Early life history stages of Acropora spp. provide an opportunity to study the effects of elevated CO2 on coral calcification without the complication of symbiont metabolism. Therefore, we used the Illumina RNAseq approach to study the effects of acute exposure to elevated CO2 on gene expression in primary polyps of Acropora millepora, using as reference a novel comprehensive transcriptome assembly developed for this study. Gene ontology analysis of this whole transcriptome data set indicated that CO2-driven acidification strongly suppressed metabolism but enhanced extracellular organic matrix synthesis, whereas targeted analyses revealed complex effects on genes implicated in calcification. Unexpectedly, expression of most ion transport proteins was unaffected, while many membrane-associated or secreted carbonic anhydrases were expressed at lower levels. The most dramatic effect of CO2-driven acidification, however, was on genes encoding candidate and known components of the skeletal organic matrix that controls CaCO3 deposition. The skeletal organic matrix effects included elevated expression of adult-type galaxins and some secreted acidic proteins, but down-regulation of other galaxins, secreted acidic proteins, SCRiPs and other coral-specific genes, suggesting specialized roles for the members of these protein families and complex impacts of OA on mineral deposition. This study is the first exhaustive exploration of the transcriptomic response of a scleractinian coral to acidification and provides an unbiased perspective on its effects during the early stages of calcification. ",
    "keywords": "101594pangaea831695, biological-response, calcification, corals, epoca-paper, laboratory, molecular-biology, oaiccdb, ocean-acidification, south-pacific",
    "name": "Whole transcriptome analysis of the coral Acropora millepora reveals complex responses to CO2-driven acidification during the initiation of calcification",
    "url": "https://pacificdata.org/data/dataset/moya2012whole-transcriptome-analysis-of-the-coral-acropora-millepora-reveals-complex-responses-"
}