{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/mclaughlin2018aseasonal-patterns-in-aragonite-saturation-state-on-the-southern-california-conti",
    "@type": "Dataset",
    "description": "Shoaling of the saturation horizon for aragonite in the California Current System has been well-documented; however, these reports are based primarily on surveys conducted in waters off the continental shelf. Here we characterize, for the first time, regional spatial and seasonal patterns in aragonite saturation state ($Ømega$arag) in the shallow, nearshore waters of the southern California continental shelf through a series of synoptic surveys. Spectrophotometric pH and total alkalinity samples were collected quarterly from 72 sites along the shelf for two years. Samples were collected using Niskin bottles deployed at 2–3 depths per station (surface, mixed layer, and near-bottom) to characterize site extremes in $Ømega$arag (highest values near the surface, lowest at depth). $Ømega$arag in bottle samples ranged between 3.0 and 0.54 and was strongly associated with density; average $Ømega$arag from samples collected in the top 10 m was 2.5 compared to an average of 1.1 in samples below 100 m. The average depth of corrosive waters ($Ømega$arag \\textless 1) was interpolated for the shelf from the bottle data and was estimated to be an average of 100 m regionally, though there were instances when the saturation horizon rose to less than 20 m depth, primarily in the northern part of the coast during the spring. $Ømega$arag was strongly correlated with dissolved inorganic carbon and dissolved oxygen indicating that patterns in $Ømega$arag were linked to biological processes. The seasonality and spatial patterns we observed on the continental shelf were comparable to those observed by the California Cooperative Fisheries Investigations (CalCOFI) and West Coast Ocean Acidification (WCOA) programs in offshore southern California waters, suggesting that oceanic forcing is a strong driver defining broad patterns in aragonite saturation state on the shelf.",
    "keywords": "chemistry, field, north-pacific, ocean-acidification",
    "name": "Seasonal patterns in aragonite saturation state on the southern California continental shelf",
    "url": "https://pacificdata.org/data/dataset/mclaughlin2018aseasonal-patterns-in-aragonite-saturation-state-on-the-southern-california-conti"
}