{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/rosa2008synergistic-effects-of-climate-related-variables-suggest-future-physiological-impairmen",
    "@type": "Dataset",
    "description": "By the end of this century, anthropogenic carbon dioxide (CO2) emissions are expected to decrease the surface ocean pH by as much as 0.3 unit. At the same time, the ocean is expected to warm with an associated expansion of the oxygen minimum layer (OML). Thus, there is a growing demand to understand the response of the marine biota to these global changes. We show that ocean acidification will substantially depress metabolic rates (31%) and activity levels (45%) in the jumbo squid, Dosidicus gigas, a top predator in the Eastern Pacific. This effect is exacerbated by high temperature. Reduced aerobic and locomotory scope in warm, high-CO2 surface waters will presumably impair predator–prey interactions with cascading consequences for growth, reproduction, and survival. Moreover, as the OML shoals, squids will have to retreat to these shallower, less hospitable, waters at night to feed and repay any oxygen debt that accumulates during their diel vertical migration into the OML. Thus, we demonstrate that, in the absence of adaptation or horizontal migration, the synergism between ocean acidification, global warming, and expanding hypoxia will compress the habitable depth range of the species. These interactions may ultimately define the long-term fate of this commercially and ecologically important predator.",
    "keywords": "biological-response, field, mollusks, multiple-factors, north-pacific, ocean-acidification, oxygen, performance, physiology, temperature",
    "name": "Synergistic effects of climate-related variables suggest future physiological impairment in a top oceanic predator",
    "url": "https://pacificdata.org/data/dataset/rosa2008synergistic-effects-of-climate-related-variables-suggest-future-physiological-impairmen"
}