{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/smith2010growing-up-in-the-temperate-zone-age-growth-calcification-and-carbonate-mineralogy-of-",
    "@type": "Dataset",
    "description": "The cheilostome bryozoan Melicerita chathamensis from the continental shelf around southern New Zealand is unusual in having macroscopic annual growth checks. It thus presents an opportunity to examine annual variations in age, growth, calcification and carbonate mineralogy in a temperate bryozoan. Forty-one colonies dredged south of Snares Islands, New Zealand (47° 49.537′S, 166° 45.910′E, 166 m water depth, 2 February 2008) ranged from 2 to 9 years old and were up to 40 mm long. Segment length varied from 0.94 to 13.67 mm, with a mean growth rate of 5.27 mm y-1, whereas segment weight varied from 0.1 to 37 mg, with an average calcification rate of 9.2 mg y-1. Low-Mg calcite ranged from 0.8 to 3.6 wt% MgCO3, with a mean of 2.1 wt% MgCO3, whereas high-Mg calcite ranged from 6.6 wt% MgCO3 to 9.7 wt% MgCO3 with a mean of 8.1 wt% MgCO3. The well-studied polar M. obliqua, in contrast, grows more slowly over a much longer period and calcifies more rapidly, suggesting that polar bryozoans may be more effective at sequestering carbon than their temperate counterparts. The proportion of each mineral in skeletal segments generally varied with age, from almost entirely high-Mg calcite in the oldest segments to entirely low-Mg calcite at the growing tips, with a mean of 60.7% high Mg calcite. This unusual dual-calcite mineralogy appears to be analogous to some other cheilostomes which also produce a primary skeleton of low-Mg calcite but their secondary mineral is aragonite. Such bimineralic bryozoans, which are sophisticated mineralisers that exert a great deal of control over their skeletal composition, may be able to mineralise despite decreasing sea-water pH. Bimineral skeletal sediments, however, could be especially vulnerable to dissolution, as both aragonite and high-Mg calcite are more soluble than low-Mg calcite. Weakening of the skeleton by dissolution of secondary thickening could increase the likely effects of temperate abrasion and bioerosion.",
    "keywords": "biological-response, bryozoa, calcification, field, growth, ocean-acidification, south-pacific",
    "name": "Growing up in the temperate zone: age, growth, calcification and carbonate mineralogy of Melicerita chathamensis (Bryozoa) in southern New Zealand",
    "url": "https://pacificdata.org/data/dataset/smith2010growing-up-in-the-temperate-zone-age-growth-calcification-and-carbonate-mineralogy-of-"
}