{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/duarte2015intraspecific-variability-in-the-response-of-the-edible-mussel-mytilus-chilensis-hupe",
    "@type": "Dataset",
    "description": "Ocean acidification (OA) has been shown to affect significantly the net calcification process and growth rate of many marine calcifying organisms. Recent studies have shown that the responses of these organisms to OA can vary significantly among species. However, much less is known concerning the intraspecific variability in response to OA. In this study, we compared simultaneously the responses of two populations of the edible mussel Mytilus chilensis (Hupe) exposed to OA. Three nominal CO2 concentrations (380, 700, and 1,000 $μ$atm of CO2) were used. Negative effects of CO2 increase on net calcification rate were only found in individuals from Huelmo Bay. However, no effects were found in individuals from Yaldad Bay. Moreover, OA had not significant effects on the shell dissolution rate in individuals from both localities. This suggests that the negative effect of the OA on the net calcification rate of this species is explained by shell deposition, but not by the shell dissolution processes. We do not know the specific underlying mechanisms responsible for these differences, but some possibilities are discussed. These results highlight that the responses of marine organism to OA can be highly variable even within the same species. Therefore, more studies across the distribution range of the species, considering environmental variability, are needed for a better understanding of the consequences of OA on marine organisms. Finally, because mussels exert influence on their physical and biological surroundings, the negative effects of a CO2 increase could have significant ecological consequences.",
    "keywords": "biological-response, calcification, dissolution, laboratory, mollusks, oaiccnoanswer, ocean-acidification, south-pacific",
    "name": "Intraspecific variability in the response of the edible mussel Mytilus chilensis (hupe) to ocean acidification",
    "url": "https://pacificdata.org/data/dataset/duarte2015intraspecific-variability-in-the-response-of-the-edible-mussel-mytilus-chilensis-hupe"
}