{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/davis2017crelationships-between-temperature-ph-and-crusting-on-mg-ca-ratios-in-laboratory-grown",
    "@type": "Dataset",
    "description": "Mg/Ca ratio paleothermometry in foraminifera is an important tool for the reconstruction and interpretation of past environments. However, existing Mg/Ca:temperature relationships for planktic species inhabiting mid- and high- latitude environments are limited by a lack of information about the development and impact of low-Mg/Ca ratio “crusts” and the influence of the carbonate system on Mg/Ca ratios in these groups. To address this, we cultured individual specimens of Neogloboquadrina incompta and Neogloboquadrina pachyderma in seawater across a range of temperature (6 °- 12 °C) and pH (7.4 – 8.2). We found by laser ablation inductively couple mass spectrometry analyses of shells that culture-grown crust calcite in N. incompta had a lower Mg/Ca ratio than ontogenetic calcite formed at the same temperature, suggesting that temperature is not responsible for the low Mg/Ca ratio of neogloboquadrinid crusts. The Mg/Ca:temperature relationship for ontogenetic calcite in N. incompta was consistent with the previously published culture-based relationship and no significant relationship was found between Mg/Ca ratios and pH in this species. However, the Mg/Ca ratio in laboratory cultured N. pachyderma was much higher than that reported in previous core-top and sediment trap samples, due to lack of crust formation in culture. Application of our ontogenetic calcite-specific Mg/Ca:temperature relationships to fossil N. pachyderma and N. incompta from five intervals in cores from the Santa Barbara Basin and the Bering Sea show that excluding crust calcite in fossil specimens may improve Mg/Ca-based temperature estimates.",
    "keywords": "101594pangaea892335, biological-response, laboratory, morphology, multiple-factors, north-pacific, oaiccdb, ocean-acidification, protists, temperature",
    "name": "Relationships between temperature, pH, and crusting on Mg/Ca ratios in laboratory-grown Neogloboquadrina foraminifera",
    "url": "https://pacificdata.org/data/dataset/davis2017crelationships-between-temperature-ph-and-crusting-on-mg-ca-ratios-in-laboratory-grown"
}