{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pacific-regional-education-framework-pacref-2018-2030-moving-towards-education-2030",
    "@type": "Dataset",
    "description": "Forum Leaders’ Pacific Vision promotes peace, harmony, security, social inclusion, and prosperity where all Pacific people can lead-free and healthy lives. The Framework for Pacific Regionalism represents the Forum Leaders ongoing political commitment to work together as one region in order to achieve this vision. In 2017, Forum Leaders endorsed The Blue Pacific Narrative as the core driver of collective action for advancing the Leaders’ Pacific Vision. This narrative reaffirms our shared ownership of the Pacific Ocean and the connection of all Pacific peoples with their natural resources, environment, and livelihoods, and aims to harness their shared ocean identity, geography and resources to drive positive socio-cultural, political and economic development. The adoption of the Pacific Regional Education Framework (PacREF) 2018 – 2030 by Forum Education Ministers in 2018, outlined a transformative and sustainable regional education agenda aligned with global agendas such as the Sustainable Development Goals (SDGs) particularly SDG4, the education goal and Education 2030: Incheon Declaration on Education for All Framework for Action. The PacREF’s four key policy areas of Quality and Relevance, Learning Pathways, Students Outcomes and Wellbeing and Teacher Professionalism will support the Forum Leaders’ Pacific Vision over the next twelve years. ",
    "keywords": "Pacific, Sustainable Development, education, human rights, regionalism, students",
    "name": "Pacific Regional Education Framework (PacREF) 2018 - 2030: Moving Towards Education 2030",
    "url": "https://pacificdata.org/data/dataset/pacific-regional-education-framework-pacref-2018-2030-moving-towards-education-2030"
}