{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-gender-challenges-to-financial-inclusion-in-papua-new-guinea",
    "@type": "Dataset",
    "description": "This paper draws on research undertaken in 2015 among coffee smallholders in Eastern Highlands Province of Papua New Guinea, focusing specifically on some of the challenges faced by women coffee farmers in accessing financial services. \n\nThe research was a collaboration between the Department of Pacific Affairs (formerly the State, Society and Governance in Melanesia Program) at the Australian National University and the Coffee Industry Support Project of CARE International in Papua New Guinea. \n\nThe research focused on the issue of women’s economic empowerment among coffee smallholders and the survey instruments were designed to capture data that could illuminate several key indicators of women’s economic empowerment and their more general empowerment.  Although the research did not focus specifically on financial inclusion, some of the data provides an understanding of the impediments to accessing financial services facing highlands communities, particularly women. \n\nConsidering the importance given to financial inclusion in women’s economic empowerment programming by donors and other development practitioners, this research highlights that attention is needed to increase women’s literacy and numeracy. However, other factors play an important part, such as local gender norms which constrain women’s decision-making and movements.",
    "keywords": "development-programming, economic-empowerment, ending-violence-against-women, land-sea-and-livelihoods, pacific-women, short-paper, social-norms",
    "name": "Gender Challenges to Financial Inclusion in Papua New Guinea",
    "url": "https://pacificdata.org/data/dataset/pwl-gender-challenges-to-financial-inclusion-in-papua-new-guinea"
}