{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/zou2005ceffects-of-elevated-atmospheric-co2-on-growth-photosynthesis-and-nitrogen-metabolism-in",
    "@type": "Dataset",
    "description": "Hizikia fusiforme (Harv.) Okamura (brown seaweed) was cultured using aeration with two CO2 conditions: outdoor air (actual atmospheric CO2 concentration, averaging 360 $μ$l l-1) and CO2-enriched air (averaging 700 $μ$l l-1), to investigate the possible adjustments of elevated atmospheric CO2 to the growth, photosynthesis and nitrogen metabolism in this mariculture species. Aeration with CO2-enriched air reduced the pH in the culture medium in comparison with aeration with air. The mean relative growth rate was enhanced when H. fusiforme was grown at high CO2 with respect to normal CO2. There was little change in the rate of light-saturated photosynthesis, dark respiratory rate and apparent photosynthetic efficiency, measured in natural seawater, between thalli grown in high and normal CO2  contents. However, both the mean nitrate uptake rate and the activity of nitrate reductase at light period were increased following culture at high CO2, indicating an enhanced nitrogen assimilation of H. fusiforme thalli with the CO2  enrichment in culture. It was proposed that the intensive cultivation of H. fusiforme would remove nutrients more efficiently with the future elevation of CO2 levels in seawater, which could be a possible solution to the problem of ongoing coastal eutrophication.",
    "keywords": "algae, biological-response, growth, laboratory, north-pacific, ocean-acidification, otherprocess, physiology, primary-production, respiration",
    "name": "Effects of elevated atmospheric CO2 on growth, photosynthesis and nitrogen metabolism in the economic brown seaweed, Hizikia fusiforme (Sargassaceae, Phaeophyta)",
    "url": "https://pacificdata.org/data/dataset/zou2005ceffects-of-elevated-atmospheric-co2-on-growth-photosynthesis-and-nitrogen-metabolism-in"
}