{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/castillo2017ocean-acidification-and-pathogen-exposure-modulate-the-immune-response-of-the-edibl",
    "@type": "Dataset",
    "description": "Ocean acidification (OA) is one of the main consequences of increasing atmospheric carbon dioxide (CO2), impacting key biological processes of marine organisms such as development, growth and immune response. However, there are scarce studies on the influence of OA on marine invertebrates' ability to cope with pathogens. This study evaluated the single and combined effects of OA and bacterial infection on the transcription expression of genes related to antioxidant system, antimicrobial peptides and pattern recognition receptors in the edible mussel Mytilus chilensis. Individuals of M. chilensis were exposed during 60 days at two concentrations of pCO2 (550 and 1200 $μ$atm) representing respectively current and future scenario of OA and were then injected with the pathogenic bacterium Vibrio anguillarum. Results evidenced an immunomodulation following the OA exposure with an up-regulation of C-type Lectin and Mytilin B and a down-regulation of Myticin A and PGRP. This immunomodulation pattern is partially counteracted after challenge with V. anguillarum with a down-regulation of the C-type lectin and Mytilin B and the up-regulation of Myticin A. In turn, these results evidence that pCO2-driven OA scenarios might triggers specific immune-related genes at early stages of infection, promoting the transcription of antimicrobial peptides and patterns recognition receptors. This study provides new evidence of how the immune response of bivalves is modulated by higher CO2 conditions in the ocean, as well one factor for the resilience of marine population upon global change scenarios.",
    "keywords": "biological-response, laboratory, molecular-biology, mollusks, multiple-factors, ocean-acidification, pathogens, physiology, south-pacific",
    "name": "Ocean acidification and pathogen exposure modulate the immune response of the edible mussel Mytilus chilensis",
    "url": "https://pacificdata.org/data/dataset/castillo2017ocean-acidification-and-pathogen-exposure-modulate-the-immune-response-of-the-edibl"
}