{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/republic-of-the-marshall-islands-maritime-boundary-treaties",
    "@type": "Dataset",
    "description": "The Republic of the Marshall Islands shares four Maritime Boundary Treaties with its neighboring States. The following describes each treaty and its progress. \r\n\r\n                                               Gazetted and deposited to UN DOALOS\r\n                                 Treaty between the Republic of Marshall Islands and Federated States of Micronesia\r\n\r\nTreaty between the Federated States of Micronesia and the Republic of the Marshall Islands concerning Maritime Boundaries and Cooperation on Related Matters, 5 July 2006(entry into force: 24 July 2015; registration #: 54649; registration date: 4 August 2017\r\n\r\nhttps://www.un.org/depts/los/LEGISLATIONANDTREATIES/PDFFILES/FSM-RMI.pdf\r\n                                                          \r\n                                             Signed but Not Entered into Force\r\n                                   Treaty between the Republic of Marshall Islands and Kiribati\r\n\r\nKiribati’s maritime boundary agreement with the Marshall Islands, concluded in 2012, establishes an EEZ and continental shelf boundary on the basis of equidistance that is composed of geodesic lines connecting 24 points.17 The boundary separates the maritime zones generated by Banaba, Makin, and Butaritari in Kiribati’s Gilbert Group and Ebon and Knox (Nadikdik) of the Marshall Islands.\r\n\r\nhttps://www.state.gov/wp-content/uploads/2020/03/LIS-146-Kiribati.pdf\r\n\r\n                                Treaty between the Republic of Marshall Islands and Nauru\r\nKiribati, the Marshall Islands and Nauru agreed to a tri-lateral treaty concerning the determination of a point where the Exclusive Economic Zones (EEZs) of the three countries intersect. Signing of this treaty took place in Rarotonga on the 29th of August 2012.\r\n\r\n                 Provisional treaty between Marshall Islands and United States of America (Wake Island)\r\n\r\nThe treaty between Marshall Islands and USA (Wake Island) is still not settled. This layer is extracted from the Global Marine Regions Database (marineregions.org)\r\n\r\n\r\n                            ",
    "keywords": "12M, 12NM, FFA, TSZ, Territorial, TerritorialSeaZone",
    "name": "Republic of the Marshall Islands Maritime Boundary Treaties",
    "url": "https://pacificdata.org/data/dataset/republic-of-the-marshall-islands-maritime-boundary-treaties"
}