{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-the-big-nine-your-one-stop-shop-for-human-rights-conventions-is-online",
    "@type": "Dataset",
    "description": "This publication is a ‘one-stop-shop’ for international human rights conventions and other related documents. It is designed to be a reference for judges, magistrates, legal practitioners, law students human rights advocates, civil society representatives and policy makers across the Pacific.  \n\nIt contains the text of the Universal Declaration of Human Rights (UDHR) and its two international covenants: the International Covenant on Civil and Political Rights (ICCPR) and the International Covenant on Economic, Social and Cultural Rights (ICESCR). Collectively, these three international human rights documents have been commonly referred to as the International Bill of Rights (IBOR). It also contains seven other United Nations international human rights treaties. These treaties have the force of international law for the states that ratify or accede to them. Each of these treaties establishes a treaty body responsible for monitoring implementation by state parties. Some of the treaties are supplemented by optional protocols that deal with specific concerns or individual complaint mechanisms an the optional protocols are included in this compilation. Every Pacific Island country is a party to at least one of these treaties, thereby agreeing to the universally accepted principles of human rights that apply to every woman, man and child. These treaties are at the core of the international system for the promotion and protection of human rights. Significantly, these international human rights standards have had an impact at the regional and national level, forming the basis of bills of rights in the constitutions of many Pacific Island countries. They have also inspired instances of legislative reform, as well as national policy, and have been used as reference points for the formulation of guiding principles at the judicial level. The publication also contains titles and web links to other human rights documents. This part of the publication seeks to facilitate access for readers to other international human rights instruments, documents and declarations that have regional significance. Some of these documents may shed light on the future development of human rights and may assist stakeholders to analyse rights protected under the nine conventions in this compilation.",
    "keywords": "Education, Health, Report, enhancing-agency, human-rights, leadershpi-and-politics, pacific-women, social-norms, violence",
    "name": "The Big Nine, your one-stop-shop for human rights conventions is online",
    "url": "https://pacificdata.org/data/dataset/pwl-the-big-nine-your-one-stop-shop-for-human-rights-conventions-is-online"
}