{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-community-healing-and-rebuilding-program-oxfam-s-strategy-for-prevention-of-family-and-community",
    "@type": "Dataset",
    "description": "The Community Healing and Rebuilding Program addresses the risk factors of violence and strengthens the protective factors against it. The program draws on group therapy, community healing, and community development approaches. The program will be delivered within four Peer Support Circles in each community: \n1) Women’s Peer Support Circle. \n2) Young Women’s Peer Support Circle.\n3) Men’s Peer Support Circle.\n4) Young Men’s Peer Support Circle. \n\nPeer Support Circles create a safe space for members to heal from their pasts, learn and practice new skills, and create new pathways for their futures. Members are segregated by age and gender to increase the likelihood of feeling comfortable, enabling them to share and reflect on life experiences together. \n\nThe program is delivered in three phases: Me; My relationships; and My community. Each phase takes roughly one year to complete. The community healing program will be implemented through local partner organisations in Simbu Province, Eastern Highlands Province, East Sepik Province and will also be extended to Central Province.  \n\nAfter the initial community engagement and mobilisation, the program will commence with a baseline survey to establish the social norms in relation to gender-based violence and sorcery accusation-related violence will be undertaken.  An evaluation will be conducted after the first year to identify the strengths and weaknesses of the approach, and to adapt the program for the remaining two years. \n\nThe paper titled, ‘Evidence-informed innovation for the prevention of family and community violence in Papua New Guinea’ has been written as a companion document to Oxfam Papua New Guinea’s Violence Prevention Strategy. By bringing together theoretical and practice-based expertise from a range of disciplines, this paper seeks to build a foundation for an evidence-based, multidisciplinary approach to the prevention of violence in Papua New Guinea.",
    "keywords": "data, development-programming, ending-violence-against-women, pacific-women, social-norms, violence",
    "name": "Community Healing and Rebuilding Program, Oxfam’s Strategy for Prevention of Family and Community Violence in Papua New Guinea",
    "url": "https://pacificdata.org/data/dataset/pwl-community-healing-and-rebuilding-program-oxfam-s-strategy-for-prevention-of-family-and-community"
}