{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-changing-market-culture-in-the-pacific",
    "@type": "Dataset",
    "description": "Addressing the multiple dimensions of gender inequality requires commitments by policy-makers, practitioners and scholars to transformative practices. One challenge is to assemble a coherent conceptual framework from diverse knowledges and experiences. This article contains a framework that emerged from the authors’ involvement in changing market culture in the Pacific, which they name the ‘radical empowerment of women approach’. The article draws on detailed narratives from women market vendors and women-led new initiatives in marketplaces to explain the radical empowerment of women approach. \n\nThe primary focus of recently developed projects for marketplaces in the Pacific is technical and infrastructural, which is insufficient for addressing gendered political and economic causes of poor market management and oppressive conditions for women vendors. The article explores the complex array of motives and effects of the desire to transform or improve marketplaces in the Pacific; and cautions against simplistic technical or infrastructural solutions. \n\nThis paper also introduces the practice of working as a cooperative, hybrid research collaboration. The knowledges and analyses that each author brings to this issue demonstrate that substantive analysis generated from diverse and shifting ‘locations’ and roles, but underpinned by a shared vision of, and commitment to, gender justice, can provide distinctive policy and research insights.",
    "keywords": "development-programming, economic-empowerment, journal-article, land-sea-and-livelihoods, pacific-women, social-norms",
    "name": "Changing Market Culture in the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-changing-market-culture-in-the-pacific"
}