{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/doropoulos2013high-co2-reduces-the-settlement-of-a-spawning-coral-on-three-common-species-of-cr",
    "@type": "Dataset",
    "description": "Concern about the impacts of ocean acidification (OA) on ecosystem function has prompted many studies to focus on larval recruitment, demonstrating declines in settlement and early growth at elevated CO2 concentrations. Since larval settlement is often driven by particular cues governed by crustose coralline algae (CCA), it is important to determine whether OA reduces larval recruitment with specific CCA and the generality of any effects. We tested the effect of elevated CO2 on the survival and settlement of larvae from the common spawning coral Acropora selago with 3 ecologically important species of CCA, Porolithon onkodes, Sporolithon sp., and Titanoderma sp. After 3 d in no-choice laboratory assays at 447, 705, and 1214 µatm pCO2, the rates of coral settlement declined as pCO2 increased with all CCA taxa. The magnitude of the effect was highest with Titanoderma sp., decreasing by 87% from the ambient to highest CO2 treatment. In general, there were high rates of larval mortality, which were greater with the P. onkodes and Sporolithon sp. treatments (̃80%) compared to the Titanoderma sp. treatment (65%). There was an increase in larval mortality as pCO2 increased, but this was variable among the CCA species. It appears that OA reduces coral settlement by rapidly altering the chemical cues associated with the CCA thalli and microbial community, and potentially by directly affecting larval viability.  ",
    "keywords": "101594pangaea823746, algae, biological-response, corals, laboratory, mortality, oaiccdb, ocean-acidification, reproduction, south-pacific",
    "name": "High CO2 reduces the settlement of a spawning coral on three common species of crustose coralline algae",
    "url": "https://pacificdata.org/data/dataset/doropoulos2013high-co2-reduces-the-settlement-of-a-spawning-coral-on-three-common-species-of-cr"
}