{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/nguyen2014aearly-benthic-juvenile-parvulastra-exigua-asteroidea-are-tolerant-to-extreme-acidifi",
    "@type": "Dataset",
    "description": "Habitat warming and acidification experienced by intertidal invertebrates are potentially detrimental to sensitive early post-larvae of benthic marine invertebrates. To determine the potential impact of acidification and warming on a conspicuous component of the temperate intertidal fauna of the southern hemisphere, the response of newly metamorphosed juvenile (ca. 450 $μ$m diameter) sea stars (Parvulastra exigua) to increased acidification and temperature was investigated with respect to conditions recorded in the habitat (− 0.4–0.6 pH units, + 2-4 °C), in all combinations of stressors. In situ monitoring was used to generate data on environmental conditions. The pHNIST of the tide pools varied from 7.54 (pCO2 2045 $μ$atm) at predawn to 8.91 (pCO2 28 $μ$atm) in the afternoon and temperature varied from 10 °C at night to 24 °C during the day, conditions that fluctuated from baseline sea surface conditions of pH 8.2 and 16 °C. P. exigua was used as a model tolerant intertidal species to generate insights into stress tolerance of the early benthic life stage. After a 4-week incubation in experimental conditions, negative effects on juvenile development and growth were only observed at pHNIST 7.2 (− 1.0 units/pCO2 4430–4601$μ$atm; $Ømega$cal 0.6, $Ømega$ar 0.4). Our results indicate that juvenile P. exigua is physiologically acclimatised to tolerate extreme conditions indicating that it may be robust to near future (ca. 2100) change in ocean conditions. Although it is difficult to know how tide pools will change in the future, pulses of the deleterious level of acidification (pHNIST 7.2) may occur in the intertidal in future night time low tides.",
    "keywords": "biological-response, chemistry, echinoderms, field, laboratory, morphology, mortality, multiple-factors, oaiccnoanswer, ocean-acidification, south-pacific, temperature",
    "name": "Early benthic juvenile Parvulastra exigua (Asteroidea) are tolerant to extreme acidification and warming in its intertidal habitat",
    "url": "https://pacificdata.org/data/dataset/nguyen2014aearly-benthic-juvenile-parvulastra-exigua-asteroidea-are-tolerant-to-extreme-acidifi"
}