{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/kiribati-deepsea-mineral-resources-survey-atlas-report-1",
    "@type": "Dataset",
    "description": "The Cooperative Study on the Deepsea Mineral Resources in Selected Offshore Areas of the SOPAC Region, 2001 -Sea Area of the Republic of the Kiribati Islands.\nThe survey was carried out  for the sea area of 13,400km2, within the Exclusive economic zone of the Republic of Kiribati.\nThe area was selected in accordance with the joint sturdy program for \ndeepsea mineral resources in the EEZ of the SOPAC member countries agreed upon by the Japanese \nexecuting agency and South Pacific Applied Geoscience Commission (SOPAC) on February 27, 2003\nThe cobalt crust survey in the Republic of Kiribati has therefore covered 16 sea mounts in the area of Phoenix Island, Line Islands and the Gilbert Islands.The survey comprises ship survey (acoustic sounding survey and sampling survey) and the data analysis for assessment of mineral resources and an environmental survey as a baseline study to understand the environmental situation, for future evaluation of potential mining impacts on the deep sea environment of Kiribati.\n     Considering the results of the survey, there is a possibility of thick, high Co cobalt crust being \ndistributed in the SE01 Seamount, but this was confirmed at only one sampling point.  Therefore, the \noccurrence of cobalt crust in the SE01 Seamount seems to be local, not widespread over the whole area.The survey aims at the assessment of potential of cobalt­ rich manganese crust (hereafter referred as \ncobalt crust) by conducting deep seafloor mineral resources survey within the Exclusive Economic Zone \n(EEZ) of the Republic of Kiribati, a member country of SOPAC.SEA AREA SURVEYED: Latitude Longitude  a 5°00′N 172°10′E  b 5°00′N 173°10′E  c 4°00′N 173°10′E  d 4°00′N 172°10′E  a 5°00′N 172°10′E                                         SE01 Seamount, situated 80 miles north of the Makin Atoll located at the northern end of the Gilbert Islands (latitude 4 ̊15′N, longitude 172 ̊54′E)",
    "keywords": "deepsea-mineral-resourcescobalt-rich-manganese-crust, kiribati, maritime-boundary",
    "name": "Kiribati - Deepsea Mineral Resources Survey (Atlas & Report) #1",
    "url": "https://pacificdata.org/data/dataset/kiribati-deepsea-mineral-resources-survey-atlas-report-1"
}