{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/smith2013not-all-sponges-will-thrive-in-a-high-co2-ocean-review-of-the-mineralogy-of-calcifying",
    "@type": "Dataset",
    "description": "Most marine sponges precipitate silicate skeletal elements, and it has been predicted that they would be among the few “winners” among invertebrates in an acidifying, high-CO2 ocean. But members of Class Calcarea and a small proportion of the Demospongiae have calcified skeletal structures, which puts them among those calcifying organisms which are vulnerable to lowered pH and CO3= availability. A review of carbonate mineralogy in marine sponges (75 specimens, 32 species), along with new data from New Zealand (42 specimens in 15 species) allows us to investigate patterns and make predictions. In general sponges show little variability within individuals and within species (+/- 0.5 wt% MgCO3 in calcite). Extant sponges in Class Calcarea generally produce calcitic spicules with relatively high Mg contents, up to 15 wt% MgCO3. Whereas most of the calcifying demosponges are aragonitic, the genus Acanthochaetetes in the Hadromerida produces extremely high-Mg calcite (14 to 18 wt% MgCO3). There is generally a weak phylogenetic consistency among classes, orders and families. Statistical analyses, including those accounting for these phylogenetic effects, fail to find a substantial or significant effect of water temperature on mineralogical variation. In the context of global ocean acidification, sponges which produce high-Mg calcite and/or aragonite will be most vulnerable to dissolution, meaning that not all sponges will be “winners” in a high-CO2 ocean.",
    "keywords": "biological-response, morphology, ocean-acidification, porifera, review, south-pacific",
    "name": "Not all sponges will thrive in a high-CO2 ocean: review of the mineralogy of calcifying sponges",
    "url": "https://pacificdata.org/data/dataset/smith2013not-all-sponges-will-thrive-in-a-high-co2-ocean-review-of-the-mineralogy-of-calcifying"
}