{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/duran2018bioeconomic-analysis-of-the-impact-of-ocean-acidification-associated-with-low-recruitm",
    "@type": "Dataset",
    "description": "The impact that ocean acidification (OA) could generate in the fisheries of Isostichopus badionotus at the north of the Yucatan Peninsulta, Mexico, was analysed by reducing the value of a parameter of the Beverton-Holt recruitment function, in accordance with the acidification scenarios of the Intergovermental Panel Panel on Climate Change (IPCC). The behaviour of the stock and the resulting fishery were analysed in a bioeconomic model structured by age, taking into account different market prices and fishing efforts. The results were compared in decision matrices that used the MiniMax and MaxMin criteria to determine the management strategy that best reduced the impact of  acidification. The largest stock reduction occurred during the first years of exploitation (B10\\textgreaterB15/BO) and all the variables that were considered did stabilize with time, reaching bioeconomic equilibrium. The worst scenario for not considering acidification occurred with low market prices, while the increase in price decreased the exploitation rate. The recruitment reduction determined the maximum effort that should have been applied; under such conditions it is recommended to operate an effort of 137 boats, considering the best market price.",
    "keywords": "echinoderms, fisheries, individualmodeling, modeling, north-pacific, ocean-acidification, regionalmodeling, socio-economy",
    "name": "Bioeconomic analysis of the impact of ocean acidification associated with low recruitment of Isostichopus badionotus and implications for adaptive fishery management in the north of the Yucatan Peninsula, Mexico",
    "url": "https://pacificdata.org/data/dataset/duran2018bioeconomic-analysis-of-the-impact-of-ocean-acidification-associated-with-low-recruitm"
}