{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-inclusive-governance-practice-in-care-international-s-papua-new-guinea-programming",
    "@type": "Dataset",
    "description": "This paper examines the experience and lessons of three projects implemented by CARE International in Papua New Guinea to inform best practice in inclusive governance programming in the future. CARE’s governance work enables citizens (the “grassroots”) and government (representative as well as the civil service) to come together, disrupting negative or destructive cycles of distrust, inaction and disempowerment. CARE’s work has built capacity (skills, knowledge and processes) and worked with the incentives, motivations or drivers for people (grassroots and government, women and men) to start coming together in non-adversarial ways, rebuilding (or indeed building) the social compact for the benefit of future development. CARE governance projects have collaboratively developed appropriate processes, tools and materials for training, reflection and implementation for more inclusive governance; materials that can be used by government (and that are sought by government) to help government systems of governance and collective community action to go forward even in the absence of intensive NGO led facilitation. The projects have sought ‘good enough governance’ rather than perfect governance. CARE’s governance projects have sought to help people make the changes that are possible because of the help of CARE as an external, neutral and trusted organisation, and that can begin to enable more transparent, accountable and constructive cycles of governance. \n\nThere remain significant challenges in governance programming. There are governance factors at play that are beyond the scope of a single NGO to influence – for example, to track and improve the reliability of both development and function grants even reaching Districts and lower levels of government; and a continually and unpredictably changing legislative and policy environment. There is international recognition that inclusive governance work (or indeed development work in general) in highly complex settings such as Papua New Guiena is necessarily incremental and requires flexibility and long-term commitment, and yet donor requirements rarely enable the level of flexibility in programming, nor funding timeframes necessary for the greatest gains to be made.",
    "keywords": "Report, autonomous-region-of-bougainville, development-programming, leadership-and-decision-making, leadership-and-politics, pacific-women, social-norms",
    "name": "Inclusive governance practice in CARE International’s Papua New Guinea programming",
    "url": "https://pacificdata.org/data/dataset/pwl-inclusive-governance-practice-in-care-international-s-papua-new-guinea-programming"
}