{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/kiribati-nikunau-atoll1969-historical-aerial-photographs-2",
    "@type": "Dataset",
    "description": "A collection of the 1969 Historical Aerial Photographs of Kiribati, Nikunau Island. All 39 Photographs have not been rectified but uploaded individually and referenced according to their frame numbers. Images have also been mosaicked using the Hypercube software for preview purpose only.\nAreas covered in the images include the land area, lagoons within the island, coastal zone, and areas surrounding the fringing reef .  Extent of coverage of individual images, are illustrated in the accompanying PDF documents and a summary attribute information of each photograph including identity and general information about the flight and the photography is also available for download, upon request to the secretariat. These photoset are held at the SOPAC Secretariat on behalf of the Kiribati Islands Government. The images can be downloaded from the appropriate link under Distribution Info with appropriate permission from the Secretariat.The SOPAC Secretariats aerial photographs is a unique detailed record of the physical landscapes from the different member Pacific Island countries. These photographs can be used for diverse purposes by government agencies, surveyors, planners, consulting scientists, engineers and other individuals. These purposes include determination of past land uses, marine mapping, coral reef habitat mapping ( change detection), restoration of natural areas, assessing historical changes , and a variety of other applications.",
    "keywords": "aerial-photos, base-map, change-detection, gis, kiribati, mapping, nikunau",
    "name": "Kiribati, Nikunau Atoll,1969, Historical Aerial photographs #2",
    "url": "https://pacificdata.org/data/dataset/kiribati-nikunau-atoll1969-historical-aerial-photographs-2"
}