{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/crim2011aelevated-seawater-co2-concentrations-impair-larval-development-and-reduce-larval-survi",
    "@type": "Dataset",
    "description": "Increasing levels of anthropogenic carbon dioxide in the world's oceans are resulting in a decrease in the availability of carbonate ions and a drop in seawater pH. This process, known as ocean acidification, is a potential threat to marine populations via alterations in survival and development. To date, however, little research has examined the effects of ocean acidification on rare or endangered species. To begin to assess the impacts of acidification on endangered northern abalone (Haliotis kamtschatkana) populations, we exposed H. kamtschatkana larvae to various levels of CO2 [400 ppm (ambient), 800 ppm, and 1800 ppm CO2] and measured survival, settlement, shell size, and shell development. Larval survival decreased by ca. 40% in elevated CO2 treatments relative to the 400 ppm control. However, CO2 had no effect on the proportion of surviving larvae that metamorphosed at the end of the experiment. Larval shell abnormalities became apparent in approximately 40% of larvae reared at 800 ppm CO2, and almost all larvae reared at 1800 ppm CO2 either developed an abnormal shell or lacked a shell completely. Of the larvae that did not show shell abnormalities, shell size was reduced by 5% at 800 ppm compared to the control. Overall, larval development of H. kamtschatkana was found to be sensitive to ocean acidification. Near future levels of CO2 will likely pose a significant additional threat to this species, which is already endangered with extinction due in part to limited reproductive output and larval recruitment.  ",
    "keywords": "101594pangaea771909, biological-response, laboratory, mollusks, morphology, mortality, north-pacific, oaiccdb, ocean-acidification, reproduction",
    "name": "Elevated seawater CO2 concentrations impair larval development and reduce larval survival in endangered northern abalone (Haliotis kamtschatkana)",
    "url": "https://pacificdata.org/data/dataset/crim2011aelevated-seawater-co2-concentrations-impair-larval-development-and-reduce-larval-survi"
}