{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-final-report-highlands-sexual-reproductive-and-maternal-health-project",
    "@type": "Dataset",
    "description": "In rural Papua New Guinea, where over 80 per cent of the population live, nearly 50 per cent of women birth outside of a health centre. One out of 25 women dies of pregnancy related causes and 52 babies out of every 1000 born die before their first birthday.  For every woman who dies in childbirth or pregnancy, another 30 will suffer lifelong pain or disability from pregnancy-related complications. These alarmingly high death rates are partly the result of health centres being many hours walk away from remote communities and lacking in basic drugs, supplies and suitably trained staff. They are also the result of ingrained cultural norms that restrict women’s autonomy, which can lead to delays, or even prevent, women seeking health care. \n\nThe Highlands Sexual, Reproductive and Maternal Health project aimed to meaningfully and sustainably improve the health and wellbeing of women, their families and communities in targeted rural areas of Morobe Province of Papua New Guinea. The project used a Community Workshop Series approach and built on the successes and learnings of the previous Maternal and Infant Health project implemented in the Highlands.  The rights-based approach supported the National Department of Health sector gender policy to enhance women’s decision-making in relation to health seeking practices; educating women and men about their right to health and supporting their family and spouses to seek care; and improving gender integration into health services so that women, men, boys and girls can access gender-sensitive care.  \n\nCARE delivered this project with key partners including the Morobe Provincial Department of Health, Church healthcare providers, and local non-government organisation Barola Haus Mama.",
    "keywords": "Health, Report, development-programming, enhancing-agency, leadership-and-decision-making, pacific-women, social-norms, violence",
    "name": "Final report: Highlands Sexual, Reproductive and Maternal Health project",
    "url": "https://pacificdata.org/data/dataset/pwl-final-report-highlands-sexual-reproductive-and-maternal-health-project"
}