{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/lowder2017aassessment-of-ocean-acidification-and-warming-on-the-growth-calcification-and-biopho",
    "@type": "Dataset",
    "description": "Cryptic colouration in crustaceans, important for both camouflage and visual communication, is achieved through physiological and morphological mechanisms that are sensitive to changes in environmental conditions. Consequently, ocean warming and ocean acidification can affect crustaceans' biophotonic appearance and exoskeleton composition in ways that might disrupt colouration and transparency. In the present study, we measured growth, mineralization, transparency, and spectral reflectance (colouration) of the caridean grass shrimp Hippolyte californiensis in response to pH and temperature stressors. Shrimp were exposed to ambient pH and temperature (pH 8.0, 17 °C), decreased pH (pH 7.5, 17 °C), and decreased pH/increased temperature (pH 7.5, 19 °C) conditions for 7 weeks. There were no differences in either Mg or Ca content in the exoskeleton across treatments nor in the transparency and spectral reflectance. There was a small but significant increase in percent growth in the carapace length of shrimp exposed to decreased pH/increased temperature. Overall, these findings suggest that growth, calcification, and colour of H. californiensis are unaffected by decreases of 0.5 pH units. This tolerance might stem from adaptation to the highly variable pH environment that these grass shrimp inhabit, highlighting the multifarious responses to ocean acidification, within the Crustacea.",
    "keywords": "biological-response, calcification, crustaceans, laboratory, morphology, mortality, multiple-factors, north-pacific, oaiccnoanswer, ocean-acidification, temperature",
    "name": "Assessment of ocean acidification and warming on the growth, calcification, and biophotonics of a California grass shrimp",
    "url": "https://pacificdata.org/data/dataset/lowder2017aassessment-of-ocean-acidification-and-warming-on-the-growth-calcification-and-biopho"
}