{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/phillips2016aexploring-the-sharkcano-biogeochemical-observations-of-the-kavachi-submarine-volca",
    "@type": "Dataset",
    "description": "An expedition to the Kavachi submarine volcano (Solomon Islands) in January 2015 was serendipitously timed with a rare lull in volcanic activity that permitted access to the inside of Kavachi's active crater and its flanks. The isolated location of Kavachi and its explosive behavior normally restrict scientific access to the volcano's summit, limiting previous observational efforts to surface imagery and peripheral water-column data. This article presents medium-resolution bathymetry of the main peak along with benthic imagery, biological observations of multiple trophic levels living inside the active crater, petrological and geochemical analysis of samples from the crater rim, measurements of water temperature and gas flux over the summit, and descriptions of the hydrothermal plume structure. A second peak was identified to the southwest of the main summit and displayed evidence of diffuse-flow venting. Microbial samples collected from the summit indicate chemosynthetic populations dominated by sulfur-reducing $ε$-proteobacteria. Populations of gelatinous animals, small fish, and sharks were observed inside the active crater, raising new questions about the ecology of active submarine volcanoes and the extreme environments in which large marine animals can exist.  ",
    "keywords": "biological-response, brcommunity, chemistry, community-composition, field, molecular-biology, oaiccincomplete, ocean-acidification, otherprocess, prokaryotes, sediment, south-pacific, vents",
    "name": "Exploring the “Sharkcano”: biogeochemical observations of the Kavachi submarine volcano (Solomon Islands)",
    "url": "https://pacificdata.org/data/dataset/phillips2016aexploring-the-sharkcano-biogeochemical-observations-of-the-kavachi-submarine-volca"
}