{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-mapping-of-existing-legislation-programs-and-other-mechanisms-to-support-women-s-leadership-in-t",
    "@type": "Dataset",
    "description": "This mapping paper examines the environment for women’s leadership in the Pacific.  It looks at the key international and regional gender equality instruments, domestic laws, regulations and policies and development programming.  These cover: \n\n- Women’s leadership in politics and government.\n\n- Women in the civil service and on boards. \n\n- Women’s leadership for economic empowerment. \n\n- Women’s leadership to improve women’s and children’s safety. \n\n- Leadership and young women. \n\nLessons learned are: \n\n- Women in leadership is typically seen through a rather narrow lens of national political leadership. There are many layers of political leadership and women have tended to excel at the community and sub-national levels where there is relatively little support for them. \n\n- Getting women in parliament is not an end in itself. Women need ongoing support in such positions. \n\n- Little attention has been paid to encouraging and nurturing women in middle-level and senior management in the public services of Pacific Island countries. \n\n- There is a need for structured mentoring programs in the private sector to support women. \n\n- Women need to work in partnership with men to gain their support and to have them as champions. \n\n- While many initiatives rely on development partner support, some are locally initiated and are self-sustaining, some with private sector support. \n\n- There are many activities in the leadership arena. This points to a need for coordination at national and regional levels in order to avoid duplication in order to make the best use of limited resources and also to fill any gaps. \n\n- Young women have specific areas of interest and they should be encouraged and supported. \n\n- Work to reduce legislative and policy barriers to gender equality needs to be ongoing in order to set an enabling platform for women in decision-making and leadership roles.",
    "keywords": "data, development-programming, leadership-and-decision-making, leadership-and-politics, literature-review, pacific-women, social-norms",
    "name": "Mapping of existing legislation, programs and other mechanisms to support Women’s Leadership in the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-mapping-of-existing-legislation-programs-and-other-mechanisms-to-support-women-s-leadership-in-t"
}