{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/dolivo2015acoral-records-of-reef-water-ph-across-the-central-great-barrier-reef-australia-asses",
    "@type": "Dataset",
    "description": "The boron isotopic ($δ$11Bcarb) compositions of long-lived Porites coral are used to reconstruct reef-water pH across the central Great Barrier Reef (GBR) and assess the impact of river runoff on inshore reefs. For the period from 1940 to 2009, corals from both inner- and mid-shelf sites exhibit the same overall decrease in $δ$11Bcarb of 0.086 ± 0.033‰ per decade, equivalent to a decline in seawater pH (pHsw) of ̃0.017 ± 0.007 pH units per decade. This decline is consistent with the long-term effects of ocean acidification based on estimates of CO2 uptake by surface waters due to rising atmospheric levels. We also find that, compared to the mid-shelf corals, the $δ$11Bcarb compositions of inner-shelf corals subject to river discharge events have higher and more variable values, and hence higher inferred pHsw values. These higher $δ$11Bcarb values of inner-shelf corals are particularly evident during wet years, despite river waters having lower pH. The main effect of river discharge on reef-water carbonate chemistry thus appears to be from reduced aragonite saturation state and higher nutrients driving increased phytoplankton productivity, resulting in the drawdown of pCO2 and increase in pHsw. Increased primary production therefore has the potential to counter the more transient effects of low-pH river water (pHrw) discharged into near-shore environments. Importantly, however, inshore reefs also show a consistent pattern of sharply declining coral growth that coincides with periods of high river discharge. This occurs despite these reefs having higher pHsw, demonstrating the overriding importance of local reef-water quality and reduced aragonite saturation state on coral reef health. ",
    "keywords": "biogeochemistry, chemistry, field, ocean-acidification, paleo, south-pacific",
    "name": "Coral records of reef-water pH across the central Great Barrier Reef, Australia: assessing the influence of river runoff on inshore reefs",
    "url": "https://pacificdata.org/data/dataset/dolivo2015acoral-records-of-reef-water-ph-across-the-central-great-barrier-reef-australia-asses"
}