{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/hauri2009aocean-acidification-in-the-california-current-system",
    "@type": "Dataset",
    "description": "Eastern boundary upwelling systems (EBUS) are naturally more acidic than most of the rest of the surface ocean. Observations of EBUS already show pH values and saturation states with regard to the carbonate mineral aragonite that are as low as those expected for most open ocean waters several decades from now. Thus, as atmospheric CO2 increases further, EBUS are prone to widespread and persistent undersaturation with regard to aragonite, making them especially sensitive to ocean acidification. Here, we describe ocean carbonate chemistry and its short-term-to-seasonal variability in one major EBUS, the California Current System (CCS), based on observations and results from an eddy-resolving regional model. Results reveal high variability in ocean carbonate chemistry, largely driven by seasonal upwelling of waters with low pH and saturation states, and subsequent interactions of transport and biological production. Model simulations confirm that the pH of CCS waters has decreased by about 0.1 pH unit and by 0.5 in saturation state since pre-industrial times. A first assessment of the vulnerability of CCS marine organisms and ecosystems to ocean acidification suggests that there will be winners and losers, likely provoking changes in species composition. Benthic organisms appear to be among those that will be most affected by the continuing acidification of the CCS. More accurate projections require special consideration of the integrated effects of ocean acidification, ocean warming, decreasing oxygen levels, and other processes that are expected with global change.  ",
    "keywords": "chemistry, epoca-paper, modeling, north-pacific, ocean-acidification, regionalmodeling",
    "name": "Ocean acidification in the California Current System",
    "url": "https://pacificdata.org/data/dataset/hauri2009aocean-acidification-in-the-california-current-system"
}