{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/kiribati-betio-to-bairiki-1981-causeway-site-survey-figure-8-bathymetry-map-3",
    "@type": "Dataset",
    "description": "This record shows the Bathymetry map of the Betio-Bairiki area in 1981 during the Tarawa Nearshore Project. The Project was undertaken to survey the possible areas for the Betio-Bairiki causeway site. There are another 9 accompanying sheets that are linked to this map belonging to the same project.\nA copy of the map can be downloaded by selecting the appropriate link under 'Online resources' with permission from the Secretariat.To provide material for the construction of a road causeway, and possibly an airfield, linking Betio and Bairiki islands. Also, to undertake a geophysical survey to attempt to extrapolate the borehole data over the whole area of interest and to obtain as much additional data as possible on the nature of the sea bed and sub-bottom soils materials and to gather a certain amount of marine baseline environmental data from the site of the proposed causeway and lagoon borrow pit, and from nearby areas. It is intended that this data should in part provide a basis for determining the long term effects of the causeway construction.The work was undertaken as part of the CCOP/SOPAC work programme elements CCSP-1/KI.4 (Surveys for Landfill/Construction Materials) and CCSP-1/KI.5 (Coastal Zone Surveys on Sedimentation, Erosion and Pollution Problems). The Marine Superintendent at Betio has reported possible changes in the shallow areas in the main Betio shipping channel since the major hydrographic survey carried out by H.M. survey ship COOK in 1959. In order to update this survey soundings were made across the width of the main shipping channel from Betio to the western reef entrance.",
    "keywords": "bairiki, bathymetry, betio, causeway, kiribati, nearshore, survey, tarawa",
    "name": "Kiribati, Betio to Bairiki, 1981, Causeway Site Survey, Figure 8, Bathymetry map #3",
    "url": "https://pacificdata.org/data/dataset/kiribati-betio-to-bairiki-1981-causeway-site-survey-figure-8-bathymetry-map-3"
}