{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/cook-islands-territorial-sea-zone",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((191.47640881731311 -25.30537679530272, 191.47640881731311 -5.800505555686755, 205.19444444445585 -5.800505555686755, 205.19444444445585 -25.30537679530272, 191.47640881731311 -25.30537679530272))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "The Maritime Zones Act (MZA) 2018 for Cooks Islands repeals the Territorial Sea and Exclusive Economic Zone Act 1977, (Act No. 16 of 14 November 1977). It states that the territorial sea comprises of those areas of the sea;\r\n(a)\thaving as their inner limits the breadth of the territorial baselines and is measured from the low-water mark along the coast of the Cook Islands or where there is coral reef along any part of the coast of the Cook Islands, the low-water mark along the outer edge of the coral reef. \r\n(b)\tas their outer limits, a line measured seaward form that baseline, every point of which is distant 12 nautical miles from the nearest point of the baseline.\r\n\r\nThe Maritime Zones (Territorial Sea Outer Limits) Regulations 2020, in accordance with MZA 2018, prescribes lines generated by reference to points with geographical coordinates which specifies the outer limits of the territorial sea. In this regulation, points defined by geographic coordinates are determined by reference to the World Geodetic System 1984 (WGS 84). The regulation contains charts as a general illustration of the lines specified within it. \r\nThe sovereignty of the Cook Islands extends to its territorial sea, airspace over it, the seabed and subsoil under them, and the resources contained in them. \r\n\r\nhttps://www.un.org/depts/los/LEGISLATIONANDTREATIES/PDFFILES/Maritime%20Zones%20Act%202018.pdf\r\nhttps://www.un.org/depts/los/LEGISLATIONANDTREATIES/PDFFILES/01MaritimeZonesTSOLRegs2020.pdf\r\n",
    "keywords": "12M, CK, Cook Islands, Cook Islands Territorial Sea Zone, TSZ",
    "name": "Cook Islands Territorial Sea Zone (12 Nautical Miles)",
    "url": "https://pacificdata.org/data/dataset/cook-islands-territorial-sea-zone"
}