{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/edmunds2016size-dependent-physiological-responses-of-the-branching-coral-pocillopora-verrucosa-",
    "@type": "Dataset",
    "description": "Body size has large effects on organism physiology, but these effects remain poorly understood in modular animals with complex morphologies. Using two trials of a ∼24 day experiment conducted in 2014 and 2015, we tested the hypothesis that colony size of the coral Pocillopora verrucosa affects the response of calcification, aerobic respiration and gross photosynthesis to temperature (∼26.5 and ∼29.7°C) and PCO2  (∼40 and ∼1000 µatm). Large corals calcified more than small corals, but at a slower size-specific rate; area-normalized calcification declined with size. Whole-colony and area-normalized calcification were unaffected by temperature, PCO2 , or the interaction between the two. Whole-colony respiration increased with colony size, but the slopes of these relationships differed between treatments. Area-normalized gross photosynthesis declined with colony size, but whole-colony photosynthesis was unaffected by PCO2 , and showed a weak response to temperature. When scaled up to predict the response of large corals, area-normalized metrics of physiological performance measured using small corals provide inaccurate estimates of the physiological performance of large colonies. Together, these results demonstrate the importance of colony size in modulating the response of branching corals to elevated temperature and high PCO2.",
    "keywords": "biological-response, calcification, corals, laboratory, multiple-factors, ocean-acidification, photosynthesis, respiration, south-pacific, temperature",
    "name": "Size-dependent physiological responses of the branching coral Pocillopora verrucosa to elevated temperature and pCO2",
    "url": "https://pacificdata.org/data/dataset/edmunds2016size-dependent-physiological-responses-of-the-branching-coral-pocillopora-verrucosa-"
}