{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/stepien2016afunctional-traits-for-carbon-access-in-macrophytes",
    "@type": "Dataset",
    "description": "Understanding functional trait distributions among organisms can inform impacts on and responses to environmental change. In marine systems, only 1% of dissolved inorganic carbon in seawater exists as CO2. Thus the majority of marine macrophytes not only passively access CO2 for photosynthesis, but also actively transport CO2 and the more common bicarbonate (HCO3-, 92% of seawater dissolved inorganic carbon) into their cells. Because species with these carbon concentrating mechanisms (CCMs) are non-randomly distributed in ecosystems, we ask whether there is a phylogenetic pattern to the distribution of CCMs among algal species. To determine macrophyte traits that influence carbon uptake, we assessed 40 common macrophyte species from the rocky intertidal community of the Northeast Pacific Ocean to a) query whether macrophytes have a CCM and b) determine the evolutionary history of CCMs, using ancestral state reconstructions and stochastic character mapping based on previously published data. Thirty-two species not only depleted CO2, but also concentrated and depleted HCO3-, indicative of a CCM. While analysis of CCMs as a continuous trait in 30 families within Phylum Rhodophyta showed a significant phylogenetic signal under a Brownian motion model, analysis of CCMs as a discrete trait (presence or absence) indicated that red algal families are more divergent than expected in their CCM presence or absence; CCMs are a labile trait within the Rhodophyta. In contrast, CCMs were present in each of 18 Ochrophyta families surveyed, indicating that CCMs are highly conserved in the brown algae. The trait of CCM presence or absence was largely conserved within Families. Fifteen of 23 species tested also changed the seawater buffering capacity, or Total Alkalinity (TA), shifting DIC composition towards increasing concentrations of HCO3 - and CO2 for photosynthesis. Manipulating the external TA of the local  nvironmentmay influence carbon availability in boundary layers and areas of low water mixing, offering an additional mechanism to increase CO2 availability.",
    "keywords": "algae, biogeochemistry, biological-response, laboratory, north-pacific, ocean-acidification, phanerogams, primary-production",
    "name": "Functional traits for carbon access in macrophytes",
    "url": "https://pacificdata.org/data/dataset/stepien2016afunctional-traits-for-carbon-access-in-macrophytes"
}