{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/smith2009bbryozoans-as-southern-sentinels-of-ocean-acidification-a-major-role-for-a-minor-phylu",
    "@type": "Dataset",
    "description": "Rapid anthropogenic production of CO2 has driven the carbonate chemistry of the sea, causing lowered pH in surface waters. Increasingly, scientists are called on to study ocean acidification and its effects. The ‘minor' phylum Bryozoa shows considerable potential in understanding temperate southern hemisphere shelf carbonate dynamics, thus complementing tropical studies based mainly on corals. Lowered pH affects skeletons differently depending on their composition, but skeletons are even more strongly affected by morphology. Different bryozoans will manifest the effects of acidification at different times, thus some particularly vulnerable species may act as ‘canaries' providing an early warning for some shelf communities, such as bryozoan-dominated thickets. A carbonate budget based on several studies of the bryozoan Adeonellopsis in Doubtful Sound, New Zealand, shows that increasing dissolution pressure in cool temperate environments dramatically reduces sediment accumulation rates. Bryozoan shelf carbonate sediments, which blanket the southern shelves of New Zealand and Australia, may serve as biological saturometers, monitoring the effects of acidification over shelf depths. Whether acting as canaries, models or sentinels, bryozoans have great potential to provide insight into the next global challenge: ocean acidification.",
    "keywords": "biological-response, bryozoa, dissolution, ocean-acidification, south-pacific",
    "name": "Bryozoans as southern sentinels of ocean acidification: a major role for a minor phylum",
    "url": "https://pacificdata.org/data/dataset/smith2009bbryozoans-as-southern-sentinels-of-ocean-acidification-a-major-role-for-a-minor-phylu"
}