{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/melancon2016bimpact-of-ocean-acidification-on-phytoplankton-assemblage-growth-and-dms-productio",
    "@type": "Dataset",
    "description": "Ocean acidification (OA) is likely to have an effect on the fertilizing potential of desert dust in high-nutrient, low-chlorophyll oceanic regions, either by modifying iron (Fe) speciation and bioavailability or by altering phytoplankton Fe requirements and acquisition. To address this issue, short incubations (4 days) of northeast subarctic Pacific waters enriched with either FeSO4 or dust and set at pH 8.0 (in situ) and 7.8 were conducted in August 2010. We assessed the impact of a decrease in pH on dissolved Fe concentration, phytoplankton biomass, taxonomy and productivity, and the production of dimethylsulfide (DMS) and its algal precursor dimethylsulfoniopropionate (DMSP). Chlorophyll a (chl a) remained unchanged in the controls and doubled in both the FeSO4-enriched and dust-enriched incubations, confirming the Fe-limited status of the plankton assemblage during the experiment. In the acidified treatments, a significant reduction (by 16–38 %) in the final concentration of chl a was measured compared to their nonacidified counterparts, and a 15 % reduction in particulate organic carbon (POC) concentration was measured in the dust-enriched acidified treatment compared to the dust-enriched nonacidified treatment. FeSO4 and dust additions had a fertilizing effect mainly on diatoms and cyanobacteria as estimated from algal pigment signatures. Lowering the pH affected mostly the haptophytes, but pelagophyte concentrations were also reduced in some acidified treatments. Acidification did not significantly alter DMSP and DMS concentrations. These results show that dust deposition events in a low-pH iron-limited northeast subarctic Pacific are likely to stimulate phytoplankton growth to a lesser extent than in today's ocean during the few days following fertilization and point to a low initial sensitivity of the DMSP and DMS dynamics to OA.",
    "keywords": "abundance, biogeochemistry, biological-response, brcommunity, chemistry, community-composition, laboratory, multiple-factors, north-pacific, nutrients, ocean-acidification, otherprocess, phytoplankton",
    "name": "Impact of ocean acidification on phytoplankton assemblage, growth, and DMS production following Fe-dust additions in the NE Pacific high-nutrient, low-chlorophyll waters",
    "url": "https://pacificdata.org/data/dataset/melancon2016bimpact-of-ocean-acidification-on-phytoplankton-assemblage-growth-and-dms-productio"
}