{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/draft-energy-policy-2021-2030",
    "@type": "Dataset",
    "description": "The resilient development and diversification of Fiji’s energy sector is a long-term priority for the Fijian\r\nGovernment due in part to rising national energy demand, volatile oil prices, ageing energy\r\ninfrastructure, and the intensifying impact of climate change and disaster events on Fiji’s\r\ninfrastructure, environment, people, and economy. Beyond these factors and trends there is an array\r\nof current and projected socio-economic and cultural changes that are reconfiguring the way Fijians\r\nutilise different forms of energy and depend on energy services. The introduction of new energy\r\ntechnologies, increased digitization, and shifting national preferences will continue to further change\r\nthe way energy services must be designed, scaled, and delivered. These factors mean that specific\r\nactions and policy measures will be required to adapt to an array of changing demand parameters\r\nthat must be met to maintain and improve energy security.\r\nNational energy production and consumption in Fiji remains highly dependent on imported fossil fuels\r\nin part due to the current demands of the transport sector and the ongoing reliance on thermal power\r\nplants to supplement renewable energy sources within Fiji’s electricity sector. In light of Fiji’s\r\ncommitments to address both the causes and impacts of climate change and transition rapidly to a\r\nsustainable economy producing net-zero emissions annually by 2050, this National Energy Policy\r\nprovides the intent, direction, and priority objectives to support national energy security, achieve\r\nuniversal and equitable access to energy services, harness sustainable sources of energy, maximise\r\nenergy efficiency, and improve the institutional arrangements to facilitate this transition.",
    "keywords": "department-of-energy",
    "name": "Draft Energy Policy : 2021 - 2030",
    "url": "https://pacificdata.org/data/dataset/draft-energy-policy-2021-2030"
}