{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl--a-woman-should-be-beaten-if-she-deserves-punishment-conversations-with-men-and-women-in-fiji-an",
    "@type": "Dataset",
    "description": "Among the consequences of conflict over gender roles or norms, the most disempowering one is violence against women. As part of the World Bank’s qualitative study informing the World Development Report 2012: Gender Equality and Development, local researchers in Fiji and Papua New Guinea organised focus groups to elicit information about the impact of gender norms on women and men and to learn about the changes in women’s and men’s lives as these gender norms changed or persisted. \n\nThis short paper presents men’s and women’s accounts of domestic violence when we asked focus groups to reflect on what typically happens in their communities when a wife is not a good wife or a husband is not a good husband. The focus groups’ narratives consistently reported that men who are unable to fulfil their provider role often act out their frustrations with violence, and that it remains acceptable in many communities to sanction women harshly for minor infractions that are perceived as challenging male authority or norms of feminine conduct. \n\nExisting studies suggest that men’s lives in the Pacific are enmeshed in processes of transformation. In particular, masculine ideals of men are being actively challenged where changing socio-economic conditions make it difficult to realise dominant models of masculinity. This greatly complicates women’s agency and their pursuit of goals requires either resistance to, or relaxation of, the gender norms that govern their roles and responsibilities. There is limited research being done exploring why gender norms around traditional roles of men and women often persist even when circumstances change.",
    "keywords": "ending-violence-against-women, enhancing-agency, pacific-women, short-paper, social-norms, violence",
    "name": "‘A Woman Should Be Beaten If She Deserves Punishment’: Conversations with Men and Women in Fiji and PNG",
    "url": "https://pacificdata.org/data/dataset/pwl--a-woman-should-be-beaten-if-she-deserves-punishment-conversations-with-men-and-women-in-fiji-an"
}