{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/colburn2016aindicators-of-climate-change-and-social-vulnerability-in-fishing-dependent-communit",
    "@type": "Dataset",
    "description": "Changing climatic conditions are affecting the relationship between fishing communities and the marine resources they depend on. This shift will require an adaptive response on the part of policy makers and fishery managers. In the U.S., the National Oceanic and Atmospheric Administration (NOAA) established, in its fisheries agency (NOAA Fisheries), a set of social indicators of fishing community vulnerability and resilience to evaluate the impacts of changes in fishery management regimes. These indicators enhance the analytical capabilities within NOAA Fisheries for conducting fisheries social impact assessments and informing ecosystem-based fishery management. Building on the existing Community Social Vulnerability Indicators (CSVIs), new measures of climate change vulnerability are defined for the U.S. Eastern and Gulf coasts. These new indicators are used to assess the impact of sea level rise on critical commercial fishing infrastructure and the dependence of communities on species identified as vulnerable to the effects of climate change. Examples are provided in this article to demonstrate the utility of these new indicators to policy makers and the NOAA strategic goal for building resilient coastal communities that are environmentally and economically sustainable. Integration of CSVIs and the new climate change vulnerability indices highlight community needs for unique solutions in order to adapt to environmental and social changes and maintain their well-being.",
    "keywords": "fisheries, north-pacific, ocean-acidification, socio-economy",
    "name": "Indicators of climate change and social vulnerability in fishing dependent communities along the Eastern and Gulf Coasts of the United States",
    "url": "https://pacificdata.org/data/dataset/colburn2016aindicators-of-climate-change-and-social-vulnerability-in-fishing-dependent-communit"
}