{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-un-women-s-position-of-the-post-2015-stand-alone-goal-on-achieving-gender-equality",
    "@type": "Dataset",
    "description": "This paper supports the case for a transformative goal on gender equality, women’s rights and women’s empowerment. The case for a stand-alone gender-related goal, as well as addressing gender priorities into each goal, has been actively supported by Pacific Leaders and the women’s movement. The importance of a standalone goal in post-2015 development agenda was evident at the 12th Triennial Conference of Pacific Women held 2013. A key recommendation from the Triennial Conference was that; ‘the post 2015 development agenda to adopt a transformative stand-alone goal to achieve gender equality, women’s rights and women’s empowerment, structured around several target areas: freedom from violence, gender equality in capabilities and resources, gender equality and decision making power, and a voice in public and private institutions’. \n\nThis document sets out the stand-alone goal to achieve gender equality, women’s rights and women’s empowerment proposed by UN Women and structured around three global target areas: \n\n- Freedom from violence. \n\n- Gender equality in capabilities and resources. \n\n- Gender equality in decision-making power and voice in public and private institutions. \n\nThese three areas address inter-related dimensions of gender inequality. \n\nGlobal indicators that are designed to measure progress towards transformative change in gender relations are useful to monitor a stand-alone goal and the gender considerations in other goals.",
    "keywords": "Education, Health, Report, climate-change-and-environment, development-programming, enhancing-agency, human-rights, land-sea-and-livelihoods, leadership-and-politics, pacific-women, social-norms, violence",
    "name": "UN Women’s position of the post 2015 stand alone goal on achieving gender equality",
    "url": "https://pacificdata.org/data/dataset/pwl-un-women-s-position-of-the-post-2015-stand-alone-goal-on-achieving-gender-equality"
}