{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/humphreys2018effect-of-seawater-temperature-ph-and-nutrients-on-the-distribution-and-character-",
    "@type": "Dataset",
    "description": "In order to help predict the effects of anthropogenic stressors on shallow water carbonate environments, it is important to focus research on regions containing natural oceanographic gradients, particularly with respect to interactions between oceanography and ecologically sensitive carbonate producers. The Galápagos Archipelago, an island chain in the eastern equatorial Pacific, spans a natural nutrient, pH, and temperature gradient due to the interaction of several major ocean currents. Further, the region is heavily impacted by the El Niño—Southern Oscillation (ENSO) and the Galápagos exhibited widespread coral bleaching and degradation following the strong ENSO events of 1982–1983 and 1997–1998. These findings are coupled with reports of unusually low abundances of time-averaged benthic foraminiferal assemblages throughout the region. Foraminifera, shelled single-celled protists, are sensitive to environmental change and rapidly respond to alterations to their surrounding environment, making them ideal indicator species for the study of reef water quality and health. Here, statistical models and analyses were used to compare modern shallow water benthic foraminiferal assemblages from 19 samples spanning the Galápagos Archipelago to predominant oceanographic parameters at each collection site. Fisher $α$ diversity indices, Ternary diagrams, Canonical Correspondence Analysis, regression tree analysis and FORAM-Index (FI; a single metric index for evaluating water quality associated with reef development) implied a combined impact from ENSO and upwelling from Equatorial Undercurrent (EUC) waters to primarily impact foraminiferal abundances and drive assemblage patterns throughout the archipelago. For instance, repeated ENSO temperature anomalies might be responsible for low foraminiferal density, while chronically high nutrients and low aragonite saturation and low pH—induced by EUC upwelling and La Niña anomalies—likely inhibited post-ENSO recovery, and caused foraminiferal assemblages to exhibit a heterotrophic dominance in the southern archipelago. What resulted are low FI values in the southern collection sites, indicating environments not conducive to endosymbiont development and/or recovery.",
    "keywords": "abundance, biological-response, brcommunity, chemistry, community-composition, field, north-pacific, ocean-acidification, otherprocess, protists, south-pacific",
    "name": "Effect of seawater temperature, pH, and nutrients on the distribution and character of low abundance shallow water benthic foraminifera in the Galápagos",
    "url": "https://pacificdata.org/data/dataset/humphreys2018effect-of-seawater-temperature-ph-and-nutrients-on-the-distribution-and-character-"
}