{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/odonnell2009predicted-impact-of-ocean-acidification-on-a-marine-invertebrate-elevated-co2-alter",
    "@type": "Dataset",
    "description": "Ocean acidification (OA) and the biological consequences of altered seawater chemistry have emerged as a significant environmental threat to healthy marine ecosystems. Because a more acidic ocean interferes with fixation of calcium carbonate to form shells or calcified skeletons, future ocean chemistry may significantly alter the physiology of calcifying marine organisms. These alterations may manifest themselves directly in the calcification process, or have synergistic effects with other environmental factors such as elevated temperatures. New tools permit us to explore subtle changes in gene expression patterns in response to environmental conditions. We raised sea urchins (Strongylocentrotus franciscanus) under conditions simulating future atmospheric CO2 levels of 540 and 970 ppm. When larvae raised under elevated CO2 conditions were subjected to 1-h acute temperature stress, their ability to mount a physiological response (as measured by expression of the molecular chaperone hsp70) was reduced relative to those raised under ambient CO2 conditions. These results represent the first use of gene expression assays to study the effects of OA on sea urchin development. They highlight the importance of looking at multiple environmental factors simultaneously as this approach may reveal previously unsuspected biological impacts of atmospheric changes.",
    "keywords": "biological-response, echinoderms, laboratory, molecular-biology, north-pacific, oaiccincomplete, ocean-acidification, performance",
    "name": "Predicted impact of ocean acidification on a marine invertebrate: elevated CO2 alters response to thermal stress in sea urchin larvae",
    "url": "https://pacificdata.org/data/dataset/odonnell2009predicted-impact-of-ocean-acidification-on-a-marine-invertebrate-elevated-co2-alter"
}