{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/federated-states-of-micronesia-1998-deepsea-mineral-resources-survey-report-and-atlas-2",
    "@type": "Dataset",
    "description": "The Cooperative Study on the Deepsea Mineral Resources in Selected Offshore Areas of the SOPAC Region, 1998, Federated States of Micronesia. Survey was conducted in an area of 1,265,000km2 within the exclusive economic zones of the Republic of the Marshall Islands and the Federated States of Micronesia.The survey areas for this study are the areas approximately 551,793km2 in the eastern sea area, and 712,683km2 in the western sea area.These areas were selected in accordance with the joint study program for marine mineral \nresources in the exclusive economic waters of the SOPAC member countries agreed upon by Japanese \nexecuting agency and South Pacific Applied Geoscience Commission (SOPAC) on 13 March 1995. Two marine areas, namely the eastern sea area centered around the oceanic plateau with Anewetak Atoll and Ujelang Atoll of the Republic of Marshall Islands, and the western sea area in the vicinity of the Caroline Islands of Yap Province of the Federated States of Micronesia were selected as the surveyed areas with reference to previous survey. A total of seven sea mounts were selected.Topographic, acoustic, seafloor observation, sampling and other surveys were carried out. On land; samples were identified and analyzed, data were analyzed and interpreted.The purpose of the survey is to assess the potential of submarine mineral resources within the \nExclusive Economic Zones of the Republic of the Marshall Islands and the Federated States of \nMicronesia, members of SOPAC, through submarine topographical survey, sampling and other surveys.EASTERN AREA: Latitude,Longitude      Eastern Area                .        Latitude  Longitude                  A)  158 °00’E   13°30’N    B)   13°30’N     165 °00’E     C)   7°00’N    165 °00’E     D)   7°00’N    l58 °00’E     A)   13°00’N     158 °00’E WESTERN SIDE AREA Latitude    LongitudeA)   11°30’N     139 °00’E   B)   11°30’N     148 °00’EC)    5°00’N     148 °00’ED)    5°00’N     139 °00’EA)   11°30’N     139 °00’E",
    "keywords": "cobalt-rich-manganese-crust, deepsea-marine-resources, maritime-boundaries, micronesiafed-states-of, sea-mount",
    "name": "Federated States of Micronesia, 1998,  Deepsea Mineral Resources Survey Report and Atlas #2",
    "url": "https://pacificdata.org/data/dataset/federated-states-of-micronesia-1998-deepsea-mineral-resources-survey-report-and-atlas-2"
}