{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/federated-states-of-micronesia-exclusive-economic-zone-200-nautical-miles-_edit_october",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((136.3381326198578 0.8964488710052383, 136.3381326198578 13.085900025099447, 162.8811013698578 13.085900025099447, 162.8811013698578 0.8964488710052383, 136.3381326198578 0.8964488710052383))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "200NM\r\n\r\nChapter 1 of Title 18 of the Code of the Federated States of Micronesia, as amended by Public Law No. 19-172 on April 28, 2017, states that the Exclusive economic zone is contiguous to the territorial sea. The inner boundary of the exclusive economic zone of each island or atoll is the seaward boundary of the territorial sea, and the outer boundary is a line, every point of which is two hundred nautical miles seaward of the nearest point on the baseline. \r\n\r\nSection 105 further states that  within the exclusive economic zone, the National Government of the Federated States of Micronesia shall have: \r\n\r\n(1) Sovereign rights for the purpose of exploring and exploiting, conserving and managing the natural resources, whether living or nonliving, of the waters superjacent to the seabed and of the seabed and its subsoil, and with regard to other activities for the economic exploitation and exploration of the zone; \r\n\r\n(2) Jurisdiction with regard to the establishment and use of artificial islands, installations, and structures; marine scientific research; and the protection and preservation of the marine environment; and \r\n\r\n(3) Other rights and duties provided for in international law.\r\n\r\nhttps://www.un.org/depts/los/LEGISLATIONANDTREATIES/PDFFILES/FSM_1988_Act.pdf\r\nhttps://www.un.org/depts/los/LEGISLATIONANDTREATIES/PDFFILES/Title18FSMCode.pdf\r\n\r\n",
    "keywords": "200M, 200NM, FFA",
    "name": "Federated States of Micronesia Exclusive Economic Zone (200 Nautical Miles)",
    "url": "https://pacificdata.org/data/dataset/federated-states-of-micronesia-exclusive-economic-zone-200-nautical-miles-_edit_october"
}