{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/zhang2013cdiurnal-and-seasonal-variations-of-carbonate-system-parameters-on-luhuitou-fringing-r",
    "@type": "Dataset",
    "description": "The 3-day diurnal dynamics of carbonate system and related parameters on Luhuitou fringing reef of Sanya Bay-adjacent to the South China Sea (SCS) were observed in December of 2009 (early winter), April (spring), July (summer) and November (late-autumn) of 2010. The Luhuitou fringing reef ecosystem was generally dominated by macro and planktonic algae throughout the year except by coralline algae in winter. The system parameters showed distinct diurnal trends in the four seasons. Averaged ranges of diurnal variation for dissolved oxygen and partial pressure of CO2 (pCO2) were higher in the autumn, 4.67 mg L−1 and 218.2 $μ$atm, respectively than other seasons. Averaged ranges of diurnal variation for normalized total alkalinity (NTA) was higher in the winter (61.3 $μ$mol kg−1), and lower in the spring (16.0 $μ$mol kg−1). The diurnal variations are mainly controlled by biological activities, especially by the processes of photosynthesis and respiration in the reef ecosystem. In winter, however, calcification and dissolution contributed more to the diurnal variations, compared with the other three seasons. Total alkalinity was largely related to seasonal changes in river inflow rates. Dissolved oxygen, pH, total CO2 and aragonite saturation also showed seasonal variations. These variations were mainly controlled by the seasonal changes of photosynthesis and respiration, which were mainly affected by changes in benthic community structure, temperature and river inflow rates. The oversaturated pCO2 in the reef ecosystem with respect to the atmosphere in the winter and summer resulted in CO2 discharge from the reef ecosystem to the SCS. The whole system served as net source of CO2 to the atmosphere and the adjacent South China Sea on an annual time scale.  ",
    "keywords": "chemistry, corals, field, north-pacific, ocean-acidification",
    "name": "Diurnal and seasonal variations of carbonate system parameters on Luhuitou fringing reef, Sanya Bay, Hainan Island, South China Sea",
    "url": "https://pacificdata.org/data/dataset/zhang2013cdiurnal-and-seasonal-variations-of-carbonate-system-parameters-on-luhuitou-fringing-r"
}