{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-women-s-leadership-in-the-pacific",
    "@type": "Dataset",
    "description": "Within the spheres of politics, the bureaucracy, and civil society, this paper examines the literature in relation to: obstacles to women’s participation, success factors, outcomes, and policy and donor approaches to supporting women’s participation. The paper also highlights research gaps, and compares the Pacific experience with broader findings on women’s participation in decision making.\n\nPacific women’s prominent informal peacebuilding role has not always led to their participation in formal peacebuilding processes: opportunities to facilitate equitable social and political change have been missed. \n\nWomen’s impact on governance and policy-making in the region has received little scrutiny and there is a limited evidence base on this topic. Although gender analyses carried out as part of donor-funded capacity development programs contain a lot of information on women’s participation in Pacific bureaucracies, this material is rarely made public. \n\nA key finding is that social organisation and gendered cultural beliefs and practices are significant hindrances to women’s\nparticipation in all spheres. Donors wishing to support\nwomen’s empowerment, often through travel to training\nand networking events, face challenges in minimising the\npotential harm that may arise from such support. When\ninitiatives to empower individual women move at a faster\npace than institutional and cultural change, enthusiastic\nwomen may return to their work places or communities\nto face increased discrimination and, sometimes, physical\nviolence. This suggests a need to listen to local women’s\nviews about how empowerment can be achieved – views\nthat often differ from those of donors.",
    "keywords": "development-programming, leadership-and-decision-making, leadership-and-politics, literature-review, pacific-women, research-report, social-norms",
    "name": "Women’s Leadership in the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-women-s-leadership-in-the-pacific"
}