{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/johnson2014acontrasting-effects-of-ocean-acidification-on-tropical-fleshy-and-calcareous-algae",
    "@type": "Dataset",
    "description": "Despite the heightened awareness of ocean acidification (OA) effects on marine organisms, few studies empirically juxtapose biological responses to CO2 manipulations across functionally distinct primary producers, particularly benthic algae. Algal responses to OA may vary because increasing CO2 has the potential to fertilize photosynthesis but impair biomineralization. Using a series of repeated experiments on Palmyra Atoll, simulated OA effects were tested across a suite of ecologically important coral reef algae, including five fleshy and six calcareous species. Growth, calcification and photophysiology were measured for each species independently and metrics were combined from each experiment using a meta-analysis to examine overall trends across functional groups categorized as fleshy, upright calcareous, and crustose coralline algae (CCA). The magnitude of the effect of OA on algal growth response varied by species, but the direction was consistent within functional groups. Exposure to OA conditions generally enhanced growth in fleshy macroalgae, reduced net calcification in upright calcareous algae, and caused net dissolution in CCA. Additionally, three of the five fleshy seaweeds tested became reproductive upon exposure to OA conditions. There was no consistent effect of OA on algal photophysiology. Our study provides experimental evidence to support the hypothesis that OA will reduce the ability of calcareous algae to biomineralize. Further, we show that CO2 enrichment either will stimulate population or somatic growth in some species of fleshy macroalgae. Thus, our results suggest that projected OA conditions may favor non-calcifying algae and influence the relative dominance of fleshy macroalgae on reefs, perpetuating or exacerbating existing shifts in reef community structure.  ",
    "keywords": "101594pangaea838995, algae, biological-response, calcification, dissolution, field, morphology, north-pacific, oaiccdb, ocean-acidification, photosynthesis",
    "name": "Contrasting effects of ocean acidification on tropical fleshy and calcareous algae",
    "url": "https://pacificdata.org/data/dataset/johnson2014acontrasting-effects-of-ocean-acidification-on-tropical-fleshy-and-calcareous-algae"
}