{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/harvey2018adissolution-the-achilles-heel-of-the-triton-shell-in-an-acidifying-ocean",
    "@type": "Dataset",
    "description": "Ocean acidification is expected to negatively impact many calcifying marine organisms by impairing their ability to build their protective shells and skeletons, and by causing dissolution and erosion. Here we investigated the large predatory “triton shell” gastropod Charonia lampas in acidified conditions near CO2 seeps off Shikine-jima (Japan) and compared them with individuals from an adjacent bay with seawater pH at present-day levels (outside the influence of the CO2 seep). By using computed tomography we show that acidification negatively impacts their thickness, density, and shell structure, causing visible deterioration to the shell surface. Periods of aragonite undersaturation caused the loss of the apex region and exposing body tissues. While gross calcification rates were likely reduced near CO2 seeps, the corrosive effects of acidification were far more pronounced around the oldest parts of the shell. As a result, the capacity of C. lampas to maintain their shells under ocean acidification may be strongly driven by abiotic dissolution and erosion, and not under biological control of the calcification process. Understanding the response of marine calcifying organisms and their ability to build and maintain their protective shells and skeletons will be important for our understanding of future marine ecosystems.",
    "keywords": "biological-response, chemistry, field, mollusks, morphology, north-pacific, ocean-acidification, vents",
    "name": "Dissolution: the Achilles' heel of the triton shell in an acidifying ocean",
    "url": "https://pacificdata.org/data/dataset/harvey2018adissolution-the-achilles-heel-of-the-triton-shell-in-an-acidifying-ocean"
}