{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pecorino2014impacts-of-near-future-sea-surface-ph-and-temperature-conditions-on-fertilisation-a",
    "@type": "Dataset",
    "description": "Oceans are warming and becoming more acidic. While higher temperature and lower pH can have negative effects on fertilisation and development of marine invertebrates, warming may partially ameliorate the negative effect of lower pH. This study determined the effect of warming (3 °C) and decreased pH (0.3, 0.5, 1.1 units below ambient) on fertilisation and development in two populations of the sea urchin Centrostephanus rodgersii, one at its northern range limit (Coffs Harbour, New South Wales NSW, 30°27′S, 153°14′E) and the other one in New Zealand where the species may be a recent arrival (Mokohinau Islands, 35°56′S, 175°9′E). Both populations were sampled in August 2011. The two populations exhibited a differential response to temperature, while pH affected them similarly. Fertilisation was robust to pH levels forecast for 2100, and it was only slightly reduced at pH values forecast for 2300 (i.e. ≈5 and ≈8 % for the northern NSW and the New Zealand populations, respectively). Decreased pH (pH = 7.6) reduced the percentage of succeeding developmental stages. Progression through cleavage and hatching stages was faster at +3 °C in the New Zealand population but not in northern NSW urchins, while for the NSW population, there was a positive interaction between temperature and pH at hatching. Gastrulation was negatively affected by an extreme pH 7.0 treatment (60–80 % reduction) and least affected by increased temperature. The percentage of abnormal embryos at gastrulation increased significantly at +3 °C treatment in the northern NSW population. Predicted future increases in temperature may facilitate further expansion of the geographical range of C. rodgersii in New Zealand, with a minimal effect of concurrent reduced pH.",
    "keywords": "biological-response, echinoderms, laboratory, morphology, multiple-factors, ocean-acidification, reproduction, south-pacific, temperature",
    "name": "Impacts of near future sea surface pH and temperature conditions on fertilisation and embryonic development in Centrostephanus rodgersii from northern New Zealand and northern New South Wales, Australia",
    "url": "https://pacificdata.org/data/dataset/pecorino2014impacts-of-near-future-sea-surface-ph-and-temperature-conditions-on-fertilisation-a"
}