{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/munday2009cinteracting-effects-of-elevated-temperature-and-ocean-acidification-on-the-aerobic-p",
    "@type": "Dataset",
    "description": "Concerns about the impacts of ocean acidification on marine life have mostly focused on how reduced carbonate saturation affects calcifying organisms. Here, we show that levels of CO2-induced acidification that may be attained by 2100 could also have significant effects on marine organisms by reducing their aerobic capacity. The effects of temperature and acidification on oxygen consumption were tested in 2 species of coral reef fishes, Ostorhinchus doederleini and O. cyanosoma, from the Great Barrier Reef, Australia. The capacity for aerobic activity (aerobic scope) declined at temperatures above the summer average (29°C) and in CO2-acidified water (pH 7.8 and ̃1000 ppm CO2) compared to control water (pH 8.15). Aerobic scope declined by 36 and 32% for O. doederleini and O. cyanosoma at temperatures between 29 to 32°C, whereas it declined by 33 and 47% for O. doederleini and O. cyanosoma in acidified water compared to control water. Thus, the declines in aerobic scope in acidified water were similar to those caused by a 3°C increase in water temperature. Minimum aerobic scope values of \\̃200 mg O2 kg–1 h–1 were attained for both species in acidified water at 32°C, compared with over 600 mg O2 kg–1 h–1 in control water at 29°C. Mortality rate increased sharply at 33°C, indicating that this temperature is close to the lethal thermal limit for both species. Acidification further increased the mortality rate of O. doederleini, but not of O. cyanosoma. These results show that coral reef fishes are sensitive to both higher temperatures and increased levels of dissolved CO2, and that the aerobic performance of some reef fishes could be significantly reduced if climate change continues unabated.",
    "keywords": "101594pangaea744864, biological-response, fish, laboratory, mortality, multiple-factors, oaiccdb, ocean-acidification, physiology, south-pacific, temperature",
    "name": "Interacting effects of elevated temperature and ocean acidification on the aerobic performance of coral reef fishes",
    "url": "https://pacificdata.org/data/dataset/munday2009cinteracting-effects-of-elevated-temperature-and-ocean-acidification-on-the-aerobic-p"
}