{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/li2015lmorphology-and-classification-of-hemocytes-in-pinctada-fucata-and-their-responses-to-oce",
    "@type": "Dataset",
    "description": "Hemocytes play important roles in the innate immune response and biomineralization of bivalve mollusks. However, the hemocytes in pearl oysters are poorly understood. In the present study, we investigated the morphology and classification of hemocytes in the pearl oyster, P. fucata. Three types of hemocytes were successfully obtained by light microscopy, electron microscopy and flow cytometry methods: small hyalinocytes, large hyalinocytes and granulocytes. The small hyalinocytes are the major hemocyte population. Morphological analyses indicated that these hemocytes have species-specific characterizations. In addition, we assessed the potential effects of ocean acidification (OA) and ocean warming (OW) on the immune parameters and calcium homeostasis of the hemocytes. OA and OW (31°C) altered pH value of hemolymph, increased the total hemocyte count, total protein content, and percentage of large hyalinocytes and granulocytes, while it decreased the neutral red uptake ability, suggesting active stress responses of P. fucata to these stressors. Exposure to OW (25 °C) resulted in no significant differences, indicating an excellent immune defense to heat stress at this level. The outflow of calcium from hemocytes to hemolymph was also determined, implying the potential impact of OA and OW on hemocyte-mediated biomineralization. This study, therefore, provides insight into the classification and characterization of hemocyte in the pearl oyster, P. fucata, and also reveals the immune responses of hemocytes to OA and OW, which are helpful for a comprehensive understanding of the effects of global climate change on pearl oysters.",
    "keywords": "biological-response, laboratory, mollusks, north-pacific, oaiccnoanswer, ocean-acidification, performance, physiology",
    "name": "Morphology and classification of hemocytes in Pinctada fucata and their responses to ocean acidification and warming",
    "url": "https://pacificdata.org/data/dataset/li2015lmorphology-and-classification-of-hemocytes-in-pinctada-fucata-and-their-responses-to-oce"
}