{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-kauntim-mi-tu-port-moresby",
    "@type": "Dataset",
    "description": "The findings this study into HIV and sexually transmitted infections (STIs), called Kauntim mi tu – Port Moresby, provide an improved roadmap for treatment, care and provision of other services to key populations affected by HIV in Port Moresby. \n\nThe study involved women and girls who sell and exchange sex (FSWs), and men who have sex with men and transgender women. It was conducted to provide strategic information for the government to scale up of essential HIV prevention and treatment services for these populations. Some of the key findings include: • HIV prevalence among FSWs in Port Moresby was 14.9% and most do not know their HIV status.\n\n- Prevalence of STIs was high with 52.1% of FSWs having at least one undiagnosed STI (excluding HIV).\n\n- Only 32.7% of FSWs used condoms with all clients who gave money in the last six months.\n\n- More than half of FSWs (57.3%) have experienced physical violence and 34.2% have been forced to have sex. Approximately one in five experienced violence from their clients in the last six months.\n\nRecommendations include: \n\n- Expanding the use of peer driven and social networks and other new evidence-informed HIV testing strategies to increase HIV testing yield. \n\n- Strengthening linkages of people newly diagnosed with HIV to key population friendly clinics for immediate initiation of ART. \n\n-  Expanding the use of peer navigators to support treatment retention of key populations. \n\n- Promoting gender and sexual orientation and identity equality. \n\n- Providing key population sensitivity training to healthcare workers at key health facilities and designate them as key population friendly. \n\n- Ensuring the availability of safe-spaces for the reporting of physical and sexual violence, and the provision of services for key populations. \n\n- Integrating point of care STI testing and treatment in all sexual health services, including HIV testing and treatment facilities. \n\n- Increasing provision of condoms and lubricants at key population hotspots and sexual health facilities. \n\n- Ensuring women and girls who sell and exchange sex are tested for HIV and syphilis during pregnancy, receive treatment as needed, and are provided with comprehensive reproductive health care including family planning.",
    "keywords": "Health, data, ending-violence-against-women, pacific-women, research-report, violence",
    "name": "Kauntim mi tu – Port Moresby",
    "url": "https://pacificdata.org/data/dataset/pwl-kauntim-mi-tu-port-moresby"
}