{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/davis2018areconstructing-aragonite-saturation-state-based-on-an-empirical-relationship-for-nort",
    "@type": "Dataset",
    "description": "Ocean acidification is a global phenomenon with highly regional spatial and temporal patterns. In order to address the challenges of future ocean acidification at a regional scale, it is necessary to increase the resolution of spatial and temporal monitoring of the inorganic carbon system beyond what is currently available. One approach is to develop empirical regional models that enable aragonite saturation state to be estimated from existing hydrographic measurements, for which greater spatial coverage and longer time series exist in addition to higher spatial and temporal resolution. We present such a relationship for aragonite saturation state for waters off Northern California based on in situ bottle sampling and instrumental measurements of temperature, salinity, and dissolved oxygen. Application of this relationship to existing datasets (5 to 200 m depth) demonstrates both seasonal and interannual variability in aragonite saturation state. We document a deeper aragonite saturation horizon and higher near surface aragonite saturation state in the summers of 2014 and 2015 (compared with 2010–2013), associated with anomalous warm conditions and decadal scale oscillations. Application of this model to time series data reiterates the direct association between low aragonite saturation state and upwelled waters and highlights the extent to which benthic communities on the Northern California shelf are already exposed to aragonite undersaturated waters.",
    "keywords": "chemistry, field, methods, modeling, north-pacific, ocean-acidification, regionalmodeling",
    "name": "Reconstructing aragonite saturation state based on an empirical relationship for Northern California",
    "url": "https://pacificdata.org/data/dataset/davis2018areconstructing-aragonite-saturation-state-based-on-an-empirical-relationship-for-nort"
}