{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/regenberg2014global-dissolution-effects-on-planktonic-foraminiferal-mg-ca-ratios-controlled-by-",
    "@type": "Dataset",
    "description": "Mg/Ca ratios of planktonic foraminiferal tests are important tools for reconstructing past ocean temperatures at different levels of the upper water column. Yet numerous studies suggest a significant influence of calcite dissolution on Mg/Ca ratios lowering their initial signal recorded within a planktonic foraminiferal habitat. To determine the effect of dissolution, this study presents Mg/Ca ratios of eight planktonic foraminiferal species from the South China Sea sediment surface. Continuously decreasing with increasing water depth, the Mg/Ca ratios also decrease with calcite-saturation states close to and below saturation (bottom water inline image) but are stable in well calcite-supersaturated bottom waters (\\textgreater40 $μ$mol kg−1). This preservation pattern compares well with examples of Mg/Ca dissolution from the tropical Atlantic Ocean and is independent of the foraminiferal species. Merging a global data set by separate normalization of 79 Mg/Ca data sets from the Pacific, Atlantic, and Indian Oceans, which removes thermal differences between the ocean regions and foraminiferal species, enabled us to quantify a global decrease in planktonic foraminiferal Mg/Ca ratios of 0.054 ±0.019 $μ$mol mol−1 per $μ$mol kg−1 below a critical threshold for dissolution of 21.3 ±6.6 $μ$mol kg−1. The absolute decline in Mg/Ca ratios, which is similar for all species, affects temperature estimates from (sub-)thermocline species more strongly than those from shallow dwellers. The water depth of this critical threshold in the global oceans shoals from \\textgreater3.5 km in the North Atlantic to \\textless0.5 km in the North Pacific based on calculations of the global calcite-saturation state from 6321 hydrographic stations. Above this critical threshold Mg/Ca ratios are well preserved, and paleotemperature estimates are broadly unaffected by dissolution.",
    "keywords": "biological-response, chemistry, dissolution, field, ocean-acidification, protists, south-pacific",
    "name": "Global dissolution effects on planktonic foraminiferal Mg/Ca ratios controlled by the calcite-saturation state of bottom waters",
    "url": "https://pacificdata.org/data/dataset/regenberg2014global-dissolution-effects-on-planktonic-foraminiferal-mg-ca-ratios-controlled-by-"
}