{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/bergman2018abehavior-of-brooded-coral-larvae-in-response-to-elevated-pco2",
    "@type": "Dataset",
    "description": "Elevated pCO2 threatens coral reefs through impaired calcification. However, the extent to which elevated pCO2 affects the distribution of the pelagic larvae of scleractinian corals, and how this may be interpreted in the context of ocean acidification (OA), remains unknown. We tested the hypothesis that elevated pCO2 affects one aspect of the behavior (i.e., motility) of brooded larvae from Pocillopora damicornis in Okinawa (Japan), and used UV-transparent tubes that were 68-cm long (45 mm ID) to incubate larvae on a shallow fringing reef. Replicate tubes were filled with seawater at ̃400 $μ$atm or \\̃1,000 $μ$atm pCO2, stocked with 50 larvae each, and incubated vertically for 12 h with their midpoints at 0.3-m (shallow) or 3.3-m (deep) depth over a reef at 4-m depth. Larval behavior was assayed through their position in the tubes, which was scored in situ every 4 h beginning at 08:00 h. Lipid content was measured at the end of the experiment as a potential driver of behavior through its effects on larval buoyancy. Larval position in the tubes varied between depths and time of day at \\~̃400 $μ$atm pCO2 and \\~1̃,000 $μ$atm pCO2. At \\~0̃0 $μ$atm, larvae moved toward the top (0.1-m) of shallow tubes throughout the day, but in the deep tubes they aggregated at the bottom of the tubes from 08:00 to 20:00 h. In contrast, larvae incubated at \\~0̃00 $μ$atm pCO2 aggregated at the bottom of shallow tubes at 08:00 and 20:00 h, however in the deep tubes they were found in the bottom throughout the day. As lipid content of the larvae declined 23–25% at \\~10̃0 vs. \\~40$̃μ$atm pCO2, loss of lipid may be a cause of modified larval behavior at high pCO2. If the pCO2-mediated changes in behavior and lipid content during this short experiment occur during longer exposures to high pCO2, our results suggest OA could alter the dispersal capacity of brooded coral larvae.",
    "keywords": "biological-response, corals, field, north-pacific, ocean-acidification, performance, physiology, reproduction",
    "name": "Behavior of brooded coral larvae in response to elevated pCO2",
    "url": "https://pacificdata.org/data/dataset/bergman2018abehavior-of-brooded-coral-larvae-in-response-to-elevated-pco2"
}