{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-women-in-politics-and-aid-effectiveness-an-aid-to-evaluation-of-mdg3",
    "@type": "Dataset",
    "description": "This paper discusses Millennium Development Goal (MDG) 3 to ‘Promote Gender Equality and Empower Women’. It examines the appropriateness of the sole indicator for political progress, the number of women elected to national political office, in the context of a future evaluation around MDG3 to be conducted by the Australian Government’s Office of Development Effectiveness. \n\nThe paper discusses the range of concepts discussed in MDG 3 commentary, empowerment, leadership and governance, and the challenges of effectiveness reporting, to suggest creative, constructive and meaningful reflections in the context of the Asia Pacific region, and the low levels of women’s representation. The decision that political representation was an accurate data base to measure the promotion of gender equality and empowerment of women is examined in detail, with specific country cases demonstrating that figures do not reflect this as an accurate measure. The reality for women who run for office in male environments is exposed, and questions are asked about the ethics of seeing this as the only outcome for evaluation. \n\nFinally, suggestions are made which encourage more flexibility of approach to capture successful interventions across a range of meaningful activities that are more relevant for the region, and better related to the diversity of women’s roles in leadership, empowerment and governance.",
    "keywords": "data, development-programming, leadership-and-decision-making, leadership-and-politics, pacific-women, policy-notes-and-papers, social-norms",
    "name": "Women in Politics and Aid Effectiveness: An Aid to Evaluation of MDG3",
    "url": "https://pacificdata.org/data/dataset/pwl-women-in-politics-and-aid-effectiveness-an-aid-to-evaluation-of-mdg3"
}