{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-responding-to-violence-against-women-in-melanesia-and-east-timor",
    "@type": "Dataset",
    "description": "The report titled ‘Violence against Women in Melanesia and East Timor: Building on Global and Regional Promising Approaches’ by the Australian Government’s Office of Development Effectiveness found that violence against women is severe, pervasive and constrains development in Melanesia and East Timor. It causes trauma to women and their families and communities. It severely limits women’s social, political and economic participation in their communities. It represents a significant strain on national economies with escalating costs in health care, social services, policing and the justice system. Without a more comprehensive and effective response to violence against women, the report found that the Millennium Development Goals are unlikely to be achieved internationally, including in Melanesia and East Timor. \n\nAustralia will use the following principles to guide its contribution to ending violence against women: \n\n- Make a long-term commitment to ending violence against women. \n\n- Promote gender equality as a central principle of the Australian aid program’s work. \n\n- Work in partnership with key stakeholders and align with partner government priorities. \n\n- Adopt an integrated approach. \n\nAustralia’s support to end violence against women in Melanesia and East Timor will be based around the following key strategies that have proven successful in reducing violence against women within the region and internationally: \n\n- Improving women’s access to justice. \n\n- Increasing women’s access to support services. \n\n- Preventing violence against women. \n\n- Supporting an integrated approach.",
    "keywords": "Report, development-programming, ending-vioelnce-against-women, pacific-women, social-norms, violence",
    "name": "Responding to Violence Against Women in Melanesia and East Timor",
    "url": "https://pacificdata.org/data/dataset/pwl-responding-to-violence-against-women-in-melanesia-and-east-timor"
}