{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-beijing-20-review-of-progress-in-implementing-the-beijing-platform-for-action-in-pacific-island-",
    "@type": "Dataset",
    "description": "In the lead-up to the Beijing Conference, the Pacific Islands region adopted the Pacific Platform for Action (PPA). Its purpose was to identify regional issues and priorities within those Critical Areas and to put them into a local context. The framework was subsequently reviewed and a Revised Pacific Platform for Action on Advancement of Women and Gender Equality (RPPA) was endorsed in 2004. \n\nIn preparation for the global 15-year review of implementation of the BPA (Beijing+15), UN regional commissions collaborated with the UN Division for the Advancement of Women to facilitate regional dialogue and preparations. In the case of Asia and the Pacific, this activity was coordinated by the UN Economic and Social Commission for Asia and the Pacific (ESCAP) in Bangkok, Thailand. Several Pacific governments participated in ESCAP’s Asia–Pacific High-level Intergovernmental Meeting in Bangkok in November 2009 to discuss regional progress in implementing the BPA, and again at the 54th session of the UN Commission on the Status of Women in New York in March 2010 when the world came together to discuss global progress. \n\nThis report is guided primarily by the BPA and its 15-year review instrument, but also by the RPPA and other relevant regional and international gender equality frameworks. It also aims to increase understanding at regional and national levels of what is needed to move gender equality forward through key areas for action. \n\nThe report will be used as a baseline document for discussion at the 11th Triennial Conference of Pacific Women, to be convened by the Secretariat of the Pacific Community in August 2010, and will provide governments, civil society actors, development partners and Pacific Island women and men more generally with a resource for understanding where we are on the road to gender equality, and the journey we have yet to travel.",
    "keywords": "Education, Health, Report, enhancing-agency, human-rights, land-sea-and-livelihoods, leadership-and-politics, pacific-women, social-norms, violence",
    "name": "Beijing +20: Review of progress in implementing the Beijing Platform for Action in Pacific Island countries and territories",
    "url": "https://pacificdata.org/data/dataset/pwl-beijing-20-review-of-progress-in-implementing-the-beijing-platform-for-action-in-pacific-island-"
}