{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/hurst2012aresiliency-of-juvenile-walleye-pollock-to-projected-levels-of-ocean-acidification",
    "@type": "Dataset",
    "description": "As atmospheric concentrations of CO2 rise, the pH of high-latitude oceans is predicted to decrease by 0.3 to 0.5 units by 2100. Several biological consequences of ocean acidification across this pH range have already been documented in invertebrates and tropical marine fishes. However, little work has been done examining potential responses of the temperate and boreal marine fish species that support major fisheries. In 2 experiments, we examined the growth responses of juvenile walleye pollock Theragra chalcogramma at ambient and 3 elevated CO2 levels. In a short-term experiment with yearlings, CO2 treatment had no significant effect on growth or condition after 6 wk of rearing. Elevated CO2 levels (\\textgreater450 µatm) increased the rate of otolith deposition, but did not affect otolith elemental composition. In a second experiment, growth in length of sub-yearlings over 12 wk at 8°C was 7.2% faster in the 2 higher CO2 treatments (\\textgreater1200 µatm) than in the lower CO2 treatments (\\textless900 µatm). Growth of sub-yearlings measured during 11 subsequent weeks of rearing at 2.5°C did not differ among CO2 treatments. There was no effect of CO2 treatment on condition factor following either phase of the experiment. Sub-yearling consumption rates were not directly affected by CO2 treatment, confirming that growth at elevated CO2 levels is not maintained through compensatory feeding. While not exhaustive of potential interactive environmental factors, these experiments demonstrate a general resiliency of growth energetics in juvenile walleye pollock to the direct effects of CO2 changes predicted for the Gulf of Alaska and Bering Sea in the next century.  ",
    "keywords": "biological-response, calcification, fish, laboratory, morphology, north-pacific, ocean-acidification, otherprocess",
    "name": "Resiliency of juvenile walleye pollock to projected levels of ocean acidification",
    "url": "https://pacificdata.org/data/dataset/hurst2012aresiliency-of-juvenile-walleye-pollock-to-projected-levels-of-ocean-acidification"
}