{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-thematic-brief-ending-violence-against-women-in-the-pacific",
    "@type": "Dataset",
    "description": "This Thematic Brief provides information and analysis about violence against women and girls in the Pacific Islands region. It has been developed by the Support Unit for Pacific Women Shaping Pacific Development (Pacific Women). The seven key messages about violence against women and girls in the Pacific region, and the work supported by Pacific Women, follow. These messages also apply during the COVID-19 response period. During a crisis, women and girls are at increased risk of men’s physical and sexual violence as result of existing gender inequalities being magnified, with women having considerably less autonomy and mobility leading to increases in men’s violence against women.\n1. Women in the Pacific face some of the highest levels of violence in the world. An estimated 60 per cent of women and girls have experienced violence by an intimate partner or family member.\n2. Women and girls are at increased risk of men’s physical and sexual violence during a crisis, such as natural disasters and the COVID-19 pandemic.\n3. Violence takes many forms and women often experience multiple types of violence.\n4. Violence affects women first and foremost but also their children, families and communities.\n5. Physical and sexual violence limits women’s economic empowerment and has high economic costs for societies, including lost wages and productivity, health care and the criminal justice costs of apprehending, prosecuting and imprisoning perpetrators.\n6. The Pacific is developing a stronger legislative framework to protect women, but action is needed to implement these laws.\n7. Violence against women is reinforced by community acceptance and impunity for perpetrators.",
    "keywords": "ending-violence, ending-violence-against-women, pacific-women, thematic-brief",
    "name": "Thematic Brief: Ending Violence against Women in the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-thematic-brief-ending-violence-against-women-in-the-pacific"
}