{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/mcclatchie2016athe-influence-of-pacific-equatorial-water-on-fish-diversity-in-the-southern-cali",
    "@type": "Dataset",
    "description": "The California Undercurrent transports Pacific Equatorial Water (PEW) into the Southern California Bight from the eastern tropical Pacific Ocean. PEW is characterized by higher temperatures and salinities, with lower pH, representing a source of potentially corrosive (aragonite, inline image) water to the region. We use ichthyoplankton assemblages near the cores of the California Current and the California Undercurrent to determine whether PEW influenced fish diversity. We use hydrographic data to characterize the interannual and seasonal variability of estimated pH and aragonite saturation with depth. Although there is substantial variability in PEW presence as measured by spice on the 26.25–26.75 isopycnal layer, as well as in pH and aragonite saturation, we found fish diversity to be stable over the decades 1985–1996 and 1999–2011. We detected significant difference in species structure during the 1998 La Niña period, due to reduced species evenness. Species richness due to rare species was higher during the 1997/1998 El Niño compared to the La Niña but the effect on species structure was undetectable. Lack of difference in the species abundance structure in the decade before and after the 1997/1999 ENSO event showed that the assemblage reverted to its former structure following the ENSO perturbation, indicating resilience. While the interdecadal species structure remained stable, the long tail of the distributions shows that species richness increased between the decades consistent with intrusion of warm water with more diverse assemblages into the southern California region.",
    "keywords": "biological-response, brcommunity, chemistry, community-composition, field, fish, north-pacific, ocean-acidification, otherprocess",
    "name": "The influence of Pacific Equatorial Water on fish diversity in the southern California Current System",
    "url": "https://pacificdata.org/data/dataset/mcclatchie2016athe-influence-of-pacific-equatorial-water-on-fish-diversity-in-the-southern-cali"
}