{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/mardonestoxic-dinoflagellate-blooms-of-in-chilean-fjords-a-resilient-winner-from-climate-change",
    "@type": "Dataset",
    "description": "Exposure of the toxigenic dinoflagellate Alexandrium catenella to variations in pCO2/pH, comparable to current and near-future levels observed in Southern Chilean fjords, revealed potential functional adaptation mechanisms. Under calculated conditions for pH(total scale) and pCO2 ranging from 7.73–8.66 to 69.7–721.3 $μ$atm, respectively, the Chilean strain Q09 presented an optimum growth rate and dissolved inorganic carbon (DIC) uptake at near-equilibrium pCO2/pH conditions (∼8.1). DistaLM analysis between physiological relevant carbonate system parameters (CO2, HCO−3, and H+) and cellular rates (growth rate and DIC uptake) identified HCO−3 as the unique variable explaining a significant portion of the physiological response. Estimations of equivalent spherical diameter (ESD) and chain-formation index (CI) revealed reduced cell size and enhanced chain formation at high pH/low pCO2 conditions. Light intensity as co-factor during experiments (50 vs. 100 $μ$mol photons m−2 s−1) produced no effect on ESD and CI. Cells exposed to low light; however, had reduced cell growth and DIC uptake especially at high pH/low pCO2. We suggest that A. catenella Chilean strains are highly adapted to spatio-temporal pCO2/pH fluctuations in Chilean fjords, becoming a resilient winner from expected climate change effects. ",
    "keywords": "biological-response, growth, laboratory, light, morphology, multiple-factors, ocean-acidification, phytoplankton, primary-production, south-pacific",
    "name": "Toxic dinoflagellate blooms of in Chilean fjords: a resilient winner from climate change",
    "url": "https://pacificdata.org/data/dataset/mardonestoxic-dinoflagellate-blooms-of-in-chilean-fjords-a-resilient-winner-from-climate-change"
}