{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-pacific-regional-icdp-review",
    "@type": "Dataset",
    "description": "This review looks at progress toward the International Conference on Population and Development (ICPD) Programme of Action’s goals on the following themes: \n\n- Sexual and reproductive health and rights. \n\n- Health, morbidity and mortality. \n\n- Family wellbeing and society. \n\n- Gender and empowering women. \n\n- Population and Sustainable development. \n\n- Population change and social development challenges. \n\n- Urbanisation and internal migration. \n\n- International migration and development. \n\n- Population development and education. \n\nThe findings of the ICPD Global Survey Beyond 2014 highlight both the successes and formidable challenges Pacific nations have faced in meeting the ICPD’s goals. The population growth rates of some countries are still too high to ensure viable, sustainable futures and the slow rate of economic development has not kept pace with population growth. The realisation of rights and social protection for vulnerable groups such as women and children, the elderly, youth and people with disabilities is still inadequate. Management of burgeoning urbanisation and development of planning for migration, both internal and international, remain limited. Integrated and comprehensive approaches to achieving reproductive rights and sexual and reproductive health (SRH) across the region are yet to be fully established, and the integration of population issues into education systems is still under development. Enabling women to enjoy full participation in political and economic life remains elusive for most Pacific island countries and gender based violence is reported as prevalent in many countries. \n\nDespite these continuing challenges, there have been notable signs of progress. The number of countries with national population policies is steadily increasing. SRH programmes have received considerable attention and the integration of SRH into primary health programmes has also improved. However, there is a need to improve the legal and policy framework with respect to the protection of rights, ensuring that vulnerable groups, especially persons with disabilities, have access to SRH services. The level of SRH integration into primary health care could also be strengthened to give those who live on outer islands and remote rural communities greater access to information and services. Teenage pregnancy and sexually transmitted infections (STIs), family planning services, addressing unmet need and policy were also a priority for most countries. Given the high rates of STIs in the Pacific this remains a key area to maintain national and regional support.",
    "keywords": "Health, Report, data, development-programming, enhancing-agency, human-rights, pacific-women, violence",
    "name": "Pacific Regional ICDP Review",
    "url": "https://pacificdata.org/data/dataset/pwl-pacific-regional-icdp-review"
}