{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-women-in-local-government-stories-of-inspiration-from-fiji",
    "@type": "Dataset",
    "description": "The first woman to be elected to local government in Fiji was Mrs Maureen Wright in 1967 who then went on to become the Mayor of Lautoka City Council in 1970. Since then the progress of women in local government has been frustratingly slow. Despite 40 years of institutional development, the number of women elected into municipal councils has only increased by a marginal 4% to 14.5% in 2008. Across the local government workforce, women’s representation ranges from a low of 8% to 40% depending on the council, with less than an average of 20% in senior management positions and 2% in field positions. Although these women have contributed an enormous amount to the growth of the sector and their communities, anecdotal evidence suggests there are still significant social and cultural barriers at all levels in the sector that have been and will continue to be difficult to overcome if tackled alone. \n\nThe local government sector has the potential to drive real change and improvement in communities. The Pacific is taking on a different landscape posing both challenges and opportunities for local governments such as increasing urbanisation, cultural diversity, skills shortages and economic recovery. The best possible solutions will be found if women and men combine their knowledge, skills and creativity together to ensure the local government sector and their communities prosper in the future.",
    "keywords": "Report, enhancing-agency, leadership-and-decision-making, leadership-and-politics, pacific-women, social-norms",
    "name": "Women in Local Government – Stories of Inspiration from Fiji",
    "url": "https://pacificdata.org/data/dataset/pwl-women-in-local-government-stories-of-inspiration-from-fiji"
}