{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-pacific-women-shaping-pacific-development-close-out-celebration",
    "@type": "Dataset",
    "description": "The Pacific Women Support Unit welcomed partners, supporters and friends to its Pacific Women Close Out event. The event served as  a celebration of nearly 10 years of partnership through the Pacific Women program, while also disseminating lessons learned from partners’ initiatives to inform future gender equality programming that is effective and transformative. Additionally, it was a welcome to the Pacific Women Lead program. Organisations, governments, individuals, communities and other partners of Pacific Women were acknowledged with respect and gratitude for their incredible hard work of paving positive change for all people in the Pacific.\nThe event included musical performances by Mia Kami and a panel of women leaders presenting from across the region on the challenges of making gender equality a reality in the Pacific and highlighting successes over the course of the program and beyond. The panellists were: ‘Ofa Guttenbeil-Likiliki, Director of the Women and Children Crisis Centre (WCCC) Tonga; Daisy Alik-Momotaro, Executive Director of Women United Together Marshall Islands (WUTMI); Savina Nongebatu, disability inclusion and gender equality advocate from Solomon Islands; and Virisila Buadromo, Advisory Board co-chair and co-lead of the Urgent Action Fund for Women’s Human Rights Asia and the Pacific. The opening remarks were made by Sarah Goulding, Australia’s Department of Foreign Affairs and Trade Gender Equality Branch, and facilitated by Tara Chetty, Partnerships Lead.",
    "keywords": "audio-visual, gender-and-youth, pacific-women, social-norms",
    "name": "Pacific Women Shaping Pacific Development Close Out Celebration",
    "url": "https://pacificdata.org/data/dataset/pwl-pacific-women-shaping-pacific-development-close-out-celebration"
}