{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/dooley2015athe-effect-of-ph-on-natural-settlement-and-metamorphosis-in-the-invasive-limpet-crep",
    "@type": "Dataset",
    "description": "The average pH of ocean surface waters has dropped by about 30%, due to absorption of anthropogenic CO2 emissions. In the past decade, much research has been conducted examining the effect of this “ocean acidification” on marine organisms. Larvae seem especially sensitive. Acidification has been shown to affect chemosensory mechanisms and behavior of clownfish larvae, but little is known about how acidification may affect the sensory biology of marine invertebrate larvae. Like many marine invertebrates, the gastropod Crepidula fornicata settles and metamorphoses in response to chemical cues associated with favorable habitat for juveniles. Other studies on marine invertebrates have found decreased settlement and metamorphosis at lower pH, but none have measured how pH affects settlement and metamorphosis in response to cues from adult conspecifics. We tested the effect of pH on settlement and metamorphosis of four broods of larvae of C. fornicata that were derived from different parents. pH had a significant overall effect on both settlement and metamorphosis in the presence of adults, but not in the direction expected. Larvae settled and metamorphosed at higher frequency at pH 7.5 and 7.7 than at pH 8.0. While this pattern was seen in three of the four broods tested, response to pH treatment varied between broods. Further research is needed to determine if differences between broods remain consistent throughout the larval period, and might therefore reflect adaptations to variable pH regimes in estuarine environments.",
    "keywords": "biological-response, laboratory, mollusks, morphology, north-pacific, ocean-acidification, reproduction",
    "name": "The effect of pH on natural settlement and metamorphosis in the invasive limpet, Crepidula fornicata",
    "url": "https://pacificdata.org/data/dataset/dooley2015athe-effect-of-ph-on-natural-settlement-and-metamorphosis-in-the-invasive-limpet-crep"
}