{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/kleinsymbiodinium-mitigate-the-combined-effects-of-hypoxia-and-acidification-on-a-non-calcifyin",
    "@type": "Dataset",
    "description": "Anthropogenic nutrient inputs enhance microbial respiration within many coastal ecosystems, driving concurrent hypoxia and acidification. During photosynthesis, Symbiodinium spp., the microalgal endosymbionts of cnidarians and other marine phyla, produce O2 and assimilate CO2 , and thus potentially mitigate the exposure of the host to these stresses. However, such a role for Symbiodinium remains untested for non-calcifying cnidarians. We therefore contrasted the fitness of symbiotic and aposymbiotic polyps of a model host jellyfish (Cassiopea sp.) under reduced O2 (̃2.09mgL(-1) ) and pH (\\̃pH 7.63) scenarios in a full factorial experiment. Host fitness was characterised as asexual reproduction and their ability to regulate internal pH and Symbiodinium performance characterised by maximum photochemical efficiency, chla content, and cell density. Acidification alone resulted in 58% more asexual reproduction of symbiotic polyps than aposymbiotic polyps (and enhanced Symbiodinium cell density) suggesting Cassiopea sp. fitness was enhanced by CO2 -stimulated Symbiodinium photosynthetic activity. Indeed, greater CO2 drawdown (elevated pH) was observed within host tissues of symbiotic polyps under acidification regardless of O2 conditions. Hypoxia alone produced 22% fewer polyps than ambient conditions regardless of acidification and symbiont status, suggesting Symbiodinium photosynthetic activity did not mitigate its effects. Combined hypoxia and acidification, however, produced similar numbers of symbiotic polyps compared with aposymbiotic kept under ambient conditions, demonstrating that the presence of Symbiodinium was key for mitigating the combined effects of hypoxia and acidification on asexual reproduction. We hypothesise that this mitigation occurred because of reduced photorespiration under elevated CO2 conditions where increased net O2 production ameliorates oxygen debt. We show that Symbiodinium play an important role in facilitating enhanced fitness of Cassiopea sp. polyps, and perhaps also other non-calcifying cnidarian hosts, to the ubiquitous effects of ocean acidification. Importantly we highlight that symbiotic, non-calcifying cnidarians may be particularly advantaged in productive coastal waters that are subject to simultaneous hypoxia and acidification. This article is protected by copyright. All rights reserved.",
    "keywords": "biological-response, cnidaria, communitymf, laboratory, mortality, multiple-factors, ocean-acidification, oxygen, photosynthesis, physiology, protists, reproduction, respiration, south-pacific",
    "name": "Symbiodinium mitigate the combined effects of hypoxia and acidification on a non-calcifying cnidarian",
    "url": "https://pacificdata.org/data/dataset/kleinsymbiodinium-mitigate-the-combined-effects-of-hypoxia-and-acidification-on-a-non-calcifyin"
}