{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/papua-new-guinea-sissano-bathymetry-chart-1-50-000-2",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((139.20137452543452 -14.748448665973001, 139.20137452543452 2.5923770264788, 162.80337908773708 2.5923770264788, 162.80337908773708 -14.748448665973001, 139.20137452543452 -14.748448665973001))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "High-resolution swath mapping, using multibeam echo sounder was used to delineate the seabed morphology around Sissano.The resultant data was used to produce bathymetry charts and the Sissano Bathymetry chart is available for download from its appropriate link under Distribution Info. This work was initiated by the Pacific Islands Applied Geoscience Commission (SOPAC) and the European Union (EU) Reducing Vulnerability of Pacific ACP States Project.The objective of the survey was to investigate the seabed and provide information about water depths in the coastal areas using a Multibeam echosounder (MBES).\n\nBathymetry maps/ charts should provide information about water depths around the islands. These new bathymetric maps should also give a descriptive picture of the ocean bottom terrain, vividly revealing the size, shape and distribution of underwater features. They can serve as the basic tool for scientific, engineering, marine geophysical and environmental studies, as well as marine and coastal resource management.SUMMARY OF SEABED AROUND SISSANOSissano is located approximately 142.07 degrees East and 2.016 degrees South, of the Northern end of Papua New Guinea.The sea floor offshore Sissano is quite featureless except for the two canyons. For around 10 km offshore the seafloor stays almost flat with an average slope angle of around 3o (Figure13). The water depth within this area is around 100 m. A canyon originates at approximately 3km to the north of Yalingi River, in water depths of around 200 m. This canyon runs northeast for approximately 3 km and then trends in the north northeast direction. Numerous slump features are visible on either side of the canyon, with few small seamounts on the edge of the canyon which have partly succumbed to the slumping. A second much smaller canyon was mapped at about 6 km to the north of Raihu River. This canyon originates in about 100 m water depth, runs approximately about 2 km northeast, then trends north and levels off in about 700 m water depth. Few smaller canyons are seen to thewest of this canyon.",
    "keywords": "bathymetry, eez, multibeam-echo-sounder-survey, papua-new-guinea, sissano",
    "name": "Papua New Guinea - Sissano Bathymetry Chart 1 : 50 000 #2",
    "url": "https://pacificdata.org/data/dataset/papua-new-guinea-sissano-bathymetry-chart-1-50-000-2"
}