{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/andersson2009net-loss-of-caco3-from-a-subtropical-calcifying-community-due-to-seawater-acidific",
    "@type": "Dataset",
    "description": "Acidification of seawater owing to oceanic uptake of atmospheric CO2 originating from human activities such as burning of fossil fuels and land-use changes has raised serious concerns regarding its adverse effects on corals and calcifying communities. Here we demonstrate a net loss of calcium carbonate (CaCO3) material as a result of decreased calcification and increased carbonate dissolution from replicated subtropical coral reef communities (n=3) incubated in continuous-flow mesocosms subject to future seawater conditions. The calcifying community was dominated by the coral Montipora capitata. Daily average community calcification or Net Ecosystem Calcification (NEC=CaCO3 production – dissolution) was positive at 3.3 mmol CaCO3 m−2 h−1 under ambient seawater pCO2 conditions as opposed to negative at −0.04 mmol CaCO3 m−2 h−1 under seawater conditions of double the ambient pCO2. These experimental results provide support for the conclusion that some net calcifying communities could become subject to net dissolution in response to anthropogenic ocean acidification within this century. Nevertheless, individual corals remained healthy, actively calcified (albeit slower than at present rates), and deposited significant amounts of CaCO3 under the prevailing experimental seawater conditions of elevated pCO2.  ",
    "keywords": "101594pangaea727545, biological-response, brcommunity, calcification, corals, dissolution, field, mesocosms, north-pacific, oaiccdb, ocean-acidification",
    "name": "Net loss of CaCO3 from a subtropical calcifying community due to seawater acidification: mesocosm-scale experimental evidence",
    "url": "https://pacificdata.org/data/dataset/andersson2009net-loss-of-caco3-from-a-subtropical-calcifying-community-due-to-seawater-acidific"
}