{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/lantz2017calcium-carbonate-caco3-sediment-dissolution-under-elevated-concentrations-of-carbon-d",
    "@type": "Dataset",
    "description": "Ocean acidification (OA), attributed to the sequestration of atmospheric carbon dioxide (CO2) into the surface ocean, and coastal eutrophication, attributed in part to land-use change and terrestrial runoff of fertilizers, have received recent attention in an experimental framework examining the effects of each on coral reef net ecosystem calcification (Gnet). However, OA and eutrophication in conjunction have yet to receive attention from the perspective of coral reef sediment dissolution. To address this omission, CO2 and nitrate (NO3−) addition experiments were performed in Mo'orea, French Polynesia. Incubation chambers were used to measure sediment Gnet during the day and night under three different [NO3−] (0, 9.8, and 19.7 $μ$M) that were nested within four separate constructed coral reef communities maintained at different PCO2 levels (417, 721, 1030, and 1333 $μ$atm, respectively). PCO2 negatively affected sediment Gnet during the day and night, resulting in a shift to diel net dissolution at a PCO2 of 1030 $μ$atm. Elevated NO3− alone, and the combination of NO3− and PCO2, both negatively affected sediment Gnet at night. However, the response of Gnet to NO3− was less clear during the day, where diurnal sediment Gnet was enhanced under the combined treatment of elevated NO3− and PCO2, resulting in no net effect of NO3− on sediment Gnet on diel timescales. Overall, these results show that ocean acidification represents a greater threat to the balance of calcification and dissolution in Mo'orea's back reef sediment communities than the potential impact of NO3− enrichment on relatively short timescales.",
    "keywords": "101594pangaea880536, biological-response, brcommunity, calcification, corals, dissolution, laboratory, multiple-factors, nutrients, oaiccdb, ocean-acidification, sediment, south-pacific",
    "name": "Calcium carbonate (CaCO3) sediment dissolution under elevated concentrations of carbon dioxide (CO2) and nitrate (NO3−)",
    "url": "https://pacificdata.org/data/dataset/lantz2017calcium-carbonate-caco3-sediment-dissolution-under-elevated-concentrations-of-carbon-d"
}