{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/richards2018bchanges-in-water-quality-following-opening-and-closure-of-a-bar-built-estuary-pesc",
    "@type": "Dataset",
    "description": "Bar-built estuaries are coastal environments characterized by the partial closure of the estuary's mouth with a sandbar barrier for extended periods (closed state). Through natural events (rainfall) or anthropogenic influences, the sandbar is breached, reopening the estuary to the ocean. The transition from closed to open state often leads to extensive physical and chemical changes in the estuarine conditions, as water mixing and sediment resuspension are increased, which could result in the oxidation of sediment acid-volatile sulfides (AVS). We followed monthly changes in water's and sediment geochemical characteristics at thirty-two sites spanning the Pescadero Estuary over a one-year period. We showed that the transition from closed to open state leads to significant decreases in aqueous pH to circumneutral values and significant increases in aqueous hydrogen sulfide and iron concentrations to 10.6 $μ$M and 59.1 $μ$M, respectively, due to sediment AVS oxidation following sediment resuspension. Aqueous hydrogen sulfide concentrations observed in both closed and open states were significantly higher than the recommended thresholds for aquatic life. Moreover, mildly acidic water conditions in the open state were lower than the recommended limits for aquatic life. Our spatial analysis further highlighted that some parts of the estuary were more vulnerable to decreased water quality. Indeed, high sediment AVS contents (19–24 mmol kg− 1) were observed year-round at the River Confluence and Butano Creek regions, which implies a high potential for severe water acidification and metal release when the estuary transitions from closed to open state.",
    "keywords": "chemistry, field, north-pacific, ocean-acidification",
    "name": "Changes in water quality following opening and closure of a bar-built estuary (Pescadero, California)",
    "url": "https://pacificdata.org/data/dataset/richards2018bchanges-in-water-quality-following-opening-and-closure-of-a-bar-built-estuary-pesc"
}