{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/yoshimura2010bimpacts-of-elevated-co2-on-organic-carbon-dynamics-in-nutrient-depleted-okhotsk-s",
    "@type": "Dataset",
    "description": "Increasing CO2 in seawater (i.e. ocean acidification) may have various and potentially adverse effects on phytoplankton dynamics and hence the organic carbon dynamics. We conducted a CO2 manipulation experiment in the Sea of Okhotsk in summer 2006 to investigate the response of the organic carbon dynamics. During the 14-day incubation of nutrient depleted and 200 $μ$atm in situ pCO2 surface water with a natural plankton assemblage under 150, 280, 480, and 590 $μ$atm pCO2, the amount of net dissolved organic carbon accumulation was significantly lower at N480 $μ$atm pCO2 than at 150 $μ$atm pCO2, while differences in net particulate organic carbon accumulation between the treatments were small and did not show a clear relationship with the pCO2. This is the first report to show a decreased net organic carbon production of natural plankton community under elevated pCO2. Phytoplankton pigment analysis suggests that the relative contribution of fucoxanthin-containing phytoplankton such as diatoms to the phytoplankton biomass was lower at N 280 $μ$atm pCO2 than at 150 $μ$atm pCO2. Different pCO2 conditions may alter the organic carbond ynamics through changes in plankton processes. We conclude that the continuing increase in atmospheric CO2 in a time scale from the last half century to the end of this century has potential to affect the carbon cycle in nutrient depleted subpolar surface waters.",
    "keywords": "biogeochemistry, biological-response, brcommunity, community-composition, field, north-pacific, ocean-acidification, otherprocess, primary-production",
    "name": "Impacts of elevated CO2 on organic carbon dynamics in nutrient depleted Okhotsk Sea surface waters",
    "url": "https://pacificdata.org/data/dataset/yoshimura2010bimpacts-of-elevated-co2-on-organic-carbon-dynamics-in-nutrient-depleted-okhotsk-s"
}