{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/managing-multifunctional-landscapes-local-insights-from-a-pacific-island-country-context",
    "@type": "Dataset",
    "description": "Across Pacific Island Countries, projects and policies are incorporating objectives related to managing landscape multifunctionality to sustain flows of multiple, valued ecosystem services. Strategies to manage natural resources are often not effective, or do not have intended outcomes, if they do not account for local contexts and the varied needs and constraints of stakeholders who rely upon natural resources for their livelihoods. Through fieldwork in Ba, Fiji, local insights were generated concerning the institutional, geographic, and socio-economic factors which determine and challenge i) different stakeholders' ability to access landscape resources, and ii) stakeholders' capacities to benefit from ecosystem services. The following insights were generated from this research which are important for guiding management of landscape multifunctionality. In Ba, hierarchical governance systems present barriers to effective management of landscape multifunctionality, and projects or policies with aims to manage landscapes should establish context appropriate multi-scale governance. Such governance systems should facilitate communication and interaction between different stakeholders, build upon community knowledge, and support communities as key actors in landscape management. Consideration of the spatial footprint of landscape resources, stakeholders' different physical and financial capacities, and the institutional structures that mediate access to resources should be central to landscape management and planning. Various climatic stressors affect flows of ecosystem services from the Ba landscape and people's capacity to access landscape resources; therefore, it is important that management of landscapes also builds resilience to climate stressors.",
    "keywords": "landscapes, livelihoods",
    "name": "Managing multifunctional landscapes: Local insights from a Pacific Island Country context",
    "url": "https://pacificdata.org/data/dataset/managing-multifunctional-landscapes-local-insights-from-a-pacific-island-country-context"
}