{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-papuan-perspectives-on-family-planning-fertility-and-birth-control",
    "@type": "Dataset",
    "description": "Papuan perspectives on family planning have historically emphasised political concerns that reflect the tensions between the Indonesian state and indigenous rights – Papuans have questioned both the need for them to limit their population size and the propriety of the state to intervene in their reproductive matters. Family planning in Indonesia is said to have stagnated, and rates of contraceptive use in Tanah Papua (the western half of the island of New Guinea, currently comprising the Indonesian provinces of Papua and West Papua) are considerably lower than the Indonesian average. \n\nA revived family planning agenda appears imminent, spurred on by new global commitments such as the Family Planning 2020 campaign and increased funding from international organisations. This paper draws on ethnographic research conducted in two sites in Tanah Papua – Manokwari, a coastal city, and Wamena, a highlands hub – to explore how Papuans, particularly youth, are likely to react to family planning.\n\n By discussing political, cultural, gendered, and religious facets of family planning, this paper corrects the notion that “access” to family planning in Papua can be primarily understood in terms of geography and infrastructure, and points to other factors that may shape Papuans’ uptake of family planning. The paper reveals that while some of Papuans’ political concerns have shifted, there remain important unanswered questions and opportunities for dialogue that define the ideological space of the family planning revival in Tanah Papua.",
    "keywords": "Health, data, enhancing-agency, pacific-women, short-paper, social-norms",
    "name": "Papuan Perspectives on Family Planning, Fertility and Birth Control",
    "url": "https://pacificdata.org/data/dataset/pwl-papuan-perspectives-on-family-planning-fertility-and-birth-control"
}