{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-exploring-multidimensional-poverty-in-fiji-findings-from-a-study-using-the-individual-deprivatio",
    "@type": "Dataset",
    "description": "Poverty data in Fiji is derived from household income and expenditure data, collected via periodic Household Income and Expenditure Surveys. Given gender inequality within households can be significant, assessing individual poverty by using household data and then assuming all household members have the same access to resources and opportunities is problematic. Household-level measurement also means accurate disaggregation of data is impossible. This makes the work of policy makers and advocates harder, masking differences rather than revealing them so they can be addressed. Individual-level measurement is essential to fully understand poverty and inequality, and the relationship between gender and poverty. The Individual Deprivation Measure (IDM) is a new, gender-sensitive and multidimensional measure of poverty. The measure assesses deprivation at the individual level, in relation to 15 key dimensions of life, making it possible to see who is poor, in what way and to what extent. In 2014, the Australian Government funded the first IDM study (beyond the initial proof of concept trial in the Philippines), to explore what additional insights into deprivation in Fiji could be gained by individual-level, gender-sensitive poverty measurement. This work was undertaken by the IWDA, working with the Fiji Bureau of Statistics. The IDM Fiji study confirmed the measure’s potential to reveal gender differences within the household: \n\n- 91% of women reported exposure to fumes related to cooking and heating, compared with 65% of men. \n\n- Women on average were exposed to 1 hour and 45 minutes per day of fumes related to cooking and heating, compared to an average of 24 minutes per day for men. \n\n- More women than men suffered health problems linked to unclean cooking and heating fuel (25% compared with 12%). Of those who suffered health problems, women were more likely to suffer more severe consequences. These findings reflect not just household variables such as location/type of kitchen and fuel used, but also the implications of a gendered and unequal distribution of household responsibilities, with women having primary responsibilities for domestic work. \n\n- Women were more likely than men to be extremely deprived and very deprived in Voice (the ability to raise concerns and effect change in their community). Men were twice as likely to be not deprived at all in this dimension. The gender difference in Voice was largest in urban areas.\n\n- Nearly half the men in the sample (48%) reported full control over\npersonal decisions, compared to only 25% of women. Women\nwere more likely than men to report no control over personal\ndecisions (5% compared with 1.4%).",
    "keywords": "Education, Health, climate-change-and-environment, data, development-programming, economic-empowerment, ending-violence-against-women, land-sea-and-livelihoods, pacific-women, research-report, social-norms",
    "name": "Exploring Multidimensional Poverty in Fiji: Findings from a Study Using the Individual Deprivation Measure",
    "url": "https://pacificdata.org/data/dataset/pwl-exploring-multidimensional-poverty-in-fiji-findings-from-a-study-using-the-individual-deprivatio"
}