{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/agu-lulc",
    "@type": "Dataset",
    "description": "Communities in Fiji rely on provisioning services from landscape resources such as agricultural and forestry-related production, and climate regulation determined by the mix of landscape resources across space. Accurate mapping and monitoring of patterns of land use and land cover (LULC) over time at scales relevant to livelihood processes is important for informing landscape management, land use policies, and climate-smart sustainable development. A methodology developed collaboratively with landscape stakeholders to produce an inter-annual LULC map that addresses natural resource, agricultural, and forestry management use cases is presented here. Key requirements identified by stakeholders were that the LULC methodology was robust, relatively easy to reproduce, and could be applied to other Fijian landscapes with different dynamics. Using publicly available remotely sensed data and geospatial tools, we applied the LULC methodology for two locations in the Ba Catchment, Fiji. Field orientation and key validation data were collected using the QField open-source mobile GIS, and labelled training and accuracy assessment data were collected in Google Earth. Annual median multispectral surface reflectance and seasonal NDVI-based phenology metrics derived from Sentinel-2, and topographic variation from SRTM DEM provided the best discrimination between vegetation classes across the catchment from low-lying coastal areas to the highlands (> 1000 m ASL). A random forest model was trained and validated in Google Earth Engine to produce an inter-annual LULC map with a 10m spatial resolution. An important outcome from our work was the transfer of skills and building of local stakeholder capacity to continue to update the LULC map, and to expand the map to include other communities, catchments and forestry areas across Fiji. This capacity building included iterative stakeholder consultation, co-development of online training materials, workshops, and collaborative fieldwork.",
    "keywords": "land cover, land use, remote sensing",
    "name": "A Dynamic, Cloud-based LULC Mapping Methodology Using Sentinel-2",
    "url": "https://pacificdata.org/data/dataset/agu-lulc"
}