{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-witchcraft-and-sorcery-related-killings-in-melanesia-the-legal-issues",
    "@type": "Dataset",
    "description": "This short paper identifies four central insights from a legal positive perspective into killings related to sorcery and witchcraft accusations: \n\n- The belief in sorcery and witchcraft is a significant cause of fear and insecurity in Melanesia, as most deaths, sickness and other misfortunes are attributed to the malevolent powers of sorcerers and witches, meaning that people are always on guard against such attacks. \n\n- There are two very different groups of victims in this area, but they are often not clearly distinguished, resulting in considerable potential for talking at cross-purposes. The first group of victims are those people who are believed to have been killed or made sick or otherwise negatively affected by the actions of a witch or a sorcerer. The second group of victims are those who are accused of being witches or sorcerers and are consequently attacked or expelled from their community. \n\n- The current state legal responses to the violence and conflict associated with sorcery and witchcraft-related beliefs and practices in Melanesia are ineffectual. \n\n- Simplistic solutions such as repealing legislation and imposing draconian sentences will not help, and may even make matters worse. What is required instead is a multi-stranded, pluralist approach that engages state, local and church responses creatively and strategically.",
    "keywords": "ending-violence-against-women, pacific-women, short-paper, social-norms, violence-development-programming",
    "name": "Witchcraft and Sorcery Related Killings in Melanesia: The Legal Issues",
    "url": "https://pacificdata.org/data/dataset/pwl-witchcraft-and-sorcery-related-killings-in-melanesia-the-legal-issues"
}