{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/clark2017maximum-thermal-limits-of-coral-reef-damselfishes-are-size-dependent-and-resilient-to-",
    "@type": "Dataset",
    "description": "Theoretical models predict that ocean acidification, caused by increased dissolved CO2, will reduce the maximum thermal limits of fishes, thereby increasing their vulnerability to rising ocean temperatures and transient heatwaves. Here, we tested this prediction in three species of damselfishes on the Great Barrier Reef, Australia. Maximum thermal limits were quantified using critical thermal maxima (CTmax) tests following acclimation to either present-day or end-of-century levels of CO2 for coral reef environments (∼500 or ∼1000 µatm, respectively). While species differed significantly in their thermal limits, whereby Dischistodus perspicillatus exhibited greater CTmax (37.88±0.03°C; N=47) than Dascyllus aruanus (37.68±0.02°C; N=85) and Acanthochromis polyacanthus (36.58±0.02°C; N=63), end-of-century CO2 had no effect (D. aruanus) or a slightly positive effect (increase in CTmax of 0.16°C in D. perspicillatus and 0.21°C in A. polyacanthus) on CTmax Contrary to expectations, early-stage juveniles were equally as resilient to CO2 as larger conspecifics, and CTmax was higher at smaller body sizes in two species. These findings suggest that ocean acidification will not impair the maximum thermal limits of reef fishes, and they highlight the critical role of experimental biology in testing predictions of theoretical models forecasting the consequences of environmental change.",
    "keywords": "biological-response, fish, laboratory, ocean-acidification, physiology, south-pacific",
    "name": "Maximum thermal limits of coral reef damselfishes are size dependent and resilient to near-future ocean acidification",
    "url": "https://pacificdata.org/data/dataset/clark2017maximum-thermal-limits-of-coral-reef-damselfishes-are-size-dependent-and-resilient-to-"
}