{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/national-education-plan-2015-2019",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((139.20137452543452 -14.748448665973001, 139.20137452543452 2.5923770264788, 162.80337908773708 2.5923770264788, 162.80337908773708 -14.748448665973001, 139.20137452543452 -14.748448665973001))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "The NEP 2015–19 is designed to give everyone in Papua New Guinea, regardless of their ability, gender or socio - economic background, an opportunity to be educated and to transform their lives, using an holistic, inclusive and integrated approach.\r\n\r\nThere have been many changes in the country’s education system and policies since independence 40 years ago. This plan is designed to build on past successes and experience and begin a system providing 13 years Universal Education. High-quality, relevant education and training for all.\r\n\r\nThis plan is different to previous plans in a number of ways. Firstly it outlines all interventions needed that together will achieve Universal Education in PNG. This National Education Plan intends to have PNG leading the way by taking the bold step towards13 years of Universal Education for every student in the country. Universal Education can be achieved in our country with a coordinated approach supported by strong political drive, quality leadership and a relentlessness to achieve its intent.\r\n\r\nContained in this plan is the outline of the radical and comprehensive overhaul of many aspects of the education system proposed to give all children the opportunity to enter school at the age of six and receive a relevant education for 13 years, until they reach Grade 12 or the equivalent (18 years of age).\r\n\r\nThe NEP 2015-19 is based on a logic framework, so that the plan itself can be monitored and progressed measured. Every province will play a critical role in implementing the plan and using the same framework, they can compare their progress at provincial and national level. This approach means DoE is transparent in its approach and accountable to achieve its targets. ",
    "keywords": "education, education-strategic-plans, policy",
    "name": "National Education Plan 2015-2019",
    "url": "https://pacificdata.org/data/dataset/national-education-plan-2015-2019"
}