{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/kiribati-territorial-sea-12-nautical-miles-phoenix-islands-_edit_october",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((182.11616944476415 -7.784149854132352, 182.11616944476415 0.585877777537689, 192.6264361112376 0.585877777537689, 192.6264361112376 -7.784149854132352, 182.11616944476415 -7.784149854132352))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "The Marine Zones (Declaration) Act 2011 repeals the Marine Zones (Declaration) Act 1983. It states that the territorial sea of Kiribati comprises those waters having, as their inner limits, the baseline of Kiribati and, as their outer limits, a line measured seaward from that baseline, every point of which is at a distance of twelve (12) nautical miles from the nearest point of the baseline.  \r\nThe Territorial Sea Outer Limits Regulations 2014 in accordance with the MZA 2011 specifies the geographical coordinates that defines the boundaries of Cook Islands territorial sea are are referenced to the World Geodetic System 1984 (WGS 84). The Regulations also contains charts for general illustrations of the territorial sea lines. \r\nKiribati has sovereignty beyond its land territory and internal waters over the territorial sea, and to the airspace above and the seabed and subsoil beneath the territorial sea. Ships of all States shall enjoy the right of innocent passage in accordance with international law in the territorial sea of Kiribati. \r\nhttp://www.un.org/Depts/los/LEGISLATIONANDTREATIES/PDFFILES/KIR_2011_Act.pdf\r\nhttps://www.un.org/Depts//los/LEGISLATIONANDTREATIES/PDFFILES/KIR_2014_ts_outer_limits_regulations.pdf\r\n\r\n\r\n",
    "keywords": "12N",
    "name": "Kiribati Territorial Sea - 12 Nautical Miles (Phoenix Islands)",
    "url": "https://pacificdata.org/data/dataset/kiribati-territorial-sea-12-nautical-miles-phoenix-islands-_edit_october"
}