{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/sui2016dcombined-effects-of-short-term-exposure-to-elevated-co2-and-decreased-o2-on-the-physiol",
    "@type": "Dataset",
    "description": "Hypoxia and ocean acidification are two consequences of anthropogenic activities. These global trends occur on top of natural variability. In environments such as estuarine areas, short-term acute pH and O2 fluctuations are occurring simultaneously. The present study tested the combined effects of short-term seawater acidification and hypoxia on the physiology and energy budget of the thick shell mussel Mytilus coruscus. Mussels were exposed for 72 h to six combined treatments with three pH levels (8.1, 7.7 and 7.3) and two dissolved oxygen (DO) levels (2 mg L−1, 6 mg L−1). Clearance rate (CR), food absorption efficiency (AE), respiration rate (RR), ammonium excretion rate (ER), O:N ratio and scope for growth (SFG) were significantly reduced, and faecal organic dry weight ratio (E) was significantly increased at low DO. Low pH did not lead to a reduced SFG. Interactive effects of pH and DO were observed for CR, E and RR. Principal component analysis (PCA) revealed positive relationships among most physiological indicators, especially between SFG and CR under normal DO conditions. These results demonstrate that Mytilus coruscus was sensitive to short-term (72 h) exposure to decreased O2 especially if combined with decreased pH levels. In conclusion, the short-term oxygen and pH variation significantly induced physiological changes of mussels with some interactive effects.",
    "keywords": "biological-response, laboratory, mollusks, multiple-factors, north-pacific, ocean-acidification, oxygen, performance, physiology, respiration",
    "name": "Combined effects of short-term exposure to elevated CO2 and decreased O2 on the physiology and energy budget of the thick shell mussel Mytilus coruscus",
    "url": "https://pacificdata.org/data/dataset/sui2016dcombined-effects-of-short-term-exposure-to-elevated-co2-and-decreased-o2-on-the-physiol"
}