{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/wei2015decadal-variability-in-seawater-ph-in-the-west-pacific-evidence-from-coral-b-11-records",
    "@type": "Dataset",
    "description": "Long-term seawater pH records are essential for evaluating the rates of ocean acidification (OA) driven by anthropogenic emissions. Widespread, natural decadal variability in seawater pH superimposes on the long-term anthropogenic variations, likely influencing the OA rates estimated from the pH records. Here, we report a record of annual seawater pH estimated using the $δ$11B proxy over the past 159 years reconstructed from a Porites coral collected to the east of Hainan Island in the northern South China Sea (SCS). By coupling this time series with previously reported long-term seawater pH records in the West Pacific, the decadal variability in seawater pH records and its possible driving mechanisms were investigated. The results indicate that large decadal variability in seawater pH has occurred off eastern Hainan Island over the past 159 years, in agreement with previous records. The Qiongdong upwelling system, which controls nutrient supplies, regulates surface water productivity, and is driven by the East Asian summer monsoon, is the primary control of this decadal variability, while terrestrial inputs appear not influence significantly. Meanwhile the impacts of the Pacific Decadal Oscillation (PDO) and the El Nino and Southern Oscillation (ENSO) systems on seawater pH off eastern Hainan Island is likely limited. In contrast, the PDO is the main factor to influence the decadal seawater pH variability offshore the East Australia, while the mechanism controlling the decadal seawater pH variability in Guam is not clear yet. Meanwhile, The rate of decrease in seawater pH estimated from coral records are significantly different in different regions and over different time spans, which may reflect a combination of natural decadal variability in seawater pH and long-term variations. Therefore, understanding the mechanisms driving natural variability in seawater pH is important for improving estimates of ocean acidification rates driven by anthropogenic emissions. This article is protected by copyright. All rights reserved.",
    "keywords": "chemistry, field, north-pacific, ocean-acidification, paleo",
    "name": "Decadal variability in seawater pH in the West Pacific: Evidence from coral $δ$ B-11 records",
    "url": "https://pacificdata.org/data/dataset/wei2015decadal-variability-in-seawater-ph-in-the-west-pacific-evidence-from-coral-b-11-records"
}