{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/wang2015fan-in-situ-sensor-technology-for-simultaneous-spectrophotometric-measurements-of-seawa",
    "@type": "Dataset",
    "description": "A new, in-situ sensing system, Channelized Optical System (CHANOS), was recently developed to make high-resolution, simultaneous measurements of total dissolved inorganic carbon (DIC) and pH in seawater. Measurements made by this single, compact sensor can fully characterize the marine carbonate system. The system has a modular design to accommodate two independent, but similar measurement channels for DIC and pH. Both are based on spectrophotometric detection of hydrogen ion concentrations. The pH channel uses a flow-through, sample-indicator mixing design to achieve near instantaneous measurements. The DIC channel adapts a recently developed spectrophotometric method to achieve flow-through CO2 equilibration between an acidified sample and an indicator solution with a response time of only ̃90s. During laboratory and in-situ testing, CHANOS achieved a precision of ±0.0010 and ±2.5 µmol kg-1 for pH and DIC, respectively. In-situ comparison tests indicated that the accuracies of the pH and DIC channels over a three-week time-series deployment were ±0.0024 and ±4.1 µmol kg-1, respectively. This study demonstrates that CHANOS can make in-situ, climatology-quality measurements by measuring two desirable CO2 parameters, and is capable of resolving the CO2 system in dynamic marine environments.",
    "keywords": "chemistry, field, methods, north-pacific, ocean-acidification",
    "name": "An in-situ sensor technology for simultaneous spectrophotometric measurements of seawater total dissolved inorganic carbon and pH",
    "url": "https://pacificdata.org/data/dataset/wang2015fan-in-situ-sensor-technology-for-simultaneous-spectrophotometric-measurements-of-seawa"
}