{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/kiribati-marakei-island-1984-aerial-photographs-2",
    "@type": "Dataset",
    "description": "A collection of the 1984 Historical Aerial Photographs of Kiribati, Marakei Island. All 26 Photographs have not been rectified but uploaded individually and referenced according to their frame numbers. This collection does not represent a complete coverage of the island. The images were mosaicked using the Hypercube software for preview purpose only. Areas covered in the images include the land area, Inner lagoon, coastal zone, areas surrounding the fringing reef and areas towards the deep ocean .Extent of coverage of individual images, are illustrated in the accompanying PDF documents and a summary attribute information of each photograph including identity and general information about the flight and the photography is also available for download, upon request to the secretariat. These images were issued to the Secretariat from the Kiribati Government.The SOPAC Secretariats aerial photographs is a unique detailed record of the physical landscapes from the different member Pacific Island countries. These photographs can be used for diverse purposes by government agencies, surveyors, planners, consulting scientists, engineers and other individuals. These purposes include determination of past land uses, marine mapping, coral reef habitat mapping ( change detection), restoration of natural areas, assessing historical changes , and a variety of other applicationsMarakei is a small atoll in the Northern Gilbert Islands. The atoll covers an area of 13.5km2. The two narrow channels , which are accessible at low tide , are called Bareto Pass and Reweta Pass. The Island is located 2dg 00' North 173dg 16'East.",
    "keywords": "aerial-photograh, bareto-pass, digital-images, historical-photos, kiribati, mapping, marakei, reweta-pass",
    "name": "Kiribati, Marakei Island, 1984, Aerial Photographs #2",
    "url": "https://pacificdata.org/data/dataset/kiribati-marakei-island-1984-aerial-photographs-2"
}