{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/sundin2017long-term-exposure-to-elevated-carbon-dioxide-does-not-alter-activity-levels-of-a-cor",
    "@type": "Dataset",
    "description": "ABSTRACT:  Levels of dissolved carbon dioxide (CO2) projected to occur in the world's oceans in the near future have been reported to increase swimming activity and impair predator recognition in coral reef fishes. These behavioral alterations would be expected to have dramatic effects on survival and community dynamics in marine ecosystems in the future. To investigate the universality and replicability of these observations, we used juvenile spiny chromis damselfish (Acanthochromis polyacanthus) to examine the effects of long-term CO2 exposure on routine activity and the behavioral response to the chemical cues of a predator (Cephalopholis urodeta). Commencing at ̃3-20 days post-hatch, juvenile damselfish were exposed to present-day CO2 levels (\\̃420 $μ$atm) or to levels forecasted for the year 2100 (\\~̃1000 $μ$atm) for 3 months of their development. Thereafter, we assessed routine activity before and after injections of seawater (sham injection, control) or seawater-containing predator chemical cues. There was no effect of CO2 treatment on routine activity levels before or after the injections. All fish decreased their swimming activity following the predator cue injection but not following the sham injection, regardless of CO2 treatment. Our results corroborate findings from a growing number of studies reporting limited or no behavioral responses of fishes to elevated CO2. SIGNIFICANCE STATEMENT:  Alarmingly, it has been reported that levels of dissolved carbon dioxide (CO2) forecasted for the year 2100 cause coral reef fishes to be attracted to the chemical cues of predators. However, most studies have exposed the fish to CO2 for very short periods before behavioral testing. Using long-term acclimation to elevated CO2 and automated tracking software, we found that fish exposed to elevated CO2 showed the same behavioral patterns as control fish exposed to present-day CO2 levels. Specifically, activity levels were the same between groups, and fish acclimated to elevated CO2 decreased their swimming activity to the same degree as control fish when presented with cues from a predator. These findings indicate that behavioral impacts of elevated CO2 levels are not universal in coral reef fishes.",
    "keywords": "biological-response, fish, laboratory, ocean-acidification, performance, south-pacific",
    "name": "Long-term exposure to elevated carbon dioxide does not alter activity levels of a coral reef fish in response to predator chemical cues",
    "url": "https://pacificdata.org/data/dataset/sundin2017long-term-exposure-to-elevated-carbon-dioxide-does-not-alter-activity-levels-of-a-cor"
}