{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/arnold2014impacts-of-groundwater-discharge-at-myora-springs-north-stradbroke-island-australia-o",
    "@type": "Dataset",
    "description": "Myora Springs is one of many groundwater discharge sites on North Stradbroke Island (Queensland, Australia). Here spring waters emerge from wetland forests to join Moreton Bay, mixing with seawater over seagrass meadows dominated by eelgrass, Zostera muelleri. We sought to determine how low pH / high CO2 conditions near the spring affect these plants and their interactions with the black rabbitfish (Siganus fuscescens), a co-occurring grazer. In paired-choice feeding trials S. fuscescens preferentially consumed Z. muelleri shoots collected nearest to Myora Springs. Proximity to the spring did not significantly alter the carbon and nitrogen contents of seagrass tissues but did result in the extraordinary loss of soluble phenolics, including Folin-reactive phenolics, condensed tannins, and phenolic acids by ≥87%. Conversely, seagrass lignin contents were, in this and related experiments, unaffected or increased, suggesting a shift in secondary metabolism away from the production of soluble, but not insoluble, (poly)phenolics. We suggest that groundwater discharge sites such as Myora Springs, and other sites characterized by low pH, are likely to be popular feeding grounds for seagrass grazers seeking to reduce their exposure to soluble phenolics.",
    "keywords": "101594pangaea834082, algae, biogeochemistry, biological-response, fish, laboratory, oaiccdb, ocean-acidification, otherprocess, performance, physiology, south-pacific",
    "name": "Impacts of groundwater discharge at Myora Springs (North Stradbroke Island, Australia) on the phenolic metabolism of eelgrass, Zostera muelleri, and grazing by the juvenile rabbitfish, Siganus fuscescens",
    "url": "https://pacificdata.org/data/dataset/arnold2014impacts-of-groundwater-discharge-at-myora-springs-north-stradbroke-island-australia-o"
}