{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/nowicki2012binteractive-effects-of-elevated-temperature-and-co2-on-foraging-behavior-of-juvenil",
    "@type": "Dataset",
    "description": "Two of the major threats to coral reefs are increasing sea surface temperature and ocean acidification, both of which result from rising concentrations of atmospheric carbon dioxide (CO2). Recent evidence suggests that both increased water temperature and elevated levels of dissolved CO2 can change the behaviors of fishes in ways that reduce individual fitness, however the interacting effects of these variables are unknown. We used a fully factorial experiment to test the independent and interactive effects of temperature (3 levels: 28.5, 30, and 31.5 °C) and pCO2 (3 levels: averaging 420, 530, and 960 $μ$atm) on food consumption and activity level of juvenile anemonefish Amphiprion melanopus (Bleeker 1852). Experimental levels were consistent with current-day ocean conditions and predictions for mid-century and late-century based on atmospheric CO2 projections. Sibling fish were reared for 21 days from the end of their larval phase in each of the nine treatments, at which time behavioral observations were conducted. Food consumption and foraging activity decreased at the highest temperature. In isolation, CO2 level did not significantly affect behavior; however, there was an interaction with temperature. While rearing at high temperature (31.5 °C) and control (420 $μ$atm) or moderate (530 $μ$atm) CO2 resulted in a reduction of food consumption and foraging activity, rearing at high temperature and high CO2 (960 $μ$atm) resulted in an elevation in these behaviors. Maintaining food consumption and foraging activity in high temperature and CO2 conditions may reduce energy efficiency if the thermal optimum for food assimilation and growth has been exceeded. Maintaining foraging effort might increase predation vulnerability. These results suggest that changes in foraging behaviors caused by the interactive effects of increased SST and CO2 could have significant effects on the growth and survival of juvenile reef fishes by late century.  ",
    "keywords": "101594pangaea772705, biological-response, fish, laboratory, multiple-factors, oaiccdb, ocean-acidification, performance, south-pacific, temperature",
    "name": "Interactive effects of elevated temperature and CO2 on foraging behavior of juvenile coral reef fish",
    "url": "https://pacificdata.org/data/dataset/nowicki2012binteractive-effects-of-elevated-temperature-and-co2-on-foraging-behavior-of-juvenil"
}