{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/rossi2017bthe-sounds-of-silence-regime-shifts-impoverish-marine-soundscapes",
    "@type": "Dataset",
    "description": "Context  Regime shifts are well known for driving penetrating ecological change, yet we do not recognise the consequences of these shifts much beyond species diversity and productivity. Sound represents a multidimensional space that carries decision-making information needed for some dispersing species to locate resources and evaluate their quantity and quality.  Objectives  Here we assessed the effect of regime shifts on marine soundscapes, which we propose has the potential function of strengthening the positive or negative feedbacks that mediate ecosystem shifts.  Methods  We tested whether biologically relevant cues are altered by regime shifts in kelp forests and seagrass systems and how specific such shifted soundscapes are to the type of driver; i.e. local pollution (eutrophication) vs. global change (ocean acidification).  Results  Here, we not only provide the first evidence for regime-shifted soundscapes, but also reveal that the modified cues of shifted ecosystems are similar regardless of spatial scale and type of environmental driver. Importantly, biological sounds can act as functional cues for orientation by dispersing larvae, and observed shifts in soundscape loudness may alter this function.  Conclusions  These results open the question as to whether shifted soundscapes provide a functional role in mediating the positive or negative feedbacks that govern the arrival of species associated with driving change or stasis in ecosystem state.",
    "keywords": "algae, biological-response, brcommunity, community-composition, crustaceans, field, mediterranean, ocean-acidification, otherprocess, performance, phanerogams, south-pacific, vents",
    "name": "The sounds of silence: regime shifts impoverish marine soundscapes",
    "url": "https://pacificdata.org/data/dataset/rossi2017bthe-sounds-of-silence-regime-shifts-impoverish-marine-soundscapes"
}