{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-do-no-harm-guidance-materials",
    "@type": "Dataset",
    "description": "Two ‘Do No Harm’ guidance material kits have been developed by a team from the International Women’s Development Agency. The kits draw on key findings from the Do No Harm research project, conducted by the Australian National University in Solomon Islands and Papua New Guinea. \n\nThe Do No Harm research explored the relationship between economic inclusion and empowerment programs, and violence against women. The key lessons learned from the research were that: \n\n- Working with men is necessary.\n\n- There is an existing need for community-based gender transformative programs.\n\n- Women’s economic empowerment programming must adopt a ‘do no harm’ approach. \n\nThe guidance material kits use these lessons to assist program designers and implementers to integrate the elimination of violence against women into women’s economic empowerment programming.\n\nThe ‘Do No Harm: Integrating the Elimination of Violence Against Women into Women’s Economic Empowerment Programs Kit’ draws on the research in both Solomon Islands and Papua New Guinea. The ‘Do No Harm: Integrating the Elimination of Violence Against Women into Savings Clubs Kit’ focuses on the findings from savings clubs in Solomon Islands. \n\nThe kits contain training guidelines and resources, including tools on gender and power analysis, safety mapping, and policies and processes for staff exposed to violence against women.\n\nThe primary audience for both kits are organisations that work at the community level to facilitate women’s economic empowerment. The kits may also be used by civil society organisations, international and national non-government organisations, government agencies and development partners.",
    "keywords": "autonomous-region-of-bougainville, development-programming, economic-empowerment, ending-violence-against-women, land-sea-and-livelihoods, pacific-women, social-norms, toolkit, violence",
    "name": "Do No Harm guidance materials",
    "url": "https://pacificdata.org/data/dataset/pwl-do-no-harm-guidance-materials"
}