{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/hoadley2015bphysiological-response-to-elevated-temperature-and-pco2-varies-across-four-pacific-",
    "@type": "Dataset",
    "description": "The physiological response to individual and combined stressors of elevated temperature and pCO2 were measured over a 24-day period in four Pacific corals and their respective symbionts (Acropora millepora/Symbiodinium C21a, Pocillopora damicornis/Symbiodinium C1c-d-t, Montipora monasteriata/Symbiodinium C15, and Turbinaria reniformis/Symbiodinium trenchii). Multivariate analyses indicated that elevated temperature played a greater role in altering physiological response, with the greatest degree of change occurring within M. monasteriata and T. reniformis. Algal cellular volume, protein, and lipid content all increased for M. monasteriata. Likewise, S. trenchii volume and protein content in T. reniformis also increased with temperature. Despite decreases in maximal photochemical efficiency, few changes in biochemical composition (i.e. lipids, proteins, and carbohydrates) or cellular volume occurred at high temperature in the two thermally sensitive symbionts C21a and C1c-d-t. Intracellular carbonic anhydrase transcript abundance increased with temperature in A. millepora but not in P. damicornis, possibly reflecting differences in host mitigated carbon supply during thermal stress. Importantly, our results show that the host and symbiont response to climate change differs considerably across species and that greater physiological plasticity in response to elevated temperature may be an important strategy distinguishing thermally tolerant vs. thermally sensitive species.",
    "keywords": "biological-response, corals, laboratory, molecular-biology, morphology, multiple-factors, north-pacific, ocean-acidification, photosynthesis, physiology, protists, respiration, temperature",
    "name": "Physiological response to elevated temperature and pCO2 varies across four Pacific coral species: Understanding the unique host+symbiont response",
    "url": "https://pacificdata.org/data/dataset/hoadley2015bphysiological-response-to-elevated-temperature-and-pco2-varies-across-four-pacific-"
}