{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/tatters2018ainteractive-effects-of-temperature-co2-and-nitrogen-source-on-a-coastal-california-",
    "@type": "Dataset",
    "description": "Diatoms are often considered to be a single functional group, yet there is a great deal of morphological, genetic and ecological diversity within the class. How these differences will translate into species-specific responses to rapid changes in the ocean environment resulting from climate change and eutrophication is currently poorly understood. We investigated the response of a natural diatom-dominated assemblage in coastal California waters to interactions between the variables nitrogen source (nitrate and urea), temperature (19 and 23°C) and CO2 (380 and 800 ppm) in a factorial experimental matrix using continuous culture (ecostat) methods. The community included diatoms of the cosmopolitan genera Pseudo-nitzschia and Chaetoceros, as well as Leptocylindrus and Cylindrotheca. Our results demonstrate strong interactive effects of these variables on community composition; notably, nitrogen source alone and nitrogen and CO2 together had a much greater influence on diatom community structure at 23°C compared with 19°C. In addition, warming and acidification interactions significantly increased cellular quotas of the neurotoxin domoic acid produced by Pseudo-nitzschia multiseries. In general, the effects observed for the factors tested differed significantly between the various diatom genera in this assemblage, suggesting potentially divergent responses of some of these ecologically and biogeochemically important phytoplankton taxa to interactions between global-scale and local-scale anthropogenic stressors in a changing ocean.",
    "keywords": "abundance, biological-response, brcommunity, community-composition, laboratory, multiple-factors, north-pacific, nutrients, ocean-acidification, otherprocess, physiology, phytoplankton, temperature",
    "name": "Interactive effects of temperature, CO2 and nitrogen source on a coastal California diatom assemblage",
    "url": "https://pacificdata.org/data/dataset/tatters2018ainteractive-effects-of-temperature-co2-and-nitrogen-source-on-a-coastal-california-"
}