{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://emodnet.ec.europa.eu/geonetwork/srv/eng/catalog.search#/metadata/a519ede941324c8bacbb23f8fbd60f03e3a1e2b4",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((1.35282004937332 33.031885793741, 1.35282004937332 43.1771104698274, 35.1032721811811 43.1771104698274, 35.1032721811811 33.031885793741, 1.35282004937332 33.031885793741))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "Maërl bed occurences (polygons) in the Mediterranean Sea from the dataset Coralligenous and mäerl beds distribution along the Mediterranean coasts - Mediterranean Sensitive Habitats (MEDISEH). \n\nInformation has been derived from three sources: \n1) the Action plan for the conservation of the coralligenous and other calcareous bio-concretions in the Mediterranean Sea by the UNEP-MAP-RAC/SPA (2008) \n2) the report in the State of knowledge of the geographical distribution of the coralligenous and other calcareous bio-concretions in the Mediterranean by UNEP (2009)\n3) projects focussing bioconstructions, their distribution and the driving forces affecting their structure and function\n\nA total of 798 scientific documents have been collected, together with 43 shapefiles, 1492 polygons and 641 data points for coralligenous formations, 47 polygons and 124 data points for maërl, and 39 bathymetry maps within the framework of the MEDISEH project. Even though proving information on absence data for both coralligenous and mäerl can be extremely difficult, an attempt has been made and 584 polygons have been included for coralligenous formations and 935 for maërl data. Detailed information for these two habitats is now available on about 15% of the Mediterranean coastal area.\n\nFraschetti, M. Gristina, M. Salomidi, L. Knittweis, M.L. Pace, E. Punzo, A. Belluscio, G. Scarcella, F. Grati, F. De Leo, L. Rizzo, R. Cattaneo-Vietti, P. Povero, A. Cau, C. Piccinetti, V. Valavanis, C. Martin 2013. Coralligenous and mäerl beds distribution along the Mediterranean coasts Mediterranean Sensitive Habitats (MEDISEH) Final Report, DG MARE Specific Contract SI2.600741.",
    "keywords": [
        "biology",
        "macroalgae",
        "marine",
        "Mediterranean",
        "biota",
        "mediseh",
        "maerl",
        "maërl",
        "coalligenous",
        "outcrop",
        "point",
        "vector",
        "distributions",
        "Habitats and biotopes"
    ],
    "name": "EMODnet Maërl bed occurences (polygons) in the Mediterranean Sea",
    "url": "https://emodnet.ec.europa.eu/geonetwork/srv/eng/catalog.search#/metadata/a519ede941324c8bacbb23f8fbd60f03e3a1e2b4"
}