{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://emodnet.ec.europa.eu/geonetwork/srv/eng/catalog.search#/metadata/7f0022ccde0da012de8b44cf40693f68aa913d63",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((-179.998565673828 -78.5, -179.998565673828 89.8992004394531, 179.989791870117 89.8992004394531, 179.989791870117 -78.5, -179.998565673828 -78.5))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "The dataset represents the division of the world oceans into provinces as defined by Longhurst (1995; 1998; 2006). The division has been based on the prevailing role of physical forcing as a regulator of phytoplankton distribution. The dataset contains the initial static boundaries developed at the Bedford Institute of Oceanography, Canada. Note that the boundaries of these provinces are not fixed in time and space, but are dynamic and move under seasonal and interannual changes in physical forcing. At the first level of reduction, Longhurst recognised four principal biomes: the Polar biome, the Westerlies biome, the Trade winds biome, and the Coastal biome. These four biomes are recognised in every major ocean basin. At the next level of reduction, the ocean basins are divided into provinces, roughly ten for each basin. These regions provide a template for data analysis or for making parameter assignments on a global scale. Please refer to Longhurst's publications when using these shapefiles.",
    "keywords": "world, oceans, ecological, biogeochemical, longhurst, provinces, boundaries, downloadable data, biota, environment, Statistical units",
    "name": "Global Biogeochemical Provinces (Longhurst)",
    "url": "https://emodnet.ec.europa.eu/geonetwork/srv/eng/catalog.search#/metadata/7f0022ccde0da012de8b44cf40693f68aa913d63"
}