{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-thematic-brief-women-peace-and-security-in-the-pacific",
    "@type": "Dataset",
    "description": "This Thematic Brief provides information and analysis about women, peace and security in the Pacific Islands region. The brief has been written for the Support Unit of Pacific Women Shaping Pacific Development (Pacific Women).\nThe following five key messages help explain underlying issues about women, peace and security and why Pacific Women is supporting this work. This includes a need for formal recognition of women’s role in conflict prevention and recovery plus humanitarian crisis response, such as during the COVID-19 pandemic response. These messages reflect the United Nations Security Council endorsed resolution 1325 on women, peace and security in October 2000. The resolution drew on lessons learned on peacekeeping and peacebuilding. Resolution 1325 calls on countries to address the impacts that conflict had on women and girls and advocates for women’s participation in peace and security processes as a critical step towards conflict-resolution.4 The women, peace and security agenda rests on four pillars: prevention, participation, protection, and relief and recovery.\nThe five key messages are:\n1. The skills of women as mediators and decision makers need to be recognised and included in peace negotiations.\n2. Women are often the most affected by conflict violence and increasing securitisation. The presence of armed forces has increased through national COVID-19 responses.\n3. Women are already active in conflict prevention, post-conflict recovery efforts and humanitarian crisis response, such as COVID-19, and this needs to be formally recognised and supported.\n4. The gendered approach to security sector governance needs to be enhanced.\n5. Women’s access to and participation in governance processes must be sustained.",
    "keywords": "ending-violence-against-women, pacific-women, social-norms, thematic-brief",
    "name": "Thematic Brief: Women, peace and security in the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-thematic-brief-women-peace-and-security-in-the-pacific"
}