{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/johnsoncomplex-and-interactive-effects-of-ocean-acidification-and-temperature-on-epilithic-and-",
    "@type": "Dataset",
    "description": "Turf algal assemblages are ubiquitous primary producers on coral reefs, but little is known about the response of this diverse group to ocean acidification (OA) across different temperatures. We tested the hypothesis that CO2 influences the functional response of epilithic and endolithic turf assemblages to increasing temperature. Replicate carbonate plugs covered by turf were collected from the reef and exposed to ambient and high pCO2 (1000 µatm) conditions for 3 weeks. Each pCO2 treatment was replicated across six temperatures (24.0–31.5 °C) that spanned the full seasonal temperature range on a fringing reef in Moorea, French Polynesia, and included one warming treatment (3 °C above daily average temperatures). Temperature and CO2 enrichment had complex, and sometimes interactive, effects on turf metabolism and growth. Photosynthetic and respiration rates were enhanced by increasing temperature, with an interactive effect of CO2 enrichment. Photosynthetic rates were amplified by high CO2 in the warmest temperatures, while the increase in respiration rates with temperature were enhanced under ambient CO2. Epilithic turf growth rates were not affected by temperature, but increased in response to CO2 enrichment. We found that CO2 and temperature interactively affected the endolithic assemblage, with the highest growth rates under CO2 enrichment, but only at the warmest temperatures. These results demonstrate how OA may influence algal physiology and growth across a range of ecologically relevant temperatures, and indicate that the effects of CO2 enrichment on coral-reef turf assemblages can be temperature dependent. The complex effects of CO2 enrichment and temperature across a suite of algal responses illustrates the importance of incorporating multiple stressors into global change experiments.",
    "keywords": "algae, biological-response, growth, laboratory, multiple-factors, ocean-acidification, photosynthesis, respiration, south-pacific, temperature",
    "name": "Complex and interactive effects of ocean acidification and temperature on epilithic and endolithic coral-reef turf algal assemblages",
    "url": "https://pacificdata.org/data/dataset/johnsoncomplex-and-interactive-effects-of-ocean-acidification-and-temperature-on-epilithic-and-"
}