{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/cyronak2013carbon-cycling-hysteresis-in-permeable-carbonate-sands-over-a-diel-cycle-implication",
    "@type": "Dataset",
    "description": "Dissolved inorganic carbon, dissolved oxygen, H+, and alkalinity fluxes from permeable carbonate sediments at Heron Island (Great Barrier Reef) were measured over one diel cycle using benthic chambers designed to induce advective pore-water exchange. A complex hysteretic pattern between carbonate precipitation and dissolution in sands and the aragonite saturation state ($Ømega$Ar) of the overlying chamber water was observed throughout the incubations. During the day, precipitation followed a hysteretic pattern based on the incidence of photosynthetically active radiation with lower precipitation rates in the morning than in the afternoon. The observed diel hysteresis seems to reflect a complex interaction between photosynthesis and respiration rather than $Ømega$Ar of the overlying water as the main driver of carbonate precipitation and dissolution within these permeable sediments. Changes in flux rates over a diel cycle demonstrate the importance of taking into account the short-term variability of benthic metabolism when calculating net daily flux rates. Based on one diel cycle, the sediments were a net daily source of alkalinity to the water column (5.13 to 8.84 mmol m−2 d−1, depending on advection rates), and advection had a net stimulatory effect on carbonate dissolution. The enhanced alkalinity release associated with benthic metabolism and pore-water advection may partially buffer shallow coral reef ecosystems against ocean acidification on a local scale.  ",
    "keywords": "chemistry, field, ocean-acidification, south-pacific",
    "name": "Carbon cycling hysteresis in permeable carbonate sands over a diel cycle: implications for ocean acidification",
    "url": "https://pacificdata.org/data/dataset/cyronak2013carbon-cycling-hysteresis-in-permeable-carbonate-sands-over-a-diel-cycle-implication"
}