{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-thematic-brief-inclusion-of-pacific-women-with-disabilities",
    "@type": "Dataset",
    "description": "This Thematic Brief provides information and analysis about the inclusion of women and girls with disabilities in the Pacific Islands region. It has been developed by the Support Unit for Pacific Women Shaping Pacific Development (Pacific Women).\nThe six key messages provide background about the importance of inclusion for women and girls with disabilities in the Pacific, particularly during the COVID-19 response, and why Pacific Women is supporting women and girls with disabilities to become more empowered to participate at all levels of society.\n1. Women with disabilities experience multiple forms of discrimination (intersection of gender and disability) that are exacerbated during a crisis such as the COVID-19 pandemic.\n2. Women with disabilities are much more likely to live in poverty.\n3. Women with disabilities are particularly vulnerable to physical violence, rape and sexual abuse, with perpetrators rarely brought to justice.\n4. Women with disabilities are skilled, capable and able to make decisions for themselves and care for their families, and to share equal rights with people without disabilities. They are parents, community members, workers and leaders.\n5. Participation is central to effective disability inclusion and ensuring women and girls with disabilities participate in decisions that relate to them and reflect their aspirations, abilities and contributions.\n6. There has been significant progress in the past decade on disability inclusion in the Pacific.",
    "keywords": "enhancing-agency, pacific-women, social-norms, thematic-brief",
    "name": "Thematic Brief: Inclusion of Pacific women with disabilities",
    "url": "https://pacificdata.org/data/dataset/pwl-thematic-brief-inclusion-of-pacific-women-with-disabilities"
}