{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-mapping-paper-private-sector-responses-to-ending-violence-against-women-in-the-pacific",
    "@type": "Dataset",
    "description": "This mapping paper includes examples of efforts by the private sector in the Pacific to address violence against women and provides examples of how States can begin to calculate the costs of violence to a nation’s economy. While there are some great examples of private sector initiatives, there is little information available on the successes and impacts of these initiatives.  \n\nThere is limited analysis of the costs of violence on the business sector and on national economies. Evidence of costs to businesses of violence would help create awareness of both the economic and social imperatives to address violence against women and help to inform and mobilise support from government and private sector.  \n\nThe private sector needs to be open to working with both State and non-State actors in addressing violence including women’s organisations that have expertise in addressing violence against women. \n\nParticipation of women is needed to develop private sector responses that really address women’s lived realities. Women employees, community members and women’s groups need to be engaged and involved in the development of private sector responses. \n\nOutside Papua New Guinea and perhaps Fiji, private sector organisations are less networked globally; specific assistance in networking between private sector organisations should be supported, including for small and medium scale businesses. \n\nSeveral toolkits / frameworks and implementation guides exist. These can be further developed for the Pacific, specifically for small island states where small and medium industries often do not have large supportive corporate structures.  \n\nIt is better for the private sector to be ‘proactive’ in developing policies, rather than only developing them after a crisis situation occurs. Private sector organisations can support each other with lessons learned and examples, sharing company practices as appropriate. \n\nGiven the strength, diversity and outreach of the private sector, this sector can be a leading player in community responses, highlighting the issues of violence against women, and being an active partner in advocating for social change to address violence against women and increase women’s economic empowerment.",
    "keywords": "development-programming, ending-vioelnce-against-women, land-sea-and-livelihoods, pacific-women, research-report, social-norms, violence",
    "name": "Mapping Paper: Private Sector Responses to Ending Violence Against Women in the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-mapping-paper-private-sector-responses-to-ending-violence-against-women-in-the-pacific"
}