{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-young-persons-with-disabilities-global-study-on-ending-gender-based-violence-and-realizing-sexua",
    "@type": "Dataset",
    "description": "This study was commissioned to increase the visibility of young persons with disabilities to policymakers and advocates. It provides: \n\n- An up-to-date analysis on the situation of young persons with disabilities concerning discrimination and sexual violence, including the impact on their sexual and reproductive health and rights (SRHR).\n\n- A detailed assessment of legal, policy, and programming developments and specific good practices in service delivery along with best-standard prevention and protection measures. \n\n- Detailed policy and programming recommendations to assist UNFPA in building a comprehensive programme in this field.\n\nThe report sets out the situational context in which young persons with disabilities seek to exercise their rights. It discusses the compounding nature of discrimination to which young persons with disabilities are too often subjected because of their disabilities, their youth, and their gender. It highlights the ways in which young persons with disabilities are vulnerable to violence, especially gender-based violence, and the barriers they face when seeking services and obtaining support to respond to such violence. It discusses the challenges of accessing and exercising SRHR, made more difficult because of inaccessibility, absence of autonomy, and limited empowerment, among other things. The report emphasises how time and space can have profound effects on the ability of young persons with disabilities to access their rights to health and safety. In humanitarian crises and low-resource environments, young persons with disabilities are often the last to receive meaningful attention. Institutionalisation of young persons with disabilities remains far too common and places young people within spaces in which the denial of their rights is routine and rates of violence profound. The report also lays out the international and regional normative frameworks establishing states’ obligations to prevent and respond to violence against young persons with disabilities and to ensure their access to and enjoyment of SRHR. It includes effective strategies to prevent and respond to GBV and includes case studies of promising programmes at the international, regional, and state level and describes good practices in fostering the realisation of SRHR for young persons with disabilities. The report discusses the importance of inclusion, partnership, and engagement of CSOs in all phases of policy and programme development and contains detailed recommendations for action to ensure that young persons with disabilities can achieve the full enjoyment of their rights.",
    "keywords": "Health, Report, development-programming, ending-violence-against-women, human-rights, pacific-women, social-norms, violence",
    "name": "Young Persons with Disabilities: Global Study on Ending Gender-based Violence and Realizing Sexual and Reproductive Health and Rights",
    "url": "https://pacificdata.org/data/dataset/pwl-young-persons-with-disabilities-global-study-on-ending-gender-based-violence-and-realizing-sexua"
}