{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-12th-triennial-conference-of-pacific-women",
    "@type": "Dataset",
    "description": "With the theme of ‘Celebrating our Progress, Shaping our World’, the Conference highlighted the progress made so far towards gender equality while recognising that the Pacific Islands region has a long way to go to achieve substantive gender equality. The conference made a number of recommendations regarding the priority areas of violence against women, health and access to services, as well as on gender disaggregation in the context of the ‘data revolution’. Discussions highlighted actions taken by the Pacific Island countries and territories to improve prevention and response to violence against women.  \n\nThe Conference Outcome Statements addresses: \n\n- 2013 Pacific Regional Millennium Development Goals Tracking Report. \n\n- Mechanisms to promote the empowerment of women. \n\n- Women’s legal and human rights. \n\n- Women’s access to services - education and health. \n\n- Economic empowerment of women. \n\n- Emerging areas of work. \n\n- Upcoming regional and international processes. \n\n- Additional items raised by Pacific Island countries and territories. \n\nThe Pacific Young Women’s Leadership Alliance identified five strategic recommendations on: \n\n- Eliminating sexual and gender-based violence. \n\n- Ensuring sexual and reproductive health and rights. \n\n- Eliminating all forms of discrimination against persons with disabilities. \n\n- Promoting full and decent employment and economic empowerment for young women. \n\n- Ensuring full participation of young women at all levels of decision making. \n\nThe overall objective of the Fifth Pacific Women’s Ministerial Meeting was to consider the outcomes and recommendations from the Conference and to agree on ways to effectively integrate gender equality into national and regional development agenda.",
    "keywords": "Education, Health, human-rights, land-sea-and-livelihoods, leadership-and-decision-making, leadership-and-politics, outcomes-statement, pacific-women, social-norms, violence",
    "name": "12th Triennial Conference of Pacific Women",
    "url": "https://pacificdata.org/data/dataset/pwl-12th-triennial-conference-of-pacific-women"
}