{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/tuvalu-exclusive-economic-zone-200-nautical-miles",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((172.71256944444497 -13.240386111110979, 172.71256944444497 -3.965563888888767, 183.243352777778 -3.965563888888767, 183.243352777778 -13.240386111110979, 172.71256944444497 -13.240386111110979))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "Part 4 of the Tuvalu Maritime Zones Act 2012 states that the exclusive economic zone of Tuvalu comprises those areas of the sea, seabed and subsoil that are beyond and adjacent to the territorial sea, having as their outer limits a line measured seaward from the baseline; which is measured from the low-water line of the seaward side of the reef fringing the coast of any part of Tuvalu or bounding any lagoon waters adjacent to any part of that coast, or where a reef is not present, the low-water line of the coast itself every point of which is not more than 200 nautical miles from the nearest point of that baseline.\r\n\r\nWhere an archipelagic baseline is declared, the outer limits of the exclusive economic zone are a line measured seaward from that archipelagic baseline, every point of which is not more than 200 nautical miles from the nearest point of that archipelagic baseline.\r\n\r\nIn addition, the Declaration of the Outer Limits of the Exclusive Economic Zone 2015 which repeals and replaces the Declaration of the Outer Limits of the Exclusive Economic Zone 2012, contains the geographical coordinate with reference to the World Geodetic System 1984 (WGS 84). Points are connected by geodesic lines realized in WGS84.\r\n\r\nhttps://www.un.org/depts/los/LEGISLATIONANDTREATIES/PDFFILES/tuv_maritime_zones_act_2012_1.pdf\r\nhttps://www.un.org/depts/los/LEGISLATIONANDTREATIES/PDFFILES/DEPOSIT/TuvaluEEZDec2015.pdf",
    "keywords": "200M, EEZ, TV, Tuvalu Exclusive Economic Zone",
    "name": "Tuvalu Exclusive Economic Zone (200 Nautical Miles)",
    "url": "https://pacificdata.org/data/dataset/tuvalu-exclusive-economic-zone-200-nautical-miles"
}