{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/marshall-islands-majuro-lagoon-high-resolution-bathymetry-survey-charts-1-to-50-000-1-to-25-0001",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((157.4605437804716 1.777313889000837, 157.4605437804716 17.946061498439633, 175.5217631574444 17.946061498439633, 175.5217631574444 1.777313889000837, 157.4605437804716 1.777313889000837))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "The Marshall Islands, officially the Republic of the Marshall Islands (RMI), is a Micronesian island nation in the western Pacific Ocean, located north of Nauru and Kiribati, east of the Federated States of Micronesia and south of the U.S. territory of Wake Island, to which it lays claim. The datasets describe the Multi beam bathymetry survey and a high-resolution bathymetric mapping of the seabed in the Majuro lagoon and some parts of the seabed around the atoll. The survey achieved 100% coverage of the seafloor in the lagoon from approximately 10 to 70m water depths and approximately 10 m depth nearshore area to an average offshore distance of 5 km, reaching water depths of some 2200 m. the seafloor terrain was found to be highly irregular with an average slope of 31 degrees. The bathymetry chart are downloadable from its appropriate link under Distribution Info. The work was initiated by the SOPAC/EU project 'Reducing Vulnerability of pacific ACP States'.The charts give a descriptive picture of the ocean bottom terrain, vividly revealing the size, shape and distribution of underwater features, and serve as the basic tool for scientific, engineering, marine geophysical and environmental studies, as well as marine and coastal resource management.Coastline - The lagoon is enclosed by an almost continuous reef flat with some passages on the middle west of north rim, in which a 3.2km wide and 9.1 - 18.3m deep passage is located to the west of Calin islet. Most islets are on the east half of north rim, east, south and southwest rims. The islets on the south rim have been connected by causeways. The lagoon has a surface area of about 324km2 and an average depth of about 46m, descending to a maximum depth of 67m (MANOA MAPWORKS, 1989; WILSON et al., 1990; HOLTHUS et al., 1992).",
    "keywords": "bathymetry, marshall-island",
    "name": "Marshall Islands Majuro Lagoon High Resolution Bathymetry Survey Charts (1 to 50 000 & 1 to 25 000) #2",
    "url": "https://pacificdata.org/data/dataset/marshall-islands-majuro-lagoon-high-resolution-bathymetry-survey-charts-1-to-50-000-1-to-25-0001"
}