{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/li2018the-detrimental-effects-of-co2-driven-chronic-acidification-on-juvenile-pacific-abalone-h",
    "@type": "Dataset",
    "description": "To test the effects of chronic stress caused by CO2-driven decreases in pH (NBS scale) on molluscs, juvenile Pacific abalone (Haliotis discus hannai), an economically important gastropod, were cultured at pH 8.1 (control), pH 7.9 or 7.7 for 3 months. Eroded shell surfaces, reduced growth rates, and altered biochemical composition and energy metabolism were found in abalone cultured in acidified conditions. Glycogen contents and crude lipid contents were significantly higher in the muscle of abalone from the control treatments than in those from the pH 7.7 treatment, indicating that allocation of tissue energy storage was altered by chronic acidification. The ratio of the oxygen consumption rate to the ammonia excretion rate (O:N ratio) of individuals cultured at two acidified treatments decreased significantly compared with the controls, suggesting a decreased use of body lipid and carbohydrates as a metabolic substrate under chronic acidified conditions. Chronic acidification had detrimental effects on the physiological activity of the Pacific abalone; however, the ability to acclimate varied among individuals. A minority of tested animals incubated at acidified conditions exhibited undiminished performance. The Pacific abalone may face severe challenges in the near future, but they may also hold considerable ability to acclimate to ocean acidification.",
    "keywords": "biological-response, dissolution, laboratory, mollusks, morphology, north-pacific, ocean-acidification, physiology",
    "name": "The detrimental effects of CO2-driven chronic acidification on juvenile Pacific abalone (Haliotis discus hannai)",
    "url": "https://pacificdata.org/data/dataset/li2018the-detrimental-effects-of-co2-driven-chronic-acidification-on-juvenile-pacific-abalone-h"
}