{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/republic-of-marshall-islands-territorial-sea-zone",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((157.4605437804716 1.777313889000837, 157.4605437804716 17.946061498439633, 175.5217631574444 17.946061498439633, 175.5217631574444 1.777313889000837, 157.4605437804716 1.777313889000837))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "The Republic of the Marshall Islands Maritime Zones Declaration Act 2016 (Nitijela Bill No. 13) repeals the Marine Zones (Declaration) Act 1984 and underlines the delineation and demarcation of the Republic of Marshall Islands territorial sea. It further states that the territorial sea comprises of the sea having: \r\n(a)as their inner limits, the baseline and \r\n(b)as their outer limits, a line measured seaward from that baseline, every point of which is distant 12 nautical mils from the nearest point of that baseline. \r\n\r\nThe baseline from which the breadth of the territorial sea is measured shall be:\r\n(a)\tWhere the reef is present \r\n\r\n(i)\tThe low water line of the seaward side of the reed fringing the coast of any part of RMI or bounding any lagoon adjacent to any part of that coast: and \r\n(ii)\tWhere there are breaks in reefs or entrances to lagoons, any closing lines drawn between the natural entrance points at low water or between the geographic coordinates of points declared by order of the Minister or \r\n\r\n(b)\tWhere a reef is not present, the low water line of the coast itself and outermost permanent harbour works\r\n\r\nIn addition, the Declaration of Baselines and Maritime Zones Outer Limits under the Act contains the geographical coordinate with reference to the World Geodetic System 1984 (WGS 84). Points are connected by geodesic lines realized in the WGS 84.  \r\n\r\nhttps://www.un.org/depts/los/LEGISLATIONANDTREATIES/PDFFILES/DEPOSIT/mhl_mzn120_2016_1.pdf\r\n",
    "keywords": "12M, 12NM, FFA, TSZ, Territorial, TerritorialSeaZone",
    "name": "Republic of Marshall Islands Territorial Sea (12 Nautical Miles)",
    "url": "https://pacificdata.org/data/dataset/republic-of-marshall-islands-territorial-sea-zone"
}