{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-sorcery-cases-in-papua-new-guinea-s-village-courts-legal-innovation-part-iv",
    "@type": "Dataset",
    "description": "The Sorcery Act criminalised the use of sorcery for ‘evil purposes’. It was repealed in 2013 in the wake of several high profile and gruesome killings related to sorcery accusations, because of a widespread perception that the Act could make available a defence in cases involving violence toward suspected sorcerers. In addition to repealing the Act, Prime Minister Peter O’Neill introduced a penal measure extending the death penalty to sorcery-related murders. \n\nHowever timely the repeal of the Act may have been, in practical terms this event was largely symbolic. Cases involving sorcery infrequently make it to the national courts, where the repeal of this piece of legislation might actually constrain the options available to defendants who claim to have been provoked by the actions of sorcerers. \n\nThe majority of sorcery cases, instead, are heard in village courts, particularly those in remote rural areas where concerns about sorcery are strongest, and are often a matter of nearly daily discussion.\n\nThis short paper assets that further information is needed from the village courts about how they can best be supported in dealing with sorcery cases. Greater support, in terms of both resourcing and adjudication guidance, could go some way towards closing the gap perceived by many rural people between their concerns and those of elites in the capital, Port Moresby.",
    "keywords": "ending-violence-against-women, human-rights, pacific-women, short-paper, social-norms, violence",
    "name": "Sorcery Cases in Papua New Guinea’s Village Courts: Legal Innovation Part IV",
    "url": "https://pacificdata.org/data/dataset/pwl-sorcery-cases-in-papua-new-guinea-s-village-courts-legal-innovation-part-iv"
}