{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/bednarsek2017cexposure-history-determines-pteropod-vulnerability-to-ocean-acidification-along-t",
    "@type": "Dataset",
    "description": "The pteropod Limacina helicina frequently experiences seasonal exposure to corrosive conditions ($Ømega$ar  \\textless 1) along the US West Coast and is recognized as one of the species most susceptible to ocean acidification (OA). Yet, little is known about their capacity to acclimatize to such conditions. We collected pteropods in the California Current Ecosystem (CCE) that differed in the severity of exposure to $Ømega$ar conditions in the natural environment. Combining field observations, high-CO2 perturbation experiment results, and retrospective ocean transport simulations, we investigated biological responses based on histories of magnitude and duration of exposure to $Ømega$ar \\textless 1. Our results suggest that both exposure magnitude and duration affect pteropod responses in the natural environment. However, observed declines in calcification performance and survival probability under high CO2 experimental conditions do not show acclimatization capacity or physiological tolerance related to history of exposure to corrosive conditions. Pteropods from the coastal CCE appear to be at or near the limit of their physiological capacity, and consequently, are already at extinction risk under projected acceleration of OA over the next 30 years. Our results demonstrate that $Ømega$ar exposure history largely determines pteropod response to experimental conditions and is essential to the interpretation of biological observations and experimental results.",
    "keywords": "abundance, adaptation, biological-response, chemistry, communitymodeling, field, laboratory, methods, modeling, mollusks, morphology, mortality, north-pacific, ocean-acidification, otherprocess, zooplankton",
    "name": "Exposure history determines pteropod vulnerability to ocean acidification along the US West Coast",
    "url": "https://pacificdata.org/data/dataset/bednarsek2017cexposure-history-determines-pteropod-vulnerability-to-ocean-acidification-along-t"
}