{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-new-draft-national-action-plan-to-address-sorcery-accusation-related-violence-in-png",
    "@type": "Dataset",
    "description": "In 2013, widespread publicity given to the deaths of two women accused of witchcraft in Papua New Guinea drew international and national attention to the problem of sorcery and witchcraft accusation–related violence. In the face of mounting pressure to take action, including the national haus krai protest calling for an end to violence against women, the government responded by repealing the Sorcery Act 1971 and creating a new provision in the Criminal Code Act 1974 (Chapter 262). Section 229A of the Criminal Code Act provides that any person who intentionally kills another person on account of an accusation of sorcery is guilty of wilful murder, for which the penalty is death. \n\nThere was recognition, both within the government and the wider community, that these problems cannot be solved solely at a legislative level, and must rather involve a holistic response. \n\nThis short paper outlines the substance of, and steps leading to, the drafting of a national action plan to provide a concrete foundation for this holistic response to sorcery accusation-related violence. The plan has five core areas: legal and protection; health; advocacy and communication; care and counselling; and research. Each area contains some key recommendations and sets out concrete activities to be taken in both the short and medium term to implement the recommendations. \n\nThe action plan also allocates specific responsibilities to particular departments and organisations, establishes time frames, and highlights the resources (human and financial) that are necessary or available to implement them.",
    "keywords": "ending-violence-against-women, human-rights, pacific-women, short-paper, social-norms, violence",
    "name": "New Draft National Action Plan to Address Sorcery Accusation-Related Violence in PNG",
    "url": "https://pacificdata.org/data/dataset/pwl-new-draft-national-action-plan-to-address-sorcery-accusation-related-violence-in-png"
}