{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/global-distribution-of-coral-reefs",
    "@type": "Dataset",
    "description": "This dataset shows the global distribution of coral reefs in tropical and subtropical regions. It is the most comprehensive global dataset of warm-water coral reefs to date, acting as a foundation baseline map for future, more detailed, work. This dataset was compiled from a number of sources by UNEP World Conservation Monitoring Centre (UNEP-WCMC) and the WorldFish Centre, in collaboration with WRI (World Resources Institute) and TNC (The Nature Conservancy). Data sources include the Millennium Coral Reef Mapping Project (IMaRS-USF and IRD 2005, IMaRS-USF 2005) and the World Atlas of Coral Reefs (Spalding et al. 2001).\r\n\r\n__Citation:__\r\nUNEP-WCMC, WorldFish Centre, WRI, TNC (2018). Global distribution of coral reefs,\r\ncompiled from multiple sources including the Millennium Coral Reef Mapping\r\nProject. Version 4.0, updated by UNEP-WCMC. Includes contributions from IMaRSUSF and IRD (2005), IMaRS-USF (2005) and Spalding et al. (2001). Cambridge (UK):\r\nUNEP World Conservation Monitoring Centre. URL: http://data.unepwcmc.org/datasets/1\r\n\r\nFor further information on the Millennium Coral Reef Mapping Project, see:\r\nAndréfouët S, Muller-Karger FE, Robinson JA, Kranenburg CJ, Torres-Pulliza D, Spraggins SA, Murch B. (2006). Global assessment of modern coral reef extent and diversity for regional science and management applications: a view from space. Proceedings of 10th International Coral Reef Symposium: 1732-1745.\r\n\r\n__Citations for the separate entities:__\r\nIMaRS-USF (Institute for Marine Remote Sensing-University of South Florida) (2005). Millennium Coral Reef Mapping Project. Unvalidated maps. These maps are unendorsed by IRD, but were further interpreted by UNEP World Conservation Monitoring Centre. Cambridge (UK): UNEP World Conservation Monitoring Centre\r\n\r\nIMaRS-USF, IRD (Institut de Recherche pour le Developpement) (2005). Millennium Coral Reef Mapping Project. Validated maps. Cambridge (UK): UNEP World Conservation Monitoring Centre\r\n\r\nSpalding MD, Ravilious C, Green EP (2001). World Atlas of Coral Reefs. Berkeley (California, USA): The University of California Press. 436 pp.",
    "keywords": "UNEP-WCMC, WCMC, biogenic, coastal, coral-cover, coral-reef-conservation, coral-reef-ecology, coral-reefs, corals, global-shoreline, habitat, marine, marine-science, remote-sensing, sea",
    "name": "Global Distribution of Coral Reefs",
    "url": "https://pacificdata.org/data/dataset/global-distribution-of-coral-reefs"
}