{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/spc_wsm_2009_bas_v01_m",
    "@type": "Dataset",
    "description": "The scope of the 2009 BAS is all employing businesses in the private sector other than those involved in agricultural activities. \n\nIncluded are:\n·\tNon-governmental organizations (NGOs, not-for profit organizations, etc.);\n·\tGovernment Public Bodies \n\nExcluded are:\n·\tNon-employing units (e.g., market sellers);\n·\tGovernment ministries, constitutional offices and those public bodies involved in public administration and included in the Central Government Budget Sector; \n·\tAgricultural units (unless large scale/commercial - if the Agriculture census only covers household activities);\n·\t“Non-resident” bodies such as international agencies, diplomatic missions (e.g., high commissions and embassies, UNDP, FAO, WHO);\n\nThe survey coverage is of all businesses in scope as defined above. Statistical units relevant to the survey are the enterprise and the establishment. The enterprise is an institutional unit and generally corresponds to legal entities such as a company, cooperative, partnership or sole proprietorship. The establishment is an institutional unit or part of an institutional unit, which engages in one, or predominantly one, type of economic activity. Sufficient data must be available to derive or meaningfully estimate value added in order to recognize an establishment. The main statistical unit from which data will be collected in the survey is the establishment. For most businesses there will be a one-to-one relationship between the enterprise and the establishment, i.e., simple enterprises will comprise only one establishment. The purpose of collecting data from establishments (rather than from enterprises) is to enable the most accurate industry estimates of value added possible.",
    "keywords": "education, fertility, household, housing, individual, labour-force, phc, wallis-and-futuna",
    "name": "Samoa Business Activity Survey 2009",
    "url": "https://pacificdata.org/data/dataset/spc_wsm_2009_bas_v01_m"
}