{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/bowen2013acidification-alters-the-composition-of-ammoniaoxidizing-microbial-assemblages-in-mari",
    "@type": "Dataset",
    "description": "Increasing atmospheric CO2 concentrations are causing decreased pH over vast expanses of the ocean. This decreasing pH may alter biogeochemical cycling of carbon and nitrogen via the microbial process of nitrification, a key process that couples these cycles in the ocean, but which is often sensitive to acidic conditions. Recent reports have indicated a decrease in oceanic nitrification rates under experimentally lowered pH. How the composition and abundance of ammonia-oxidizing bacteria (AOB) and archaea (AOA) assemblages respond to decreasing oceanic pH is unknown. We sampled microbes from 2 different acidification experiments and used a combination of qPCR and functional gene microarrays for the ammonia monooxygenase gene (amoA) to assess how acidification alters the structure of ammonia oxidizer assemblages. We show that despite widely different experimental conditions, acidification consistently altered the community composition of AOB by increasing the relative abundance of taxa related to the Nitrosomonas ureae clade. In one experiment, this increase was sufficient to cause an increase in the overall abundance of AOB. There were no systematic shifts in the community structure or abundance of AOA in either experiment. These different responses to acidification underscore the important role of microbial community structure in the resiliency of marine ecosystems. ",
    "keywords": "biogeochemistry, biological-response, community-composition, laboratory, molecular-biology, north-pacific, ocean-acidification, otherprocess, prokaryotes",
    "name": "Acidification alters the composition of ammonia‑oxidizing microbial assemblages in marine mesocosms",
    "url": "https://pacificdata.org/data/dataset/bowen2013acidification-alters-the-composition-of-ammoniaoxidizing-microbial-assemblages-in-mari"
}