{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/falkenberg2013adisrupting-the-effects-of-synergies-between-stressors-improved-water-quality-dam",
    "@type": "Dataset",
    "description": "Summary      Synergies among stressors drive unanticipated changes to alternative states, yet little has been done to assess whether alleviating one or more contributing stressors may disrupt these interactions. It would be particularly useful to understand whether the synergistic effects of global and local stressors could be alleviated, leading to slower change or faster recovery, if conditions under the control of local management alone were managed (i.e. nutrient pollution).     We utilized field-based mesocosms to manipulate CO2 (i.e. forecasted global concentrations) and nutrients (i.e. local pollution) to test the hypothesis that, where synergies exist, reducing one contributing stressor would limit the effect of the other. In testing this hypothesis, we considered the response of turfing algae, which can displace kelp forests on urbanized coastlines.     Initial manipulations of CO2 and nutrient enrichment produced an anticipated synergistic effect on the biomass of turfing algae.     Following exposure of algal turfs to a combination of enriched nutrients and CO2, a subsequent reduction in nutrients was able to substantially slow further increases in turf growth. Despite this substantial effect, the historical legacy of previous nutrient enrichment was evident as greater turf was maintained relative to ambient conditions (i.e. ambient CO2 and nutrients). Such legacies of past stressors may be stubborn (e.g. persist as intergenerational change) where the alternative state (i.e. turf algae) has substantial resilience to restorative actions.     Synthesis and applications. As stressors accumulate across global to local scales, some combine to produce synergistic effects which cause changes of disproportionate ecological magnitude. While strong synergies attract heavy scrutiny, there remains substantial merit in assessing whether their influence can be ameliorated by managing a contributing stressor. Of note, we show that by reducing a locally determined stressor (nutrients), its synergistic effects with a globally determined stressor (CO2 enrichment) on a key taxon (turf algae) may be substantially reduced. These results suggest that in the face of changing climate (e.g. ocean acidification), the management of local stressors (e.g. water pollution) may have a greater contribution in determining the dominant state than current thinking allows.     ",
    "keywords": "abundance, algae, biological-response, field, mesocosms, mitigation, morphology, multiple-factors, nutrients, ocean-acidification, otherprocess, south-pacific",
    "name": "Disrupting the effects of synergies between stressors: improved water quality dampens the effects of future CO2 on a marine habitat",
    "url": "https://pacificdata.org/data/dataset/falkenberg2013adisrupting-the-effects-of-synergies-between-stressors-improved-water-quality-dam"
}