{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pistevos2015ocean-acidification-and-global-warming-impair-shark-hunting-behaviour-and-growth",
    "@type": "Dataset",
    "description": "Alterations in predation pressure can have large effects on trophically-structured systems. Modification of predator behaviour via ocean warming has been assessed by laboratory experimentation and metabolic theory. However, the influence of ocean acidification with ocean warming remains largely unexplored for mesopredators, including experimental assessments that incorporate key components of the assemblages in which animals naturally live. We employ a combination of long-term laboratory and mesocosm experiments containing natural prey and habitat to assess how warming and acidification affect the development, growth, and hunting behaviour in sharks. Although embryonic development was faster due to temperature, elevated temperature and CO2 had detrimental effects on sharks by not only increasing energetic demands, but also by decreasing metabolic efficiency and reducing their ability to locate food through olfaction. The combination of these effects led to considerable reductions in growth rates of sharks held in natural mesocosms with elevated CO2, either alone or in combination with higher temperature. Our results suggest a more complex reality for predators, where ocean acidification reduces their ability to effectively hunt and exert strong top-down control over food webs.",
    "keywords": "biological-response, fish, laboratory, mesocosms, morphology, multiple-factors, ocean-acidification, otherprocess, performance, physiology, reproduction, south-pacific, temperature",
    "name": "Ocean acidification and global warming impair shark hunting behaviour and growth",
    "url": "https://pacificdata.org/data/dataset/pistevos2015ocean-acidification-and-global-warming-impair-shark-hunting-behaviour-and-growth"
}