{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/spero1997effect-of-seawater-carbonate-concentration-on-foraminiferal-carbon-and-oxygen-isotopes",
    "@type": "Dataset",
    "description": "Stable oxygen and carbon isotope measurements on biogenic calcite and aragonite have become standard tools for reconstructing past oceanographic and climatic change. In aquatic organisms, super(18)O / super(16)O ratios in the shell carbonate are a function of the ratio in the sea water and the calcification temperature. In contrast, super13C/ super(12)C ratios are controlled by the ratio of dissolved inorganic carbon in sea water and physiological processes such as respiration and symbiont photosynthesis. These geochemical proxies have been used with analyses of foraminifera shells to reconstruct global ice volumes, surface and deep ocean temperatures, ocean circulation changes and glacial-interglacial exchange between the terrestrial and oceanic carbon pools. Here, we report experimental measurements on living symbiotic and non-symbiotic plankton foraminifera (Orbulina universa and Globigerina bulloides respectively) showing that the super13C/ super(12)C and super(18)O/ super(16)O ratios of the calcite shells decrease with increasing seawater [CO sub(3) super(2-)]. Because glacial-period oceans had higher pH and [CO sub(3) super(2-)] than today, these new relationships confound the standard interpretation of glacial foraminiferal stable-isotope data. In particular, the hypothesis that the glacial-interglacial shift in the super13C/ super(12)C ratio was due to a transfer of terrestrial carbon into the ocean can be explained alternatively by an increase in ocean alkalinity. A carbonate-concentration effect could also help explain some of the extreme stable-isotope variations during the Proterozoic and Phanerozoic aeons.",
    "keywords": "101594pangaea721923, biological-response, calcification, laboratory, north-pacific, oaiccdb, ocean-acidification, paleo, protists, spero1997",
    "name": "Effect of seawater carbonate concentration on foraminiferal carbon and oxygen isotopes",
    "url": "https://pacificdata.org/data/dataset/spero1997effect-of-seawater-carbonate-concentration-on-foraminiferal-carbon-and-oxygen-isotopes"
}