{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-power-politics-and-coalitions-in-the-pacific-lessons-from-collective-action-on-gender-and-power",
    "@type": "Dataset",
    "description": "The case studies of coalitions in Fiji, Kiribati, Papua New Guinea and Tonga highlight four influential factors in the formation and functioning of coalitions:  \nFormative events:  What brought people together to ‘do something’ in a concerted way? For example, the torture and death of a woman in a sorcery-related violence incident generated the impetus for the formation of the Papua New Guinea coalition examined in this study. Whether formative events are locally or externally driven appears to mould the future shape of a coalition and how it functions. \nShared purpose, interests and values: Clarity of shared ground and common purpose helps coalitions increase their support base, coherence and influence. The dominant forms of common purpose identified by this study are shared values and interests. For example, the Fiji case study illustrates how shared values around universal human rights and a common purpose of fighting a constitutional amendment bound together a broad range of actors to challenge gender relations. \nForms of leadership: The nature of a coalition’s leadership can determine its sustainability and its ability to respond to changing circumstances, broker relationships and divergent interests, and challenge vested interests.  Some coalitions understood and practised leadership as a process of adaptation; others understood leadership to be a characteristic of leaders.  For example, the Tonga case study revealed efforts to divest and decentralise leadership to overcome the limitations of individual leadership. \nThe nature of ownership: The degree to which a coalition’s agenda is locally owned and its ways of working are politically salient appears to be key to determining its effectiveness. This study found that the coalitions examined could be broadly characterised as local/hybrid variations. For example, the Kiribati coalition formed following a regional meeting and was initially supported by international donors. However, it quickly became ‘localised’ because its coordinator and members were I-Kiribati and they set its agenda and direction. \nThe report also discusses how the coalitions engage with different dimensions of power, and emerging lessons for coalitions and their supporters.",
    "keywords": "development-programming, enhancing-agency, human-rights, leadership-and-decision-making, leadership-and-politics, pacific-women, research-report, social-norms",
    "name": "Power, Politics and Coalitions in the Pacific: Lessons from Collective Action on Gender and Power",
    "url": "https://pacificdata.org/data/dataset/pwl-power-politics-and-coalitions-in-the-pacific-lessons-from-collective-action-on-gender-and-power"
}