{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/comeau2014water-flow-modulates-the-response-of-coral-reef-communities-to-ocean-acidification",
    "@type": "Dataset",
    "description": "By the end of the century coral reefs likely will be affected negatively by ocean acidification (OA), but both the effects of OA on coral communities and the crossed effects of OA with other physical environmental variables are lacking. One of the least considered physical parameters is water flow, which is surprising considering its strong role in modulating the physiology of reef organisms and communities. In the present study, the effects of flow were tested on coral reef communities maintained in outdoor flumes under ambient pCO2 and high pCO2 (1300 $μ$atm). Net calcification of coral communities, including sediments, was affected by both flow and pCO2 with calcification correlated positively with flow under both pCO2 treatments. The effect of flow was less evident for sediments where dissolution exceeded precipitation of calcium carbonate under all flow speeds at high pCO2. For corals and calcifying algae there was a strong flow effect, particularly at high pCO2 where positive net calcification was maintained at night in the high flow treatment. Our results demonstrate the importance of water flow in modulating the coral reef community response to OA and highlight the need to consider this parameter when assessing the effects of OA on coral reefs.",
    "keywords": "101594pangaea847986, biological-response, brcommunity, calcification, corals, dissolution, flow, laboratory, multiple-factors, oaiccdb, ocean-acidification, sediment, south-pacific",
    "name": "Water flow modulates the response of coral reef communities to ocean acidification",
    "url": "https://pacificdata.org/data/dataset/comeau2014water-flow-modulates-the-response-of-coral-reef-communities-to-ocean-acidification"
}