{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/kim2013fsynergistic-effects-of-elevated-carbon-dioxide-and-sodium-hypochlorite-on-survival-and-",
    "@type": "Dataset",
    "description": "Sodium hypochlorite (NaOCl) is widely used to disinfect seawater in power plant cooling systems in order to reduce biofouling, and in ballast water treatment systems to prevent transport of exotic marine species. While the toxicity of NaOCl is expected to increase by ongoing ocean acidification, and many experimental studies have shown how algal calcification, photosynthesis and growth respond to ocean acidification, no studies have investigated the relationship between NaOCl toxicity and increased CO2. Therefore, we investigated whether the impacts of NaOCl on survival, chlorophyll a (Chl-a), and effective quantum yield in three marine phytoplankton belonging to different taxonomic classes are increased under high CO2 levels. Our results show that all biological parameters of the three species decreased under increasing NaOCl concentration, but increasing CO2 concentration alone (from 450 to 715 $μ$atm) had no effect on any of these parameters in the organisms. However, due to the synergistic effects between NaOCl and CO2, the survival and Chl-a content in two of the species, Thalassiosira eccentrica and Heterosigma akashiwo, were significantly reduced under high CO2 when NaOCl was also elevated. The results show that combined exposure to high CO2 and NaOCl results in increasing toxicity of NaOCl in some marine phytoplankton. Consequently, greater caution with use of NaOCl will be required, as its use is widespread in coastal waters.  ",
    "keywords": "101594pangaea824065, biological-response, laboratory, mortality, multiple-factors, north-pacific, oaiccdb, ocean-acidification, photosynthesis, phytoplankton, toxicants",
    "name": "Synergistic effects of elevated carbon dioxide and sodium hypochlorite on survival and impairment of three phytoplankton species",
    "url": "https://pacificdata.org/data/dataset/kim2013fsynergistic-effects-of-elevated-carbon-dioxide-and-sodium-hypochlorite-on-survival-and-"
}