{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/rautenberger2015saturating-light-and-not-increased-carbon-dioxide-under-ocean-acidification-dri",
    "@type": "Dataset",
    "description": "Carbon physiology of a genetically identified Ulva rigida was investigated under different CO2(aq) and light levels. The study was designed to answer whether (1) light or exogenous inorganic carbon (Ci) pool is driving growth; and (2) elevated CO2(aq) concentration under ocean acidification (OA) will downregulate CAext-mediated inline image dehydration and alter the stable carbon isotope ($δ$13C) signatures toward more CO2 use to support higher growth rate. At pHT 9.0 where CO2(aq) is \\textless1 $μ$mol L−1, inhibition of the known inline image use mechanisms, that is, direct inline image uptake through the AE port and CAext-mediated inline image dehydration decreased net photosynthesis (NPS) by only 56–83%, leaving the carbon uptake mechanism for the remaining 17–44% of the NPS unaccounted. An in silico search for carbon-concentrating mechanism elements in expressed sequence tag libraries of Ulva found putative light-dependent inline image transporters to which the remaining NPS can be attributed. The shift in $δ$13C signatures from –22‰ toward –10‰ under saturating light but not under elevated CO2(aq) suggest preference and substantial inline image use to support photosynthesis and growth. U. rigida is Ci saturated, and growth was primarily controlled by light. Therefore, increased levels of CO2(aq) predicted for the future will not, in isolation, stimulate Ulva blooms.",
    "keywords": "algae, biogeochemistry, biological-response, growth, laboratory, light, multiple-factors, ocean-acidification, physiology, south-pacific",
    "name": "Saturating light and not increased carbon dioxide under ocean acidification drives photosynthesis and growth in (Chlorophyta)",
    "url": "https://pacificdata.org/data/dataset/rautenberger2015saturating-light-and-not-increased-carbon-dioxide-under-ocean-acidification-dri"
}