{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/cross2013aconservative-and-non-conservative-variations-of-total-alkalinity-on-the-southeastern-",
    "@type": "Dataset",
    "description": "Recent observations of calcium carbonate (CaCO3) mineral undersaturations on the Bering Sea Shelf have prompted new interest in the physical and biological factors that control the inorganic carbon system in the region. Understanding of the dynamics that influence the spatio-temporal variability of total alkalinity (TA) – one major component of the seawater carbonate system – has been constrained by limited historical data collected across the shelf, and the consensus has been that TA is largely conservative. However, the recently documented undersaturated conditions have the potential to cause substantial non-conservative variability in TA in this region through the dissolution of carbonate minerals. In order to quantify the contribution of carbonate mineral precipitation and dissolution to variability in TA on the southeastern Bering Sea shelf, we examined seasonal observations of TA that were made between 2008 and 2010 as part of the BEST-BSIERP Bering Sea Project. Conservative influences accounted for most of the variability in TA concentrations, with well-constrained mixing dominating in spring and summer of 2008. Bering Shelf Water (BSW) contained a constant ratio of TA to salinity, while river discharge (RW) added TA relative to salinity at a predictable rate. Although substantial organic carbon production and denitrification can cause some non-conservative variation in TA concentrations (a maximum of ̃ 15 $μ$moles kg SW- 1 combined), carbonate mineral dissolution and precipitation were shown to be the most important processes responsible for non-conservative TA – salinity relationships. CaCO3 uptake by the dominant pelagic phytoplankton calcifier (i.e., coccolithophores) was shown to alter TA concentrations by as much as 59 $μ$moles kg SW- 1. Evidence for shallow-water CaCO3 mineral dissolution was also observed, which caused TA concentrations to increase by as much as 36 $μ$moles kg SW- 1. Therefore, contrary to our previous understanding, the non-conservative physico-biogeochemical factors observed in this study play an important role in controlling the ocean carbon cycle of the Bering Sea shelf.  ",
    "keywords": "biogeochemistry, chemistry, field, north-pacific, ocean-acidification",
    "name": "Conservative and non-conservative variations of total alkalinity on the Southeastern Bering Sea Shelf",
    "url": "https://pacificdata.org/data/dataset/cross2013aconservative-and-non-conservative-variations-of-total-alkalinity-on-the-southeastern-"
}