{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/evensen2015effects-of-pco2-on-spatial-competition-between-the-corals-montipora-aequituberculata",
    "@type": "Dataset",
    "description": "We tested the hypothesis that ocean acidification (OA) affects spatial competition among scleractinian corals. Competitive ability was evaluated indirectly by linear extension of Porites lutea and Montipora aequituberculata placed in intraspecific, interspecific, and control pairings (paired with dead coral skeleton) and exposed to ambient (̃400 µatm) and elevated (\\̃1000 µatm) pCO2 in experiments conducted in Moorea, French Polynesia, and Okinawa, Japan. High pCO2 had no effect on linear extension of M. aequituberculata in Moorea, but in Okinawa, it reduced linear extension 37%; high pCO2 had no significant effect on linear extension of P. lutea in Okinawa. Much of the negative effect of high pCO2 on linear extension for M. aequituberculata in Okinawa was due to reduced extension in control pairings, with corals engaged in intra- and interspecific competition unaffected by OA. Linear extension of M. aequituberculata and P. lutea in interspecific pairings decreased relative to control pairings at ambient pCO2 by 39 and 71%, respectively, indicating a strong effect of competition on extension rates. These differences however disappeared at elevated pCO2 when the linear extension of controls was depressed. Together, our results show that OA can negatively affect the linear extension of corals not engaged in competition, as shown in the control pairings, and suggest that OA does not directly affect the ability of corals to compete with one another for space. ",
    "keywords": "biological-response, communitymf, corals, growth, multiple-factors, north-pacific, ocean-acidification, performance, south-pacific",
    "name": "Effects of pCO2 on spatial competition between the corals Montipora aequituberculata and Porites lutea",
    "url": "https://pacificdata.org/data/dataset/evensen2015effects-of-pco2-on-spatial-competition-between-the-corals-montipora-aequituberculata"
}