{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/vargas2018ainfluence-of-glacier-melting-and-river-discharges-on-the-nutrient-distribution-and-d",
    "@type": "Dataset",
    "description": "The Chilean Patagonia constitutes one of the most important and extensive fjord systems worldwide, therefore can be used as a natural laboratory to elucidate the pathway of both organic and inorganic matter in the receiving environment. In this study we use data collected during an intensive oceanographic cruise along the Magellan Strait into the Almirantazgo Fjord in southern Patagonia to evaluate how different sources of dissolved inorganic carbon (DIC) and recycling may impact particulate organic carbon (POC) $δ$13C and influence the nutrients and carbonate system spatial distribution. The carbonate system presented large spatial heterogeneity. The lowest total alkalinity and DIC were associated to freshwater dilution observed near melting glaciers. The $δ$13CDIC analysis suggests that most DIC in the upper 50 m depth was not derived from terrestrial organic matter remineralization. 13C‐depleted riverine and ice‐melting DIC influence the DIC pool along the study area, but due to that DIC concentration from rivers and glaciers is relatively low, atmospheric carbon contribution or biological processes seem to be more relevant. Intense undersaturation of CO2 was observed in high chlorophyll waters. Respired DIC coming from the bottom waters seems to be almost insignificant for the inorganic carbon pool and therefore do not impact significantly the stable carbon isotopic composition of dissolved organic carbon and POC in the upper 50 m depth. Considering the combined effect of cold and low alkalinity waters due to ice melting, our results highlight the importance of these processes in determining corrosive waters for CaCO3 and local acidification processes associated to calving glacier in fjord ecosystems. ",
    "keywords": "biogeochemistry, chemistry, field, ocean-acidification, south-pacific",
    "name": "Influence of glacier melting and river discharges on the nutrient distribution and DIC recycling in the Southern Chilean Patagonia",
    "url": "https://pacificdata.org/data/dataset/vargas2018ainfluence-of-glacier-melting-and-river-discharges-on-the-nutrient-distribution-and-d"
}