{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/nauru-high-resolution-bathymery-survey-charts-2",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((163.57881281152783 -3.907266601353456, 163.57881281152783 2.693850810815448, 168.56024444433842 2.693850810815448, 168.56024444433842 -3.907266601353456, 163.57881281152783 -3.907266601353456))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "A high-resolution bathymetric mapping survey of the seabed surrounding the island of Nauru was carried out. The survey was carried out in just one day in September 2005, resulting in the acquisition of over 81 km of multibeam echosounder (MBES) data. Bathymetric map of Nauru showing the island and approximate position of the exclusive economic zone. The resultant dataset was used to create bathymetry charts which are available for download from its appropriate link under Distribution Info.\nThis work was initiated by the SOPAC/EU Reducing Vulnerability of Pacific ACP States Project.To give a descriptive picture of the ocean bottom terrain, vividly revealing the size, shape and distribution of underwater features, and serve as the basic tool for scientific, engineering, marine geophysical and environmental studies, as well as marine and coastal resource management.Coastline - Nauru rises from a sandy beach with a 19-km coastline encircling the island. There have been rapid changes in the coastal geography associated with increasing development. Coastal erosion is an increasing problem in Nauru due to the interruption of long-shore currents by development of boat channels, harbour facilities and the extension of the airport runway.",
    "keywords": "bathymetry, nauru",
    "name": "Nauru High Resolution Bathymery Survey Charts #2",
    "url": "https://pacificdata.org/data/dataset/nauru-high-resolution-bathymery-survey-charts-2"
}