{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/shen2017spatial-patterns-of-anchoveta-engraulis-ringens-eggs-and-larvae-in-relation-to-pco2-in-",
    "@type": "Dataset",
    "description": "Large and productive fisheries occur in regions experiencing or projected to experience ocean acidification. Anchoveta (Engraulis ringens) constitute the world's largest single-species fishery and live in one of the ocean's highest pCO2 regions. We investigated the relationship of the distribution and abundance of Anchoveta eggs and larvae to natural gradients in pCO2 in the Peruvian upwelling system. Eggs and larvae, zooplankton, and data on temperature, salinity, chlorophyll a and pCO2 were collected during a cruise off Peru in 2013. pCO2 ranged from 167-1392 µatm and explained variability in egg presence, an index of spawning habitat. Zooplankton abundance explained variability in the abundance of small larvae. Within the main spawning and larva habitats (6-10°S), eggs were found in cool, low-salinity, and both extremely low (less than 200 µatm) and high (more than 900 µatm) pCO2 waters, and larvae were collected in warmer, higher salinity, and moderate (400-600 µatm) pCO2 waters. Our data support the hypothesis that Anchoveta preferentially spawned at high pCO2 and these eggs had lower survival. Enhanced understanding of the influence of pCO2 on Anchoveta spawning and larva mortality, together with pCO2 measurements, may enable predictions of ocean acidification effects on Anchoveta and inform adaptive fisheries management.",
    "keywords": "abundance, biological-response, field, fish, individualmodeling, modeling, ocean-acidification, otherprocess, reproduction, south-pacific, zooplankton",
    "name": "Spatial patterns of Anchoveta (Engraulis ringens) eggs and larvae in relation to pCO2 in the Peruvian upwelling system",
    "url": "https://pacificdata.org/data/dataset/shen2017spatial-patterns-of-anchoveta-engraulis-ringens-eggs-and-larvae-in-relation-to-pco2-in-"
}