{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/tuvalu-niutao-bathymetry-chart-1-20-000-2",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((172.71256944444497 -13.240386111110979, 172.71256944444497 -3.965563888888767, 183.243352777778 -3.965563888888767, 183.243352777778 -13.240386111110979, 172.71256944444497 -13.240386111110979))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "Niutao Island, located at 6 degrees 6'S and 177 degrees 20'E, is a low reef island comprising a single island approximately 2.7 km long (E-W), 1.3 km wide (N-S). It is surrounded by a fringing reef and has a small central brackish-water pond. The surveyed area extends to an average of approximately 3.5 km from the coastline. \nThe resultant data from the SOPAC marine survey conducted in 2004 was used to produce nine bathymetry charts for Tuvalu at scales ranging from 1:20 000 to 1:50 000 and the Niutao bathymetry chart is available here for download under the Distribution Info. \nThis work was initiated by the SOPAC/EU Reducing Vulnerability of Pacific ACP States Project (Task no.: TV 1.1.1).To provide a descriptive picture of the ocean bottom terrain, vividly revealing the size, shape and distribution of underwater features, and serve as the basic tool for scientific, engineering, marine geophysical and environmental studies, as well as marine and coastal resource management.The water depth within the survey area around Niutao ranges from 8.6 to 2021.3 m. The seabed around Niutao shows numerous scarps, which can be separated into two general sets. A continuous scarp encircles the island in close proximity (350 m) to the outer reef slope, with a depth to the headscarp of 60-80 m, and a headscarp height of 120 m. The  deeper scarps are discontinuous and sub-parallel to the island's shoreline with headscarps 420-620 m below sea level, and headscarp heights of 220-380 m.",
    "keywords": "bathymetry, tuvalu",
    "name": "Tuvalu, Niutao, Bathymetry chart, 1 : 20 000 #2",
    "url": "https://pacificdata.org/data/dataset/tuvalu-niutao-bathymetry-chart-1-20-000-2"
}