{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/hoppe2011emiliania-huxleyi-shows-identical-responses-to-elevated-pco2-in-ta-and-dic-manipulatio",
    "@type": "Dataset",
    "description": "With respect to their sensitivity to ocean acidification, calcifiers such as the coccolithophore Emiliania huxleyi have received special attention, as the process of calcification seems to be particularly sensitive to changes in the marine carbonate system. For E. huxleyi, apparently conflicting results regarding its sensitivity to ocean acidification have been published (Iglesias-Rodriguez et al., 2008a; Riebesell et al., 2000). As possible causes for discrepancies, intra-specific variability and different effects of CO2 manipulation methods, i.e. the manipulation of total alkalinity (TA) or total dissolved inorganic carbon (DIC), have been discussed. While Langer et al. (2009) demonstrate a high degree of intra-specific variability between strains of E. huxleyi, the question whether different CO2 manipulation methods influence the cellular responses has not been resolved yet. In this study, closed TA as well as open and closed DIC manipulation methods were compared with respect to E. huxleyi's CO2-dependence in growth rate, POC- and PIC-production. The differences in the carbonate chemistry between TA and DIC manipulations were shown not to cause any differences in response patterns, while the latter differed between open and closed DIC manipulation. The two strains investigated showed different sensitivities to acidification of seawater, RCC1256 being more negatively affected in growth rates and PIC production than NZEH. ",
    "keywords": "101594pangaea763842, biological-response, calcification, chemistry, epoca-paper, growth, laboratory, methods, oaiccdb, ocean-acidification, phytoplankton, south-pacific",
    "name": "Emiliania huxleyi shows identical responses to elevated pCO2 in TA and DIC manipulations",
    "url": "https://pacificdata.org/data/dataset/hoppe2011emiliania-huxleyi-shows-identical-responses-to-elevated-pco2-in-ta-and-dic-manipulatio"
}