{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/franco2018acontrasting-impact-of-future-co2-emission-scenarios-on-the-extent-of-caco3-mineral-u",
    "@type": "Dataset",
    "description": "The eastern boundary upwelling systems are among those regions that are most vulnerable to an ocean acidification‐induced transition toward undersaturated conditions with respect to mineral CaCO3, but no assessment exists yet for the Humboldt Current System. Here we use a high‐resolution (∼7.5 km) regional ocean model to investigate past and future changes in ocean pH and CaCO3 saturation state in this system. We find that within the next few decades, the nearshore waters off Peru are projected to become corrosive year round with regard to aragonite, the more soluble form of CaCO3. The volume of aragonite undersaturated water off Peru will continue to increase in the future irrespective of the amount of CO2 emitted to the atmosphere. In contrast, the development of the saturation state with regard to calcite, a less soluble form of carbonate, depends strongly on the scenario followed. By 2050, calcite undersaturation appears in the nearshore waters off Peru occasionally, but by 2090 in a high‐emission scenario (RCP8.5), ∼60% of the water in the euphotic zone will become permanently calcite undersaturated. Most of this calcite undersaturation off Peru can likely be avoided if a low emission scenario (RCP2.6) consistent with the Paris Agreement is followed. The progression of ocean acidification off Chile follows a similar pattern, except that the saturation states are overall higher. But also here, calcite undersaturated waters will become common in the subsurface waters under the RCP8.5 scenario by the end of this century, while this can be avoided under the RCP2.6 scenario. ",
    "keywords": "chemistry, modeling, ocean-acidification, regionalmodeling, south-pacific",
    "name": "Contrasting impact of future CO2 emission scenarios on the extent of CaCO3 mineral undersaturation in the Humboldt Current System",
    "url": "https://pacificdata.org/data/dataset/franco2018acontrasting-impact-of-future-co2-emission-scenarios-on-the-extent-of-caco3-mineral-u"
}