{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/palau-territorial-sea-zone-12-nautical-miles",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((129.50880481728905 1.621407206177707, 129.50880481728905 11.558724726465186, 136.95410021135228 11.558724726465186, 136.95410021135228 1.621407206177707, 129.50880481728905 1.621407206177707))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "Title 27 of the Palau National Code as amended by the Act (SIXTH OLBIIL ERA KELULAU) to Amend Chapter 1 of Title 27 of the Palau National Code defines the territorial sea as having a twelve miles’ breadth.  The inner boundary of the territorial sea of each island or atoll is the baseline which is defined as a continuous line which encircles an island or atoll. The baseline from which the zones designated in this chapter are to be measured as follows: (a) The baseline of an island or portion of an island lacking a barrier reef, fringing reef, or other reef system is the low water line of the island as marked on large scale charts officially recognized by the national government. (b) The baseline of an atoll or island or portion of an island having a barrier reef, fringing reef, or other reef system is a line following the contour of the seaward edge of the reef system, which line connects those outermost elevations of the reef which are above water at low tide, and which line exists as marked on large scale charts officially recognized by the national government. The outer boundary is a line, every point of which is twelve nautical miles seaward of the nearest point on the baseline.\r\n\r\nWork is still in progress to publish Palau’s 12 nautical miles zone on UN DOALOS.  As such this layer is extracted from the Global Marine Regions Open Database platform. (marineregion.org)\r\n\r\nhttps://www.un.org/depts/los/LEGISLATIONANDTREATIES/PDFFILES/PLW_1990_PNC.pdf\r\nhttps://www.un.org/depts/los/LEGISLATIONANDTREATIES/PDFFILES/PLW_2003_PNC.pdf\r\n",
    "keywords": "12N, 12NM, Palau, PalauTerritorialSea",
    "name": "Palau Territorial Sea Zone (12 Nautical Miles)",
    "url": "https://pacificdata.org/data/dataset/palau-territorial-sea-zone-12-nautical-miles"
}