{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/hamylton2014awill-coral-islands-maintain-their-growth-over-the-next-century-a-deterministic-mod",
    "@type": "Dataset",
    "description": "A geomorphic assessment of reef system calcification is conducted for past (3200 Ka to present), present and future (2010-2100) time periods. Reef platform sediment production is estimated at 569 m3 yr-1 using rate laws that express gross community carbonate production as a function of seawater aragonite saturation, community composition and rugosity and incorporating estimates of carbonate removal from the reef system. Key carbonate producers including hard coral, crustose coralline algae and Halimeda are mapped accurately (mean R2 = 0.81). Community net production estimates correspond closely to independent census-based estimates made in-situ (R2 = 0.86). Reef-scale outputs are compared with historic rates of production generated from (i) radiocarbon evidence of island deposition initiation around 3200 years ago, and (ii) island volume calculated from a high resolution island digital elevation model. Contemporary carbonate production rates appear to be remarkably similar to historical values of 573 m3 yr-1. Anticipated future seawater chemistry parameters associated with an RCP8.5 emissions scenario are employed to model rates of net community calcification for the period 2000-2100 on the basis of an inorganic aragonite precipitation law, under the assumption of constant benthic community character. Simulations indicate that carbonate production will decrease linearly to a level of 118 m3 yr-1 by 2100 and that by 2150 aragonite saturation levels may no longer support the positive budgetary status necessary to sustain island accretion. Novel aspects of this assessment include the development of rate law parameters to realistically represent the variable composition of coral reef benthic carbonate producers, incorporation of three dimensional rugosity of the entire reef platform and the coupling of model outputs with both historical radiocarbon dating evidence and forward hydrochemical projections to conduct an assessment of island evolution through time. By combining several lines of evidence in a deterministic manner, an assessment of changes in carbonate production is carried out that has tangible geomorphic implications for sediment availability and associated island evolution.",
    "keywords": "algae, biological-response, brcommunity, calcification, communitymodeling, corals, field, modeling, ocean-acidification, south-pacific",
    "name": "Will coral islands maintain their growth over the next century? A deterministic model of sediment availability at Lady Elliot Island, Great Barrier Reef",
    "url": "https://pacificdata.org/data/dataset/hamylton2014awill-coral-islands-maintain-their-growth-over-the-next-century-a-deterministic-mod"
}