{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/gimenez2018aocean-acidification-stress-index-for-shellfish-oasis-linking-pacific-oyster-larval-",
    "@type": "Dataset",
    "description": "Understanding larval bivalve responses to variable regimes of seawater carbonate chemistry requires realistic quantification of physiological stress. Based on a degree-day modeling approach, we developed a new metric, the ocean acidification stress index for shellfish (OASIS), for this purpose. OASIS integrates over the entire larval period the instantaneous stress associated with deviations from published sensitivity thresholds to aragonite saturation state ($Ømega$Ar) while experiencing variable carbonate chemistry. We measured survival to D-hinge and pre-settlement stage of four Pacific oyster (Crassostrea gigas) cohorts with different histories of carbonate chemistry exposure at the Whiskey Creek Hatchery, Netarts Bay, OR, to test the utility of OASIS as a stress metric and document the effects of buffering seawater in mitigating acute and chronic exposure to ocean acidification. Each cohort was divided into four groups and reared under the following conditions: 1) stable, buffered seawater for the entire larval period; 2) stable, buffered seawater for the first 48 hours, then naturally variable, unbuffered seawater; 3) stable, unbuffered seawater for the first 48 hours, then buffered seawater; and 4) stable, unbuffered seawater for the first 48 hours, then naturally variable, unbuffered seawater. Patterns in Netarts Bay carbonate chemistry were dominated by seasonal upwelling at the time of the experimental work, resulting in naturally highly variable $Ømega$Ar for the larvae raised in the unbuffered treatments. Two of the four cohorts showed strongly positive responses to buffering in survival to 48 hours; three of the four, in survival to pre-settlement. OASIS accurately predicted survival for two of the three cohorts tested (the fourth excluded due to other environmental factors), suggesting that this new metric could be used to better understand larval bivalve survival in naturally variable environments. OASIS may also be useful to an array of diverse stakeholders with increasing access to highly resolved temporal measurements of carbonate chemistry.",
    "keywords": "biological-response, chemistry, laboratory, methods, mollusks, mortality, north-pacific, ocean-acidification",
    "name": "Ocean acidification stress index for shellfish (OASIS): Linking Pacific oyster larval survival and exposure to variable carbonate chemistry regimes",
    "url": "https://pacificdata.org/data/dataset/gimenez2018aocean-acidification-stress-index-for-shellfish-oasis-linking-pacific-oyster-larval-"
}