{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/viviani2018athe-influence-of-abrupt-increases-in-seawater-pco2-on-plankton-productivity-in-the-",
    "@type": "Dataset",
    "description": "We conducted a series of experiments to examine short-term (2-5 days) effects of abrupt increases in the partial pressure of carbon dioxide (pCO2) in seawater on rates of primary and bacterial production at Station ALOHA (22°45' N, 158° W) in the North Pacific Subtropical Gyre (NPSG). The majority of experiments (8 of 10 total) displayed no response in rates of primary production (measured by 14C-bicarbonate assimilation; 14C-PP) under elevated pCO2 (̃1100 $μ$atm) compared to ambient pCO2 (\\̃387 $μ$atm). In 2 of 10 experiments, rates of 14C-PP decreased significantly (\\~̃43%) under elevated pCO2 treatments relative to controls. Similarly, no significant differences between treatments were observed in 6 of 7 experiments where bacterial production was measured via incorporation of 3H-leucine (3H-Leu), while in 1 experiment, rates of 3H-Leu incorporation measured in the dark (3H-LeuDark) increased more than 2-fold under high pCO2 conditions. We also examined photoperiod-length, depth-dependent (0-125 m) responses in rates of 14C-PP and 3H-Leu incorporation to abrupt pCO2 increases (to \\~7̃50 $μ$atm). In the majority of these depth-resolved experiments (4 of 5 total), rates of 14C-PP demonstrated no consistent response to elevated pCO2. In 2 of 5 depth-resolved experiments, rates of 3H-LeuDark incorporation were lower (10% to 15%) under elevated pCO2 compared to controls. Our results revealed that rates of 14C-PP and bacterial production in this persistently oligotrophic habitat generally demonstrated no or weak responses to abrupt changes in pCO2. We postulate that any effects caused by changes in pCO2 may be masked or outweighed by the role that nutrient availability and temperature play in controlling metabolism in this ecosystem.",
    "keywords": "biological-response, brcommunity, field, laboratory, north-pacific, ocean-acidification, photosynthesis, phytoplankton, primary-production, prokaryotes",
    "name": "The influence of abrupt increases in seawater pCO2 on plankton productivity in the subtropical North Pacific Ocean",
    "url": "https://pacificdata.org/data/dataset/viviani2018athe-influence-of-abrupt-increases-in-seawater-pco2-on-plankton-productivity-in-the-"
}