{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-about-pacific-girl",
    "@type": "Dataset",
    "description": "This document provides details about the Australian Government’s investment in supporting adolescent girls in the Pacific. It includes information about: \r\n\r\n- The funded implementing partner’s initiatives: \r\n - In the Federated States of Micronesia, Chuuk Women’s Council will reach 150 marginalised girls through a young women’s empowerment course. \r\n - In Fiji, the Fiji Women’s Rights Movement’s Girls Arise program will work with girls aged 10–12 to build their life skills and confidence. \r\n - In Papua New Guinea, Equal Playing Field’s Safe Schools, Strong Communities program seeks to reduce violence by educating girls and boys about the importance of respectful relationships, using sport as an entry point. \r\n - In Solomon Islands, YWCA’s Girls Rise Up! project in partnership with CARE International, will reach 200 at-risk girls to develop their confidence, skills and knowledge and establish supportive peer networks. \r\n - In Tonga, the Talitha Project’s My Body! My Rights! program will improve community perceptions of girls’ value, amplify girls’ voices through creative media and train girls on health, sex and sexuality education and self-esteem. \r\n - In Vanuatu, CARE’s ‘Laef blo mi, vois blo mi’ program will provide life skills and respectful relationships education to younger adolescents in schools. \r\n\r\n- The regional components of the program. \r\n\r\n- The background to the development of the program, including what adolescent Pacific girls had to say about the issues they face.",
    "keywords": "Education, Health, development-programming, enhancing-agency, heman-rights, leadership-and-politics, pacific-girls, pacific-women, social-media-and-popular-culture, social-norms, violence",
    "name": "About Pacific Girl",
    "url": "https://pacificdata.org/data/dataset/pwl-about-pacific-girl"
}