{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/okey2014effects-of-climate-change-on-canadas-pacific-marine-ecosystems-a-summary-of-scientific-",
    "@type": "Dataset",
    "description": "The marine life of Canada's Pacific marine ecosystems, adjacent to the province of British Columbia, may be relatively responsive to rapid oceanographic and environmental change associated with global climate change due to uniquely evolved plasticities and resiliencies as well as particular sensitivities and vulnerabilities, given this dynamic and highly textured natural setting. These marine ecosystems feature complex interfaces of coastal geomorphology, climate, and oceanography, including a dynamic oceanographic and ecological transition zone formed by the divergence of the North Pacific Current into the Alaskan coastal current and the California Current, and by currents transporting warm tropical waters from the south. Despite long-term warming in the region, sea surface temperatures in Canada's Pacific have been anomalously cool since 2007 with La Niña-type conditions prevailing as we enter a cool phase of the Pacific Decadal Oscillation, possibly masking future warming. When warmer El Niño conditions prevail, many southern species invade, strongly impacting local species and reorganizing biological communities. Acidification and deoxygenation are anomalously high in the region due to the weakening ventilation of subsurface waters resulting from increased stratification. A broad spectrum of biological responses to these changes are expected. Non-climate anthropogenic stressors affect the capacity of biota to adapt to climate changes. It will be challenging to forecast the responses of particular species, and to map climate vulnerabilities accurately enough to help prioritize and guide adaptation planning. It will be more challenging to develop forecasts that account for indirect effects within biological communities and the intricate and apparently non-deterministic behaviours of highly complex and variable marine ecosystems, such as those of Canada's Pacific. We recommend and outline national and regional climate assessments in Canada and adaptation planning and implementation including integrated coastal management and marine spatial planning and management. Reviews in Fish Biology and Fisheries Reviews in Fish Biology and Fisheries ",
    "keywords": "north-pacific, ocean-acidification, review",
    "name": "Effects of climate change on Canada's Pacific marine ecosystems: a summary of scientific knowledge",
    "url": "https://pacificdata.org/data/dataset/okey2014effects-of-climate-change-on-canadas-pacific-marine-ecosystems-a-summary-of-scientific-"
}