{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-pacific-girl-international-day-of-persons-with-disabilities-2020-clera-tegu-solomon-islands",
    "@type": "Dataset",
    "description": "‘Attending trainings, I know that my actions speak louder. I am standing here as a deaf person to show you that having many skills has changed my life and I can contribute to my family’s income,’ shares Clera Tegu.\r\nAs part of commemorations for International Day of Persons with Disabilities, Pacific Women through Pacific Girl is proud to present this video featuring Ms Tegu. She is one of the many girls in the Solomon Islands who are being supported to develop their confidence, skills and knowledge through the Young Women’s Christian Association’s (YWCA) Girls Rise Up! program.\r\nThrough Girls Rise Up! Ms Tegu attended life skills training and is now able to earn an income to support herself and her family.\r\nAll girls have the right to realise their full potential and Pacific Girl partners across the Pacific, including the YWCA Solomon Islands, are working to turn girls’ aspirations into their lived realities.\r\nSupported by Pacific Girl, Girls Rise Up! is led by the Young Women’s Christian Association (YWCA) in partnership with CARE International. It is one of six Pacific Girl initiatives around the region, focusing on the needs of adolescent girls in all their diversity including girls with disabilities.\r\nPacific Girl is a $4.5million multi-country program which is managed under the Pacific Women.",
    "keywords": "audio-visual, gender-and-youth, pacific-girls, pacific-women, social-norms",
    "name": "Pacific Girl & International Day of Persons with Disabilities (2020): Clera Tegu, Solomon Islands",
    "url": "https://pacificdata.org/data/dataset/pwl-pacific-girl-international-day-of-persons-with-disabilities-2020-clera-tegu-solomon-islands"
}