{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/silbiger2018anutrient-pollution-disrupts-key-ecosystem-functions-on-coral-reefs",
    "@type": "Dataset",
    "description": "There is a long history of examining the impacts of nutrient pollution and pH on coral reefs. However, little is known about how these two stressors interact and influence coral reef ecosystem functioning. Using a six-week nutrient addition experiment, we measured the impact of elevated nitrate (NO−3) and phosphate (PO3−4) on net community calcification (NCC) and net community production (NCP) rates of individual taxa and combined reef communities. Our study had four major outcomes: (i) NCC rates declined in response to nutrient addition in all substrate types, (ii) the mixed community switched from net calcification to net dissolution under medium and high nutrient conditions, (iii) nutrients augmented pH variability through modified photosynthesis and respiration rates, and (iv) nutrients disrupted the relationship between NCC and aragonite saturation state documented in ambient conditions. These results indicate that the negative effect of NO−3 and PO3−4 addition on reef calcification is likely both a direct physiological response to nutrients and also an indirect response to a shifting pH environment from altered NCP rates. Here, we show that nutrient pollution could make reefs more vulnerable to global changes associated with ocean acidification and accelerate the predicted shift from net accretion to net erosion.",
    "keywords": "biological-response, brcommunity, calcification, corals, dissolution, laboratory, north-pacific, nutrients, ocean-acidification, photosynthesis, primary-production, respiration",
    "name": "Nutrient pollution disrupts key ecosystem functions on coral reefs",
    "url": "https://pacificdata.org/data/dataset/silbiger2018anutrient-pollution-disrupts-key-ecosystem-functions-on-coral-reefs"
}