{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/achlatis2017sponge-bioerosion-on-changing-reefs-ocean-warming-poses-physiological-constraints-t",
    "@type": "Dataset",
    "description": "Excavating sponges are prominent bioeroders on coral reefs that in comparison to other benthic organisms may suffer less or may even benefit from warmer, more acidic and more eutrophic waters. Here, the photosymbiotic excavating sponge Cliona orientalis from the Great Barrier Reef was subjected to a prolonged simulation of both global and local environmental change: future seawater temperature, partial pressure of carbon dioxide (as for 2100 summer conditions under \"business-as-usual\" emissions), and diet supplementation with particulate organics. The individual and combined effects of the three factors on the bioerosion rates, metabolic oxygen and carbon flux, biomass change and survival of the sponge were monitored over the height of summer. Diet supplementation accelerated bioerosion rates. Acidification alone did not have a strong effect on total bioerosion or survival rates, yet it co-occurred with reduced heterotrophy. Warming above 30 °C (+2.7 °C above the local maximum monthly mean) caused extensive bleaching, lower bioerosion, and prevailing mortality, overriding the other factors and suggesting a strong metabolic dependence of the sponge on its resident symbionts. The growth, bioerosion capacity and likelihood of survival of C. orientalis and similar photosymbiotic excavating sponges could be substantially reduced rather than increased on end-of-the-century reefs under \"business-as-usual\" emission profiles.",
    "keywords": "biological-response, dissolution, laboratory, morphology, mortality, multiple-factors, nutrients, ocean-acidification, physiology, porifera, south-pacific, temperature",
    "name": "Sponge bioerosion on changing reefs: ocean warming poses physiological constraints to the success of a photosymbiotic excavating sponge",
    "url": "https://pacificdata.org/data/dataset/achlatis2017sponge-bioerosion-on-changing-reefs-ocean-warming-poses-physiological-constraints-t"
}