{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/cripps2011ocean-acidification-affects-prey-detection-by-a-predatory-reef-fish",
    "@type": "Dataset",
    "description": "Changes in olfactory-mediated behaviour caused by elevated CO2 levels in the ocean could affect recruitment to reef fish populations because larval fish become more vulnerable to predation. However, it is currently unclear how elevated CO2 will impact the other key part of the predator-prey interaction – the predators. We investigated the effects of elevated CO2 and reduced pH on olfactory preferences, activity levels and feeding behaviour of a common coral reef meso-predator, the brown dottyback (Pseudochromis fuscus). Predators were exposed to either current-day CO2 levels or one of two elevated CO2 levels (̃600 µatm or \\̃950 µatm) that may occur by 2100 according to climate change predictions. Exposure to elevated CO2 and reduced pH caused a shift from preference to avoidance of the smell of injured prey, with CO2 treated predators spending approximately 20% less time in a water stream containing prey odour compared with controls. Furthermore, activity levels of fish was higher in the high CO2 treatment and feeding activity was lower for fish in the mid CO2 treatment; indicating that future conditions may potentially reduce the ability of the fish to respond rapidly to fluctuations in food availability. Elevated activity levels of predators in the high CO2 treatment, however, may compensate for reduced olfactory ability, as greater movement facilitated visual detection of food. Our findings show that, at least for the species tested to date, both parties in the predator-prey relationship may be affected by ocean acidification. Although impairment of olfactory-mediated behaviour of predators might reduce the risk of predation for larval fishes, the magnitude of the observed effects of elevated CO2 acidification appear to be more dramatic for prey compared to predators. Thus, it is unlikely that the altered behaviour of predators is sufficient to fully compensate for the effects of ocean acidification on prey mortality.  ",
    "keywords": "101594pangaea779705, biological-response, fish, laboratory, oaiccdb, ocean-acidification, performance, south-pacific",
    "name": "Ocean acidification affects prey detection by a predatory reef fish",
    "url": "https://pacificdata.org/data/dataset/cripps2011ocean-acidification-affects-prey-detection-by-a-predatory-reef-fish"
}