{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/turi2016climatic-modulation-of-recent-trends-in-ocean-acidification-in-the-california-current-s",
    "@type": "Dataset",
    "description": "  We reconstruct the evolution of ocean acidification in the California Current System (CalCS) from 1979 through 2012 using hindcast simulations with an eddy-resolving ocean biogeochemical model forced with observation-based variations of wind and fluxes of heat and freshwater. We find that domain-wide pH and \\$\\\\\\backslashrm\\\\backslashOmega \\\\\\_\\\\backslashmathrm\\arag\\\\\\$ in the top 60 m of the water column decreased significantly over these three decades by about −0.02 decade−1 and −0.12 decade−1, respectively. In the nearshore areas of northern California and Oregon, ocean acidification is reconstructed to have progressed much more rapidly, with rates up to 30% higher than the domain-wide trends. Furthermore, ocean acidification penetrated substantially into the thermocline, causing a significant domain-wide shoaling of the aragonite saturation depth of on average −33 m decade−1 and up to −50 m decade−1 in the nearshore area of northern California. This resulted in a coast-wide increase in nearly undersaturated waters and the appearance of waters with \\$\\\\\\backslashrm\\\\backslashOmega \\\\\\_\\\\backslashmathrm\\arag\\\\\\backslashlt 1\\$, leading to a substantial reduction of habitat suitability.  Averaged over the whole domain, the main driver of these trends is the oceanic uptake of anthropogenic CO2 from the atmosphere. However, recent changes in the climatic forcing have substantially modulated these trends regionally. This is particularly evident in the nearshore regions, where the total trends in pH are up to 50% larger and trends in \\$\\\\\\backslashrm\\\\backslashOmega \\\\\\_\\\\backslashmathrm\\arag\\\\\\$ and in the aragonite saturation depth are even twice to three times larger than the purely atmospheric CO2-driven trends. This modulation in the nearshore regions is a result of the recent marked increase in alongshore wind stress, which brought elevated levels of dissolved inorganic carbon to the surface via upwelling. Our results demonstrate that changes in the climatic forcing need to be taken into consideration in future projections of the progression of ocean acidification in coastal upwelling regions. ",
    "keywords": "chemistry, modeling, north-pacific, ocean-acidification, regionalmodeling",
    "name": "Climatic modulation of recent trends in ocean acidification in the California Current System",
    "url": "https://pacificdata.org/data/dataset/turi2016climatic-modulation-of-recent-trends-in-ocean-acidification-in-the-california-current-s"
}