{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/cook-islands-contiguous-zone",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((191.47640881731311 -25.30537679530272, 191.47640881731311 -5.800505555686755, 205.19444444445585 -5.800505555686755, 205.19444444445585 -25.30537679530272, 191.47640881731311 -25.30537679530272))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "The Maritime Zones Act (MZA) 2018 for Cooks Islands repeals the Territorial Sea and Exclusive Economic Zone Act 1977, (Act No. 16 of 14 November 1977). It states that the contiguous sea comprises of those areas of the sea that are beyond and adjacent to the territorial sea having, as their outer limits, a line measured seaward from the territorial sea baseline, every point of which is distant 24 nautical miles from the nearest point of the baseline.\r\n\r\nThe Maritime Zones (Contiguous Zone Outer Limits) Regulations 2020, in accordance with MZA 2018, prescribes lines generated by reference to points with geographical coordinates which specifies the outer limits of the contiguous sea. In this regulation, points defined by geographic coordinates are determined by reference to the World Geodetic System 1984 (WGS 84). The regulation contains charts as a general illustration of the lines specified within it. Within the contiguous zone –\r\n\r\nAny authorized officer of the Government of the Cook Islands may exercise the control necessary to prevent infringement of the customs, fiscal, immigration, or sanitary laws within the Cook Islands or the territorial sea; and Any court or other judicial authority may punish any infringement of the customs, fiscal, immigration, or sanitary laws committed with the Cooks Islands or territorial sea. All relevant laws of the Cook Islands extend to the contiguous zone accordingly.\r\n\r\nhttps://www.un.org/depts/los/LEGISLATIONANDTREATIES/PDFFILES/02MartimeZonesCZOLRegs2020.pdf https://www.un.org/depts/los/LEGISLATIONANDTREATIES/PDFFILES/Maritime%20Zones%20Act%202018.pdf\r\n\r\n ",
    "keywords": "24M, CK, CZZ, Contiguous Zone, Cook Islands, Cook Islands Contiguous Zone",
    "name": "Cook Islands Contiguous Zone (24 Nautical Miles)",
    "url": "https://pacificdata.org/data/dataset/cook-islands-contiguous-zone"
}