{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/kram2016avariable-responses-of-temperate-calcified-and-fleshy-macroalgae-to-elevated-co2-and-wa",
    "@type": "Dataset",
    "description": "Anthropogenic carbon dioxide (CO2) emissions simultaneously increase ocean temperatures and reduce ocean surface pH, a process termed ocean acidification (OA). OA is expected to negatively affect the growth and physiology of many calcified organisms, but the response of non-calcified (fleshy) organisms is less well understood. Rising temperatures and pCO2 can enhance photosynthetic rates (within tolerance limits). Therefore, warming may interact with OA to alter biological responses of macroalgae in complicated ways. Beyond thresholds of physiological tolerance, however, rising temperatures could further exacerbate negative responses to OA. Many studies have investigated the effects of OA or warming independently of each other, but few studies have quantified the interactive effects of OA and warming on marine organisms. We conducted four short-term independent factorial CO2 enrichment and warming experiments on six common species of calcified and fleshy macroalgae from southern California to investigate the independent and interactive effects of CO2 and warming on growth, carbonic anhydrase (CA) enzyme activity, pigment concentrations, and photosynthetic efficiency. There was no effect of elevated pCO2 on CA activity, pigment concentration, and photosynthetic efficiency in the macroalgal species studies. However, we found that calcareous algae suffered reduced growth rates under high pCO2 conditions alone, although the magnitude of the effect varied by species. Fleshy algae had mixed responses of growth rates to high pCO2, indicating that the effects of pCO2 enrichment are inconsistent across species. The combined effects of elevated pCO2 and warming had a significantly negative impact on growth for both fleshy and calcareous algae; calcareous algae experienced five times more weight loss than specimens in ambient control conditions and fleshy growth was reduced by 76%. Our results demonstrate the need to study the interactive effects of multiple stressors associated with global change on marine communities. ",
    "keywords": "algae, biological-response, growth, laboratory, morphology, multiple-factors, north-pacific, oaiccnoanswer, ocean-acidification, photosynthesis, physiology, temperature",
    "name": "Variable responses of temperate calcified and fleshy macroalgae to elevated CO2 and warming",
    "url": "https://pacificdata.org/data/dataset/kram2016avariable-responses-of-temperate-calcified-and-fleshy-macroalgae-to-elevated-co2-and-wa"
}