{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-pacific-women-s-leadership-scoping-study",
    "@type": "Dataset",
    "description": "Outside of national politics, Pacific women are often visible as leaders. The study found that Pacific women from places as far afield as Bougainville and Samoa are leaders in diverse fields including local government, civil service, private business, and civil society. \n\nLeadership in Pacific women’s lives does not fit nicely into one category. Few women in the study were only leaders in local government or in business. For most of the women in the study, leadership began at an early age and continues to be expressed across many areas of their lives, for example within their extended family or in their church. These spaces and women’s roles within them need to be considered when planning initiatives to support Pacific women leaders. \n\nLocal government in Bougainville and the Solomon Islands is already an important entry point for women’s political leadership. Both countries have women elected into local government. The example of Bougainville is especially important because it has had its own indigenous special measures in place for women in politics since independence. Their experiences can be used to better understand how women can enter politics and also may be a stepping-stone into other types of leadership. \n\nAcross most of the countries, critical women actors are already working together and with certain men, to successfully lobby for policy and legislative reform at national and local levels. This type of work may be carried out discreetly through informal networks as in the Solomon Islands or openly through formal networks as in Samoa with WinLa. \n\nCulture is often cited as a barrier for women’s leadership in the Pacific. In some cases, culture does seem to be a real barrier for women and men to support women leaders. But such a view of Pacific cultures may be too rigid to be true in all situations. Many Pacific women do use or see potential to use culture to access spaces of leadership or to gain changes in policy, practice or legislation that substantively support women’s rights.",
    "keywords": "autonomous-region-of-bougainville, development-programming, leadership-and-decision-making-research-report, leadership-and-politics, pacific-women, socal-norms",
    "name": "Pacific Women’s Leadership Scoping Study",
    "url": "https://pacificdata.org/data/dataset/pwl-pacific-women-s-leadership-scoping-study"
}