{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/kurihara2007aeffects-of-increased-seawater-pco2-on-early-development-of-the-oyster-crassostrea-",
    "@type": "Dataset",
    "description": "This study demonstrated that the increased partial pressure of CO2 (pCO2) in seawater and the attendant acidification that are projected to occur by the year 2300 will severely impact the early development of the oyster Crassostrea gigas. Eggs of the oyster were artificially fertilized and incubated for 48 h in seawater acidified to pH 7.4 by equilibrating it with CO2-enriched air (CO2 group), and the larval morphology and degree of shell mineralization were compared with the control treatment (air-equilibrated seawater). Only 5% of the CO2 group developed into normal ?D-shaped? veliger larvae as compared with 68% in the control group, although no difference was observed between the groups up to the trochophore stage. Thus, during embryogenesis, the calcification process appears to be particularly affected by low pH and/or the low CaCO3 saturation state of high-CO2 seawater. Veliger larvae with fully mineralized shells accounted for 30% of the CO2-group larvae, compared with 72% in the control (p \\textless 0.005). Shell mineralization was completely inhibited in 45% of the CO2-group larvae, but only in 16% of the control (p \\textless 0.05). Normal D-shaped veligers of the control group exhibited increased shell length and height between 24 and 48 h after fertilization, while the few D-shaped veligers of the CO2 group showed no shell growth during the same period. Our results suggest that future ocean acidification will have deleterious impacts on the early development of marine benthic calcifying organisms.",
    "keywords": "101594pangaea721193, biological-response, laboratory, mollusks, morphology, north-pacific, oaiccdb, ocean-acidification",
    "name": "Effects of increased seawater pCO2 on early development of the oyster Crassostrea gigas",
    "url": "https://pacificdata.org/data/dataset/kurihara2007aeffects-of-increased-seawater-pco2-on-early-development-of-the-oyster-crassostrea-"
}