{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/parker2015apersistence-of-positive-carryover-effects-in-the-oyster-saccostrea-glomerata-followi",
    "@type": "Dataset",
    "description": "Ocean acidification (OA) is predicted to have widespread implications for marine organisms, yet the capacity for species to acclimate or adapt over this century remains unknown. Recent transgenerational studies have shown that for some marine species, exposure of adults to OA can facilitate positive carryover effects to their larval and juvenile offspring that help them to survive in acidifying oceanic conditions. But whether these positive carryover effects can persist into adulthood or the next generation is unknown. Here we tested whether positive carryover effects found in larvae of the oyster, Saccostrea glomerata following transgenerational exposure to elevated CO2, could persist into adulthood and whether subsequent transgenerational exposure of adults to elevated CO2 would facilitate similar adaptive responses in the next generation of larvae and juveniles. Following our previous transgenerational exposure of parental adults and first generation (F1) larvae to ambient (385 $μ$atm) and elevated (856 $μ$atm) CO2, newly settled F1 juveniles were transferred to the field at ambient CO2 for 14 months, until they reached reproductive maturity. At this time, the F1 adults were returned to the laboratory and the previous transgenerational CO2 exposure was repeated to produce F2 offspring. We found that the capacity of adults to regulate extracellular pH at elevated CO2 was improved if they had a prior history of transgenerational exposure to elevated CO2. In addition, subsequent transgenerational exposure of these adults led to an increase in the resilience of their larval and juvenile offspring. Offspring with a history of transgenerational exposure to elevated CO2 had a lower percentage abnormality, faster development rate, faster shell growth and increased heart rate at elevated CO2 compared with F2 offspring with no prior history of exposure to elevated CO2. Our results suggest that positive carryover effects originating during parental and larval exposure will be important in mediating some of the impacts of OA for later life-history stages and generations.",
    "keywords": "biological-response, laboratory, mollusks, morphology, mortality, oaiccnoanswer, ocean-acidification, physiology, south-pacific",
    "name": "Persistence of positive carryover effects in the oyster, Saccostrea glomerata, following transgenerational exposure to ocean acidification",
    "url": "https://pacificdata.org/data/dataset/parker2015apersistence-of-positive-carryover-effects-in-the-oyster-saccostrea-glomerata-followi"
}