{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/sutton2016using-present-day-observations-to-detect-when-anthropogenic-change-forces-surface-oce",
    "@type": "Dataset",
    "description": "One of the major challenges to assessing the impact of ocean acidification on marine life is detecting and interpreting long-term change in the context of natural variability. This study addresses this need through a global synthesis of monthly pH and aragonite saturation state ($Ømega$arag) climatologies for 12 open ocean, coastal, and coral reef locations using 3-hourly moored observations of surface seawater partial pressure of CO2 and pH collected together since as early as 2010. Mooring observations suggest open ocean subtropical and subarctic sites experience present-day surface pH and $Ømega$arag conditions outside the bounds of preindustrial variability throughout most, if not all, of the year. In general, coastal mooring sites experience more natural variability and thus, more overlap with preindustrial conditions; however, present-day $Ømega$arag conditions surpass biologically relevant thresholds associated with ocean acidification impacts on Mytilus californianus ($Ømega$arag \\textless 1.8) and Crassostrea gigas ($Ømega$arag \\textless 2.0) larvae in the California Current Ecosystem (CCE) and Mya arenaria larvae in the Gulf of Maine ($Ømega$arag \\textless 1.6). At the most variable mooring locations in coastal systems of the CCE, subseasonal conditions approached $Ømega$arag =  1. Global and regional models and data syntheses of ship-based observations tended to underestimate seasonal variability compared to mooring observations. Efforts such as this to characterize all patterns of pH and $Ømega$arag variability and change at key locations are fundamental to assessing present-day biological impacts of ocean acidification, further improving experimental design to interrogate organism response under real-world conditions, and improving predictive models and vulnerability assessments seeking to quantify the broader impacts of ocean acidification.",
    "keywords": "chemistry, field, indian, north-atlantic, north-pacific, ocean-acidification",
    "name": "Using present-day observations to detect when anthropogenic change forces surface ocean carbonate chemistry outside preindustrial bounds",
    "url": "https://pacificdata.org/data/dataset/sutton2016using-present-day-observations-to-detect-when-anthropogenic-change-forces-surface-oce"
}