{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/griffith2011aeffects-of-fishing-and-acidification-related-benthic-mortality-on-the-southeast-au",
    "@type": "Dataset",
    "description": "Oceanic uptake of anthropogenic carbon dioxide (CO2) is altering the carbonate chemistry of seawater, with potentially negative consequences for many calcifying marine organisms. At the same time, increasing fisheries exploitation is impacting on marine ecosystems. Here, using increased benthic-invertebrate mortality as a proxy for effects of ocean acidification, the potential impact of the two stressors of fishing and acidification on the southeast Australian marine ecosystem to year 2050 was explored. The individual and interaction effects of the two stressors on biomass and diversity were examined for the entire ecosystem and for regional assemblages. For 61 functional groups or species, the cumulative effects of moderate ocean acidification and fishing were additive (30%), synergistic (33%), and antagonistic (37%). Strong ocean acidification resulted in additive (22%), synergistic (40%), and antagonistic (38%) effects. The greatest impact was on the demersal food web, with fishing impacting predation and acidification affecting benthic production. Areas that have been subject to intensive fishing were the most susceptible to acidification effect, although fishing also mitigated some of the decline in biodiversity observed with moderate acidification. The model suggested that ocean acidification and long-term fisheries exploitation could act synergistically with the increasing sensitivity to change from long-term (decades) fisheries exploitation potentially causing unexpected restructuring of the pelagic and demersal food webs. Major regime shifts occur around year 2040. Greater focus is needed on how differential fisheries exploitation of marine resources may exacerbate or accelerate effects of environmental changes such as ocean acidification. ",
    "keywords": "abundance, biological-response, brcommunity, community-composition, fishing-pressure, modeling, multiple-factors, ocean-acidification, otherprocess, regionalmodeling, south-pacific",
    "name": "Effects of fishing and acidification-related benthic mortality on the southeast Australian marine ecosystem",
    "url": "https://pacificdata.org/data/dataset/griffith2011aeffects-of-fishing-and-acidification-related-benthic-mortality-on-the-southeast-au"
}