{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-due-diligence-and-state-responsibility-to-end-violence-against-women-standards-indicators-and-go",
    "@type": "Dataset",
    "description": "The project aims to add content to the international legal principle of due diligence in the context of state responsibility to end violence against women. It seeks to create compliance indicators that are concrete and measurable across regions. The project examines four questions: \n\n- What is generally understood to be the content of the due diligence principle - by governments, civil society advocates, and international legal scholars and experts working on violence against women? \n\n- How can compliance with this obligation be monitored, assessed and evaluated – by governments, civil society advocates and international legal scholars and experts working on violence against women? \n\n- How are States complying with their due diligence obligation to prevent, protect against, prosecute, punish and provide redress for acts of violence against women? \n\n- What are good practices to eliminate violence against women, globally and regionally? \n\nThe global component consists of literature review, which focus on studying the development and evolution of the due diligence principle in international law and how it is being commonly applied today. It also looks at the context of violence against women, its historical roots of exclusion and invisibility in the human rights discourse, as well as its later recognition as a violation of human rights. The global component was further strengthened by an expert meeting held in 2011, in Boston USA. The meeting brought together a wide array of experts from around the world, and from various disciplines and fields (e.g. law, sociology, academia, civil society, and inter-governmental). \n\nThe regional component seeks to provide primary data and regional specificities that cannot be captured at the global level.",
    "keywords": "development-programming, ending-violence-against-women, pacific-women, research-report, violence",
    "name": "Due Diligence and State Responsibility to End Violence Against Women: Standards, Indicators and Good Practices",
    "url": "https://pacificdata.org/data/dataset/pwl-due-diligence-and-state-responsibility-to-end-violence-against-women-standards-indicators-and-go"
}