{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-pacific-women-gender-equality-and-social-inclusion-indicators",
    "@type": "Dataset",
    "description": "The COVID-19 pandemic has impacts beyond people’s health that affect different aspects of day-to-day life. All people will be impacted in some way and must adapt to the pandemic, however men and women – or different groups of men and women – will not all be affected in the same ways. This is due to women and men play different roles and have different responsibilities in their homes and communities. \n\nWomen and girls are disproportionately impacted by crises. Women and girls are likely to: face even higher rates of domestic violence and sexual abuse; are more vulnerable to economic hardship as income generation activities women perform are disrupted; have increased unpaid in the household due to the closure of schools and have reduced access to essential health services. It is important to keep track of how all the different segments of the population are being affected by the COVID-19 pandemic and how mitigation measures are affecting people’s lives. This set of indicators has been developed to assist with that purpose. \n\nCOVID-19 response strategies that are gender responsive and socially inclusive to address the needs of women, youth, people with disabilities and other segments of the population who are more vulnerable. \n\nThe list of indicators is not mandatory nor exhaustive but, hopefully, helpful for people needing to track COVID-19 responses and impacts. The indicators cover seven areas: \n1. Health impacts of the COVID-19 pandemic.\n2. Participation of women, youth, and people with disability in decision making. \n3. Sexual and reproductive health. \n4. Domestic violence. \n5. Economic security. \n6. Food security. \n7. Unpaid care work.",
    "keywords": "Health, data, development-programming, economic-empowerment, ending-violence-against-women, enhancing-agency, land-sea-and-livelihoods, leadership-and-decision-making, leadership-and-politics, pacific-women, social-norms, violence",
    "name": "Pacific Women Gender Equality and Social Inclusion Indicators",
    "url": "https://pacificdata.org/data/dataset/pwl-pacific-women-gender-equality-and-social-inclusion-indicators"
}