{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/yara2016apotential-future-coral-habitats-around-japan-depend-strongly-on-anthropogenic-co2-emis",
    "@type": "Dataset",
    "description": "Using the results from the NCAR CSM1.4-coupled global carbon cycle–climate model under the Intergovernmental Panel on Climate Change (IPCC) emission scenarios SRES A2 and B1, we estimated the effects of both global warming and ocean acidification on the future habitats of corals in the seas around Japan during this century. As shown by Yara et al. (Biogeosciences 9:4955–4968, 2012), under the high-CO2-emission scenario (SRES A2), coral habitats will be sandwiched and narrowed between the northern region, where the saturation state of the carbonate mineral aragonite ($Ømega$arag) decreases, and the southern region, where coral bleaching occurs. We found that under the low-emission scenario SRES B1, the coral habitats will also shrink in the northern region by the reduced $Ømega$arag but to a lesser extent than under SRES A2, and in contrast to SRES A2, no bleaching will occur in the southern region. Therefore, coral habitats in the southern region are expected to be largely unaffected by ocean acidification or surface warming under the low-emission scenario. Our results show that potential future coral habitats depend strongly on CO2 emissions and emphasize the importance of reducing CO2 emissions to prevent negative impacts on coral habitats.",
    "keywords": "abundance, biological-response, brcommunity, chemistry, corals, modeling, multiple-factors, north-pacific, ocean-acidification, otherprocess, regionalmodeling, temperature",
    "name": "Potential future coral habitats around Japan depend strongly on anthropogenic CO2 emissions",
    "url": "https://pacificdata.org/data/dataset/yara2016apotential-future-coral-habitats-around-japan-depend-strongly-on-anthropogenic-co2-emis"
}