{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-evaluation-of-the-gender-equality-and-political-governance-project-gepg-",
    "@type": "Dataset",
    "description": "The overall goal of the Gender Equality in Political Governance program was to advance gender equality in political governance in the Pacific and its objective was to increase political participation by women as active citizens and leaders. Important strategies employed by the programme include building broad base support for women’s participation in political governance through the development of community-base level education and the introduction of temporary special measures. \n\nThe evaluation found that the program continues to be relevant in the Pacific Island countries context including Solomon Islands, Papua New Guinea and Vanuatu; and based on wide consultations to develop the program design, it identified relevant stakeholders (national women’s machineries, media, political parties, electoral commissions and male advocates) and strategic partnerships. The program has made important contribution towards increasing public support for gender equality in political governance for duty bearers and rights holders through BRIDGE trainings. This, however, must be complemented by other approaches to build capacity for sustainability. The evaluation notes that the impact of the program can only be realistically assessed over time. While it has made some progress towards the achievement of the programme goal the current overall impact is low. The program’s design incorporated sustainable strategy for results but the extent to which this was implemented was weak. \n\nThis report documents lessons learned and recommendations for future phases of the program.",
    "keywords": "Report, developmen-programming, enhancing-agency, leadership-and-decision-making, leadership-and-politics, pacific-women, social-norms",
    "name": "Evaluation of the Gender Equality and Political Governance Project (GEPG)",
    "url": "https://pacificdata.org/data/dataset/pwl-evaluation-of-the-gender-equality-and-political-governance-project-gepg-"
}