{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-vanuatu-national-survey-on-women-s-lives-and-family-relationships",
    "@type": "Dataset",
    "description": "The Vanuatu study shows that violence against women is prevalent: \n\n- Among women who have ever had an intimate sexual relationship with a partner, 60% experienced physical and/or sexual violence in their lifetime; 68% experienced emotional violence; 28% were subjected to several forms of control by their partner, 69% experienced at least one form of coercive control, and most of these were living with physical and sexual violence. \n\n- Violence by husbands/partners occurs in all provinces and islands, and among all age groups, education levels, socio-economic groups and religions. \n\n- 50 % of women believe that a good wife must obey her husband even if she disagrees with him. \n\n- 40% of women believe that the man should be the boss. \n\n- 53 % of women believe that a woman becomes a man’s property after bride price is paid and 36% of women agree that it is all right for a woman or girl to be swapped or exchanged for marriage. \n\n- 60% of women agree with at least 1 justification for a man to beat his wife: 34% believe that violence is justified if a wife is disobedient to her husband; 28% think it is all right for him to beat her to discipline her or teach her a lesson; and 32% believe that a man is justified in beating his wife if bride price has been paid. \n\n- Between 12% and 23% do not think they have the right to refuse sex in some situations, and 40% of women are unclear if they have the right to refuse sex if bride price has been paid. \n\n- 48% of women had experienced non-partner physical or sexual violence or both since they turned 15. Most non-partner physical abuse was by male family members. Most of the non-partner sexual abuse was by boyfriends or male family members. \n\n- The prevalence of sexual abuse against girls under the age of 15 is also one of the very highest in the world. Almost 30% of women were sexually abused before the age of 15 years. \n\n- For 28% of women, their first sexual experience was forced. \n\n- 24% of women have been injured in their lifetime due to violence from a partner. \n\n- 15% of all women who have ever been pregnant have been hit during the pregnancy, and 9% have been hit or kicked in the stomach. \n\nThe situations most commonly mentioned by women as triggers for violence are directly related to unequal gender power relations. Women reported that their partners hit them: \n\n- For no reason (30%). \n\n- Because they were disobedient or to discipline them (23%). \n\n- For refusing sex (15%). • Because there was no food at home (20%).",
    "keywords": "Health, data, ending-vioelnce-against-women, human-rights, pacific-women, research-report, social-norms, violence",
    "name": "Vanuatu National Survey on Women’s Lives and Family Relationships",
    "url": "https://pacificdata.org/data/dataset/pwl-vanuatu-national-survey-on-women-s-lives-and-family-relationships"
}