{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/tonga-2003-high-resolution-bathymetry-survey-technical-reports-2",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((180.91175116691318 -25.69605493118999, 180.91175116691318 -14.154640220669506, 188.69472222225298 -14.154640220669506, 188.69472222225298 -25.69605493118999, 180.91175116691318 -25.69605493118999))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "This report provides a technical description of the Tongan marine survey. Where multibeam data was collected for the two islands of Tongatapu and Niuafoou, this data set includes the Basin A area north of Nukualofa and a single beam survey of Tongatapu's Fangauta lagoon, as this was identified as major interest areas during a stakeholder consultation exercise conducted in late 2002 (SOPAC, 2002).SOPAC has implemented a project Reducing Vulnerability of Pacific ACP states with funding secured from the European Union (EDF8). A goal of the project is to provide a comprehensive GIS database containing information relating to three sectors of interests: aggregates for construction, water and sanitation and risks and hazards. Seabed maps are of potential use for all 3 sectors and consequently are a major activity within the project. With this in mind, SOPAC has acquired a Reson 8160 multibeam seabed mapping system. The system was installed on a charter vessel, and a marine survey of two islands of The Kingdom of Tonga, Tongatapu and Niuafo'ou was conducted separately. The survey of Tongatapu was conducted between the 13th November to the 7th December 2003, and Niuafo'ou Island was surveyed in transit to on the 29th and 30th January 2004.",
    "keywords": "tonga",
    "name": "Tonga, 2003, High-Resolution Bathymetry Survey Technical Reports #2",
    "url": "https://pacificdata.org/data/dataset/tonga-2003-high-resolution-bathymetry-survey-technical-reports-2"
}