{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/american-samoa-territorial-sea-12-nautical-mile",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((186.2253093499468 -17.555268752861593, 186.2253093499468 -10.024476331617223, 194.79916666680836 -10.024476331617223, 194.79916666680836 -17.555268752861593, 186.2253093499468 -17.555268752861593))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "The  Territorial Sea of the United States of America By the President of the United States of America A Proclamation of 27 December 1988  states the extension of the territorial sea of the United States of America, the Commonwealth of Puerto Rico, Guam, American Samoa, the United States Virgin Islands, the Commonwealth of the Northern Mariana Islands, and any other territory or possession over which the United States exercises sovereignty.\r\n\r\nThe territorial sea of the United States henceforth extends to 12 nautical miles from the baselines of the United States determined in accordance with international law. In accordance with international law, as reflected in the applicable provisions of the 1982 Convention on the Law of the Sea, within the territorial sea of the United States, the ships of all countries enjoy the right of innocent passage and the ships and aircraft of all countries enjoy the right of transit passage through international straits. Nothing in this Proclamation: (a) extends or otherwise alters existing federal or State law or any jurisdiction, rights, legal interests, or obligations derived therefrom, or (b) impairs the determination, in accordance with international law, of any maritime boundary of the United States with a foreign jurisdiction.\r\n\r\n\r\nhttps://www.un.org/depts/los/LEGISLATIONANDTREATIES/PDFFILES/USA_1988_Proclamation.pdf\r\n",
    "keywords": "12NM",
    "name": "American Samoa Territorial Sea (12 Nautical Mile)",
    "url": "https://pacificdata.org/data/dataset/american-samoa-territorial-sea-12-nautical-mile"
}