{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-thematic-brief-ending-discrimination-on-the-basis-of-sexuality-gender-identity-and-expression",
    "@type": "Dataset",
    "description": "In the Pacific, diverse populations contribute to Pacific communities at local and national levels, with their own preferred terms for people with diverse sexual orientations, gender identities and expressions, and sex characteristics (SOGIESC) including lesbian, gay, bisexual, trans or gender diverse, or intersex (LGBTI) people.\nThis Thematic Brief provides information and analysis about equality for people with diverse SOGIESC in the Pacific Islands region, also referencing the Pacific’s involvement in achieving the Sustainable Development Goals (SDGs) for which a key pillar is to “leave no one behind.” The SDGs recognise that to eradicate poverty and achieve sustainable development there is a need to address all people in society including marginalized groups and vulnerable populations, such as LGBTI people who may be discriminated based on their sexual orientation, gender identity and expression, and sex characteristics (SOGIESC).\nThe brief has been written for the Support Unit of Pacific Women Shaping Pacific Development (Pacific Women). The five key messages provide background to inclusion issues for people with diverse sexual orientations, gender identities and expressions, and sex characteristics (SOGIESC) in the Pacific.\nThe Thematic Brief sets out why Pacific Women is supporting people with diverse SOGIESC and women in all their diversity to enjoy their human rights and fully participate in their communities.\n1. People with diverse SOGIESC experience violence, harassment, discrimination, social stigma and poverty.\n2. Law reform is needed to end discrimination and criminalisation of people with diverse SOGIESC and to enable them to live free from discrimination and violence.\n3. Pacific Island countries have long had populations with diverse SOGIESC; in some countries people with diverse SOGIESC have specific cultural roles.\n4. People with diverse SOGIESC are particularly vulnerable during periods of disasters and emergencies including the COVID-19 pandemic.\n5. There is increasing momentum for SOGIESC equality, with leadership from diverse Pacific Islanders.",
    "keywords": "ending-violence-against-women, pacific-women, social-norms, thematic-brief",
    "name": "Thematic Brief: Ending discrimination on the basis of sexuality, gender identity and expression",
    "url": "https://pacificdata.org/data/dataset/pwl-thematic-brief-ending-discrimination-on-the-basis-of-sexuality-gender-identity-and-expression"
}