{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/hu2017cvariability-in-larval-gut-ph-regulation-defines-sensitivity-to-ocean-acidification-in-si",
    "@type": "Dataset",
    "description": "The unusual rate and extent of environmental changes due to human activities may exceed the capacity of marine organisms to deal with this phenomenon. The identification of physiological systems that set the tolerance limits and their potential for phenotypic buffering in the most vulnerable ontogenetic stages become increasingly important to make large-scale projections. Here, we demonstrate that the differential sensitivity of non-calcifying Ambulacraria (echinoderms and hemichordates) larvae towards simulated ocean acidification is dictated by the physiology of their digestive systems. Gastric pH regulation upon experimental ocean acidification was compared in six species of the superphylum Ambulacraria. We observed a strong correlation between sensitivity to ocean acidification and the ability to regulate gut pH. Surprisingly, species with tightly regulated gastric pH were more sensitive to ocean acidification. This study provides evidence that strict maintenance of highly alkaline conditions in the larval gut of Ambulacraria early life stages may dictate their sensitivity to decreases in seawater pH. These findings highlight the importance of identifying and understanding pH regulatory systems in marine larval stages that may contribute to substantial energetic challenges under near-future ocean acidification scenarios.",
    "keywords": "biological-response, chemistry, chordata, echinoderms, field, laboratory, north-pacific, ocean-acidification, physiology, respiration",
    "name": "Variability in larval gut pH regulation defines sensitivity to ocean acidification in six species of the Ambulacraria superphylum",
    "url": "https://pacificdata.org/data/dataset/hu2017cvariability-in-larval-gut-ph-regulation-defines-sensitivity-to-ocean-acidification-in-si"
}