{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-samoa-family-health-and-safety-study",
    "@type": "Dataset",
    "description": "The Samoan study shows that violence against women is prevalent: \n\n- 37.6% of women who have ever been in a relationship are likely to have experienced physical abuse by their partner. \n\n- 18.6% of women are likely to have experienced emotional abuse by their partner. \n\n- 19.6% of women are likely to have experienced sexual abuse by their partner. \n\n- Of women have experienced physical abuse by their partner, 23.8% had been punched, kicked or beaten while they were pregnant. \n\n-  Abused women are significantly more likely (53.8%) to come from rural as opposed to urban (35%) households. \n\n- There are no significant differences in the percentages abused or type of abuse experienced according to respondent’s age, but there is a significant difference in the percentages abused in each education group. Respondents with no schooling or only primary education are significantly more likely to experience any type of abuse, and the percentages abused decline as education level increases. \n\n- Almost one-third of the 38 respondents who received healthcare due to gender-based violence, concealed from hospital staff the truth about how their injuries had been acquired. \n\n- 40.7% of surveyed respondents who had ever had a partner had attempted to delay or avoid pregnancy. The figure is significantly higher for those who had ever experienced abuse (47.3%) than for those who had never experienced abuse (34.6%). \n\n- The partner’s drinking habits were more than twice as likely to cause money and/or family problems in the households of respondents who had been abused. \n\nThe top causes of violence identified by respondents to the study are: \n\n- Family problems (45%). \n\n- Women disobeyed the man (44.3%). \n\n- Man was drunk (14.8%). • Jealousy (6.1%).",
    "keywords": "Education, Health, data, ending-violence-against-women, human-rights, pacific-women, research-report, social-norms, violence",
    "name": "Samoa Family Health and Safety Study",
    "url": "https://pacificdata.org/data/dataset/pwl-samoa-family-health-and-safety-study"
}