{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-awareness-analysis-and-action-sexual-and-reproductive-health-and-rights-in-the-pacific",
    "@type": "Dataset",
    "description": "In the Pacific region, there has been some significant progress towards achieving the SRHR goals embedded in international commitments. The number of Pacific Island countries with national population policies is steadily increasing and the integration of sexual and reproductive health into primary health programs has also improved. Reducing child mortality is an area where the Pacific region is doing particularly well, with 10 of the 14 Forum island countries on track to achieving this goal. The small island states of Cook Islands, Fiji, Nauru, Niue, Palau, Republic of the Marshall Islands, Samoa, Tonga and Tuvalu have also made notable progress in reducing maternal mortality, reporting close to 100 per cent skilled birth attendance. These gains would not have been possible without a consistent and unified effort from SRHR advocates across government and civil society. \n\nDespite this progress, immense challenges remain and, overall, in many Pacific Island countries and territories, poverty, vulnerability and exclusion are on the rise. Specific SRHR issues in the Pacific region include endemic levels of gender-based violence; low contraceptive prevalence rates (below 50 per cent across the Pacific); stigmatisation, discrimination and a lack of confidentiality in many health services; hyperendemic levels of sexually transmitted infections (on average one quarter of sexually active young people in the Pacific have a sexually transmitted infection); and high rates of teenage pregnancy. \n\nThis manual contains three modules: \nModule 1: Awareness – This contains some of the key concepts in SRHR, the legal and policy frameworks that guide SRHR at an international, regional and national level and the specific issues in the context of the Pacific region. \nModule 2: Analysis – This outlines the needs and challenges of a number of vulnerable and marginalised individuals and groups who face the greatest barriers to claiming their sexual and reproductive health and rights. \nModule 3: Action – This provides information on how to take action to advance SRHR across five key areas. This section includes practical strategies and best practice case studies being carried out in the Pacific region.",
    "keywords": "Health, development-programming, enhancing-agency, pacific-women, social-norms, toolkit, violence",
    "name": "Awareness, Analysis and Action: Sexual and Reproductive Health and Rights in the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-awareness-analysis-and-action-sexual-and-reproductive-health-and-rights-in-the-pacific"
}