{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-un-women-fiji-multi-country-office-s-annual-report-2014",
    "@type": "Dataset",
    "description": "This annual report notes that the eyes of the world were focused on Samoa and the wider region for the Small Islands Developing States Conference and UN Women’s Executive Director, Phumzile Mlambo Nguka’s first visit to the Pacific. \nHighlights from the year included: \n\n- The launch of UN Women’s Markets for Change project. \n\n- A highly visible 16 Days of Activism against Gender Violence campaign. \n\n- Clear progress for women’s political participation with Fiji’s first democratic election since 2006 resulting in the highest percentage of women representatives ever elected in the Pacific. \n\n- Elections in Tonga and Solomon Islands saw a significant increase in women candidates running, as well as the number of votes received. \n\n- Dame Meg Taylor’s appointment as Secretary General of the Pacific Island Forum Secretariat was the first time a women has been elected to head of a regional body in the Pacific. \n\n- Four new countries adopted ending violence against women legislation for the first time in 2014. \n\n2014 saw UN Women’s programmes in the Pacific reach more women than ever before. There is evidence of progress and that the needs, potential and contributions of Pacific women are being prioritised and included in the private and public sectors alike. There is still, however, much to be done. The ongoing global discussions and negotiations that will determine the shape of the new development framework to replace the Millennium Development Goals make this a critical time for gender equality and women’s empowerment in the Pacific region.",
    "keywords": "Report, climate-change-and-environment, data, development-programming, economic-empowerment, ending-violence-against-women, enhancing-agency, human-rights, land-sea-and-livelihoods, leadership-and-decision-making, leadership-and-politics, pacific-women, social-norms, violence",
    "name": "UN Women Fiji Multi-Country Office’s Annual Report 2014",
    "url": "https://pacificdata.org/data/dataset/pwl-un-women-fiji-multi-country-office-s-annual-report-2014"
}