{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-women-peace-human-security-and-development-update-a-femlinkpacific-policy-brief",
    "@type": "Dataset",
    "description": "FemLINKpacific is a local, regional, and national catalyst for change through the use of accessible media and information. This is FemLINKPACIFIC’s policy brief from May 2014, providing information and data from the region and updates on the organisation’s programs. \n\nHighlights of the Policy Brief include: \n\n- Commemorating the first decade of advancing femLINKpacific’s mission to provide a safe space via community radio and enabling women from within their local communities to claim and localise UNSCR1325 as well as CEDAW with the theme ‘Communicating Peace, Development, Diversity, Security and Freedom’. \n\n- FemLINKpacific’s Radio with Pictures campaign enabled 82 women leaders in all their diversities, representing a collective constituency of 1811 members, in Nadi, Nausori and Labasa to communicate their peace, human security and development priorities. Through femLINKpacific’s rural network activities 94 women, particularly rural women, disabled women, young women and transgender women came together to discuss and document their collective priorities in Labasa, Nausori, Tavua/Rakiraki, Ba and Nadi. \n\n- Without women’s equal access to and participation in development processes from the district and tikina level, gender inclusive development will not happen and we will continue to hear the call for improvements in rural infrastructure (roads, water and electricity supply) and enhancing health services as well as guaranteeing a life free of violence and crime. \n\n- 41% of respondents (143 women) in femLINKpacific’s monthly household income and expenditure survey highlighted the struggle to meet cost of living expenses such as food, household bills, in addition to education, transport and health expenses being priorities when earning less than $50 to at least $200 a week. \n\n- The survey also highlighted the prevalence of the information-communication and digital divide for 82% of respondents which is why we also celebrate that over the last 10 years we are enabling women who would otherwise be silent or invisible to claim their communication rights.",
    "keywords": "data, ending-violence-against-women, enhancing-agency, human-rights, pacific-women, policy-notes-and-papers, social-media-and-popular-culture, social-norms",
    "name": "Women Peace Human Security and Development Update – A FemLINKPACIFIC Policy Brief",
    "url": "https://pacificdata.org/data/dataset/pwl-women-peace-human-security-and-development-update-a-femlinkpacific-policy-brief"
}