{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-thematic-brief-leadership-and-decision-making-for-women-and-girls-in-the-pacific",
    "@type": "Dataset",
    "description": "This Thematic Brief provides information and analysis about leadership and decision making for women and girls in the Pacific Islands region.\nIn the 2012 Pacific Leaders’ Gender Equality Declaration, Pacific leaders committed to implementing the following gender-responsive government programs and policies to promote women’s roles in leadership and decision making:\n▪ Adopt measures, including temporary special measures (such as legislation to establish reserved seats for women and political party reforms), to accelerate women’s full and equal participation in governance reform at all levels and women’s leadership in all decision making.\n▪ Advocate for increased representation of women in private sector and local level governance boards and committees (such as school boards and produce market committees).\nThe following five key messages help explain the importance of working to increase women’s participation in leadership and decision making, and why Pacific Women supports such initiatives. These messages are premised on a commitment to eliminate discriminatory social norms through generational change and the development of enabling environments that support women to be decision makers at all levels, including in families, communities, places of employment, business and local and national government.\nDuring the COVID-19 pandemic, there is a critical need for women’s and girls’ participation, leadership and decision making in all aspects of response planning and implementation. Women’s participation and leadership is essential for an effective response to the COVID-19 pandemic, particularly for mobilising communities and health communications.\n1. The Pacific region has the lowest level of women’s political participation globally.\n2. Temporary special measures have been introduced in the region to increase women’s representation at the national and sub-national levels.\n3. Working in Pacific Island countries requires an adaptive approach, to support a fair and better balance in women’s and men’s leadership roles and opportunities.\n4. Supporting women’s participation in all levels of decision making is key to reducing poverty, promoting the quality of economic growth, democracy, and increasing wellbeing of women, girls and their families.\n5. Supporting women’s leadership and decision making must occur at all levels. Just focusing on political representation at the national level is not enough.",
    "keywords": "leadership-and-decision-making, pacific-women, social-norms, thematic-brief",
    "name": "Thematic Brief: Leadership and decision making for women and girls in the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-thematic-brief-leadership-and-decision-making-for-women-and-girls-in-the-pacific"
}