{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/williams2014ocean-warming-and-acidification-have-complex-interactive-effects-on-the-dynamics-of",
    "@type": "Dataset",
    "description": "Diseases threaten the structure and function of marine ecosystems and are contributing to the global decline of coral reefs. We currently lack an understanding of how climate change stressors, such as ocean acidification (OA) and warming, may simultaneously affect coral reef disease dynamics, particularly diseases threatening key reef-building organisms, for example crustose coralline algae (CCA). Here, we use coralline fungal disease (CFD), a previously described CCA disease from the Pacific, to examine these simultaneous effects using both field observations and experimental manipulations. We identify the associated fungus as belonging to the subphylum Ustilaginomycetes and show linear lesion expansion rates on individual hosts can reach 6.5 mm per day. Further, we demonstrate for the first time, to our knowledge, that ocean-warming events could increase the frequency of CFD outbreaks on coral reefs, but that OA-induced lowering of pH may ameliorate outbreaks by slowing lesion expansion rates on individual hosts. Lowered pH may still reduce overall host survivorship, however, by reducing calcification and facilitating fungal bio-erosion. Such complex, interactive effects between simultaneous extrinsic environmental stressors on disease dynamics are important to consider if we are to accurately predict the response of coral reef communities to future climate change. ",
    "keywords": "algae, biological-response, corals, field, laboratory, multiple-factors, north-pacific, ocean-acidification, porifera, temperature",
    "name": "Ocean warming and acidification have complex interactive effects on the dynamics of a marine fungal disease",
    "url": "https://pacificdata.org/data/dataset/williams2014ocean-warming-and-acidification-have-complex-interactive-effects-on-the-dynamics-of"
}