{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/vanuatu-high-resolution-bathymetry-survey-technical-report-er110",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((163.30859653600123 -21.642881857686405, 163.30859653600123 -12.28215002989981, 173.60893256515192 -12.28215002989981, 173.60893256515192 -21.642881857686405, 163.30859653600123 -21.642881857686405))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "This report describes a high-resolution bathymetric mapping survey of the seabed surrounding the island of Efate in Vanuatu, by the Pacific Islands Applied Geoscience Commission\n(SOPAC). The survey was carried out over a period of 25\ndays in August 2003, resulting in the acquisition of over 600 line kilometres of MBES data.\nThe resultant compilation was used to produce\nbathymetry charts of Efate at scales of 1 : 100 000 and 1 : 50 000, with more detailed charts of\nMele Bay, Forari Bay and Havannah Bay at 1 : 20 000. \nUpon approval from the secretariat, the report can be downloaded by selecting the appropriate link under online resources and the charts can be downloaded from their separate metadata entries. \nThis work was initiated by the SOPAC/EU project ‘Reducing Vulnerability of Pacific\nACP States’, which called for an investigation of the nearshore seabed around the island of\nEfate using a multibeam echosounder (MBES).To give a descriptive picture of the ocean bottom terrain, vividly revealing the size, shape and distribution of underwater features, and serve as the basic tool for scientific, engineering, marine geophysical and environmental studies, as well as marine and coastal\nresource management.The dominant seafloor feature in Vanuatu's EEZ is the NNW-SSE trending Vanuatu Trench (New Hebrides Trench). The 7000 m-deep trench is the seafloor expression of the eastward dipping subduction zone which marks the present-day boundary between the Indo-Australian plate to the west, and the microplate of the North Fiji Basin to the east.",
    "keywords": "bathymetry, vanuatu",
    "name": "Vanuatu High-Resolution Bathymetry Survey Technical Report (ER110)",
    "url": "https://pacificdata.org/data/dataset/vanuatu-high-resolution-bathymetry-survey-technical-report-er110"
}