{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-do-no-harm-research-project-report-women-in-formal-employment-survey",
    "@type": "Dataset",
    "description": "The State, Society and Governance in Melanesia program at the Australian National University and the International Women’s Development Agency undertook the Do No Harm research project in Solomon Islands and Papua New Guinea to understand whether and in what ways economic inclusion and empowerment initiatives affect women’s experience of violence.\n\nA quantitative survey was conducted to document priorities and experiences of women working in full or part-time formal employment in Papua New Guinea and the Solomon Islands. The survey sought to focus specifically on women engaged in formal employment, to supplement the Do No Harm qualitative research previously conducted that primarily focused on women in informal employment. \n\nThis report draws on the responses to the survey and aims to be a useful resource for government and civil society organisations working to deliver formal-sector economic empowerment programming in Solomon Islands and Papua New Guinea. Through the inclusion of quotes from survey responses, this report also aims to give voice to the perspectives and experiences of women in formal employment in Papua New Guinea and Solomon Islands.\n\nThe individual responses demonstrate the importance of consultation with women to understand perspectives, priorities and experiences to inform all economic empowerment approaches.",
    "keywords": "autonomous-region-of-bougainville, data, development-programming, economic-empowerment, ending-violence-against-women, land-sea-and-livelihoods, pacific-women, research-report, social-norms, violence",
    "name": "Do No Harm Research Project Report: Women in Formal Employment Survey",
    "url": "https://pacificdata.org/data/dataset/pwl-do-no-harm-research-project-report-women-in-formal-employment-survey"
}