{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/perez2015influence-of-climate-and-land-use-in-carbon-biogeochemistry-in-lower-reaches-of-rivers",
    "@type": "Dataset",
    "description": "Freshwater discharge affects the biogeochemistry of river-influenced nearshore environments by contributing with carbon and nutrients. An increase in human activities in river basins may alter the natural riverine nutrients and carbon export to coastal ecosystems. Along a wide latitudinal range (32°55′S–40°10′S), this study explores the role of climate and land use in determining the nutrient and carbon concentrations in the river mouth and fluxes to adjacent coastal areas. Between winter 2011 and fall 2012, we collected monthly samples in five river mouths in central southern Chile and at rocky shore sites affected by river plumes. Basins were characterized by different land uses and meteorological conditions along this latitudinal range. Water samples were collected for pH measurements, nutrients, dissolved organic and inorganic carbon, particulate organic carbon, and isotopic signatures ($δ$13C). Our results show a north-south gradient in concentrations of nutrients and carbon. The highest concentrations were observed in the Maipo basin, which presents the highest percentage of urban-industrial activities. Nutrients and carbon contributions, in most cases, were lowest in the southern Valdivia basin, which has the least human intervention and a greater percentage of vegetation. The Biobío River had the highest nutrient and carbon fluxes, in most cases, due to its high river discharge. Our results show the influence of river plume effects on carbon and nitrogen concentrations in river-influenced rocky shore sites. Moreover, our study suggests that land use might influence some parameters of carbonate system in rivers and river-influenced rocky shore environments. River-influenced rocky shore environments may exhibit suppression in aragonite saturation state with implications for calcifiers inhabiting these marine environments.",
    "keywords": "biogeochemistry, chemistry, field, ocean-acidification, south-pacific",
    "name": "Influence of climate and land use in carbon biogeochemistry in lower reaches of rivers in central southern Chile: Implications for the carbonate system in river-influenced rocky shore environments: Riverine contributions to coastal areas",
    "url": "https://pacificdata.org/data/dataset/perez2015influence-of-climate-and-land-use-in-carbon-biogeochemistry-in-lower-reaches-of-rivers"
}