{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-the-global-fund-for-women-impact-report-gender-equality-in-asia-and-the-pacific",
    "@type": "Dataset",
    "description": "The top findings of the evaluation of the Breakthrough Project are: \n1. Global Fund grantmaking contributed to impact at three levels: on the individual lives of over half a million women and girls, their families and communities, on the sustainability and capacities of the grantee organisations and networks, and through concrete political and economic gains for gender equality. \n2. Global Fund grantmaking strategy is responsible for the results. Global Fund strategy achieved results by: a) identifying grantee partners that implement a rights-based approach, b) building a portfolio that collectively advances transformative change, and c) by mobilising high-quality resources for that portfolio. \n3. The networked activism of women’s rights movements secures concrete political and economic gains. One win over the past twenty years is the emergence of a global agenda for gender equality. However, goals alone do not achieve results. Women’s rights movements work for systemic change in a variety of ways, including advocacy, that create the political will necessary for goals to result in measurable change. \n4. Work for women and girls’ rights is an underfunded strategy. Despite playing a critical role in social, political, and economic development, the work of girls’ and women’s rights organisations, networks and movements are drastically underfunded, making up less than 10% of philanthropic giving in both Europe and the United States. \n5. Rights-based approaches to change yield higher impact outcomes. During the independent evaluation, a rubric was developed to measure implementation of a ‘human rights-based approach at the organisational level. Grantees that scored higher on this rubric at the outset were more likely to report significant achievements for gender equality by the close of the project.",
    "keywords": "Report, development-programming, enhancing-agency, human-rights, pacific-women, social-norms",
    "name": "The Global Fund for Women Impact Report: Gender Equality in Asia and the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-the-global-fund-for-women-impact-report-gender-equality-in-asia-and-the-pacific"
}