{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/lin2018binteractive-network-configuration-maintains-bacterioplankton-community-structure-under-",
    "@type": "Dataset",
    "description": "There is increasing concern about the effects of ocean acidification on marine biogeochemical and ecological processes and the organisms that drive them, including marine bacteria. Here, we examine the effects of elevated CO2 on the bacterioplankton community during a mesocosm experiment using an artificial phytoplankton community in subtropical, eutrophic coastal waters of Xiamen, southern China. Through sequencing the bacterial 16S rRNA gene V3-V4 region, we found that the bacterioplankton community in this high-nutrient coastal environment was relatively resilient to changes in seawater carbonate chemistry. Based on comparative ecological network analysis, we found that elevated CO2 hardly altered the network structure of high-abundance bacterioplankton taxa but appeared to reassemble the community network of low abundance taxa. This led to relatively high resilience of the whole bacterioplankton community to the elevated CO2 level and associated chemical changes. We also observed that the Flavobacteria group, which plays an important role in the microbial carbon pump, showed higher relative abundance under the elevated CO2 condition during the early stage of the phytoplankton bloom in the mesocosms. Our results provide new insights into how elevated CO2 may influence bacterioplankton community structure.",
    "keywords": "abundance, biological-response, brcommunity, chemistry, community-composition, field, mesocosms, molecular-biology, north-pacific, ocean-acidification, otherprocess, prokaryotes",
    "name": "Interactive network configuration maintains bacterioplankton community structure under elevated CO2 in a eutrophic coastal mesocosm experiment",
    "url": "https://pacificdata.org/data/dataset/lin2018binteractive-network-configuration-maintains-bacterioplankton-community-structure-under-"
}