{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pendleton2016bcoral-reefs-and-people-in-a-high-co2-world-where-can-science-make-a-difference-to",
    "@type": "Dataset",
    "description": "Reefs and People at Risk  Increasing levels of carbon dioxide in the atmosphere put shallow, warm-water coral reef ecosystems, and the people who depend upon them at risk from two key global environmental stresses: 1) elevated sea surface temperature (that can cause coral bleaching and related mortality), and 2) ocean acidification. These global stressors: cannot be avoided by local management, compound local stressors, and hasten the loss of ecosystem services. Impacts to people will be most grave where a) human dependence on coral reef ecosystems is high, b) sea surface temperature reaches critical levels soonest, and c) ocean acidification levels are most severe. Where these elements align, swift action will be needed to protect people's lives and livelihoods, but such action must be informed by data and science.  An Indicator Approach  Designing policies to offset potential harm to coral reef ecosystems and people requires a better understanding of where CO2-related global environmental stresses could cause the most severe impacts. Mapping indicators has been proposed as a way of combining natural and social science data to identify policy actions even when the needed science is relatively nascent. To identify where people are at risk and where more science is needed, we map indicators of biological, physical and social science factors to understand how human dependence on coral reef ecosystems will be affected by globally-driven threats to corals expected in a high-CO2 world. Western Mexico, Micronesia, Indonesia and parts of Australia have high human dependence and will likely face severe combined threats. As a region, Southeast Asia is particularly at risk. Many of the countries most dependent upon coral reef ecosystems are places for which we have the least robust data on ocean acidification. These areas require new data and interdisciplinary scientific research to help coral reef-dependent human communities better prepare for a high CO2 world.",
    "keywords": "corals, indian, methods, modeling, north-atlantic, ocean-acidification, regionalmodeling, socio-economy, south-atlantic, south-pacific",
    "name": "Coral reefs and people in a high-CO2 world: where can science make a difference to people?",
    "url": "https://pacificdata.org/data/dataset/pendleton2016bcoral-reefs-and-people-in-a-high-co2-world-where-can-science-make-a-difference-to"
}