{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/sea-oceanographic-data",
    "@type": "Dataset",
    "description": "Scientific data collected on the _Westward, Corwith Cramer_, and _Robert C. Seamans_ are invaluable products of SEA’s educational research programs. SEA supports dissemination and sharing of data with educators and researchers to benefit the broader science community and the public. We aim to encourage and ensure fair access to SEA data while also preserving the intellectual property of individual researchers and seeking opportunities for collaboration. Laboratory and deployment equipment on each vessel is described [here](https://www.sea.edu/ships_crew/shipboard_equipment).\r\n\r\n<img alt=\"\" src=\"https://www.sea.edu/images/galleries/gallery_03.jpg\" style=\"width: 350px; height: 233px;\">\r\n\r\n## Data Collection\r\nOn every SEA voyage, Standard Collections include the following:\r\n\r\n* Continuous GPS positions, surface flow-through seawater system data (temperature, salinity, chlorophyll-a fluorescence, CDOM fluorescence, transmissivity), and anemometer wind speed/direction data\r\n* Continuous ADCP current speed/direction and Chirp bathymetry data\r\n* Daylight observations of seabirds, marine mammals, _Sargassum_ and large marine debris\r\n* CTD profiles, including data from auxiliary sensors \r\n* Measurements of extracted chlorophyll-a, nutrients, pH and alkalinity from discrete water samples\r\n* Surface and subsurface zooplankton net data (and in some cases preserved specimens), including counts and/or biovolumes of plastic debris, tar balls, _Sargassum_ macroalgae, Halobates, phyllosoma (lobster larvae), leptocephali (eel larvae), myctophids (mesopelagic fish), gelatinous organisms, cephalopods, other nekton (>2cm in size), and mesozooplankton (<2cm in size)\r\n\r\nOn individual cruises, additional samples or data beyond Standard Collections may also be generated during projects led by SEA faculty or collaborating investigators; these data are managed by the project Principal Investigator. \r\n\r\nAs a service to the scientific community, and to fulfill SEA’s obligations to the U.S. State Department and foreign governments, [a formal cruise report](https://www.sea.edu/documents/cruisereports/S250_cruisereport_final.pdf) is prepared for all international voyages. Cruise reports include: a list of the ship’s company and students, a map of the voyage track, tables of sampling station locations and activities, most raw data in tables or graphics, and abstracts from student oceanographic research projects. \r\n\r\nSEA’s decades-long voyage history for the _Westward, Corwith Cramer_ and Robert _C. Seamans_ can be [accessed and searched here](https://www.sea.edu/SEA_Research/voyage-archive).",
    "keywords": "SEA, cruises, oceanographic, oceanographic-sampling, oceanography",
    "name": "SEA Oceanographic Data",
    "url": "https://pacificdata.org/data/dataset/sea-oceanographic-data"
}