{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-pacific-women-papua-new-guinea-annual-learning-workshop-2019",
    "@type": "Dataset",
    "description": "The fifth Pacific Women in Papua New Guinea Annual Learning Workshop offered an opportunity for Pacific Women-funded and non-funded partners to come together to discuss their work and research and to share lessons about what is working, the challenges, and the opportunities for promoting gender equality in Papua New Guinea and the Pacific. \n\nThe workshop provided an update on activities, research, innovation, and good practice undertaken by Pacific Women and its partners in 2018–2019 in the areas of increasing women’s leadership and decision making, increasing economic empowerment for women, and reducing violence against women and expanding support services. \n\nParticipants presented research findings, outcomes from their projects and facilitated mini skills-building workshops to share tools and approaches that work in their various projects. Throughout the workshop, participants were able to expand their networks, develop their skills, and engage in meaningful discussion with people who are contributing to gender equality and the empowerment of women in Papua New Guinea. \n\nHighlights of the 2019 workshop were the variety of useful and practical sessions. Workshop presentations and documents were made available on Niunet, a digital platform supported by Papua New Guinean entrepreneur Rebekah Ilave. Participants valued the engagement of disability organisations from the National Capital District and Unggai-Bena, Eastern Highlands province as presenters, participants and interpreters. The sessions facilitated by young women leaders from Bougainville were a highlight, as were sessions facilitated by community level women entrepreneurs and advocates. The continued engagement of the Sanap Wantaim Youth Group and the new marketplace initiative were well received. The White Cane Band comprising of five visually impaired musicians delighted participants at the closing night drinks.",
    "keywords": "Report, autonomous-region-of-bougainville, development-programming, economic-empowerment, ending-violence-against-women, enhancing-agency, human-rights, land-sea-and-livelihoods, leadership-and-decision-making, pacific-women, social-norms, violence",
    "name": "Pacific Women Papua New Guinea Annual Learning Workshop 2019",
    "url": "https://pacificdata.org/data/dataset/pwl-pacific-women-papua-new-guinea-annual-learning-workshop-2019"
}