{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/samoa-east-savai-to-north-west-upolu-2004-bathymetry-chart-no-3-1",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((186.2253093499468 -17.555268752861593, 186.2253093499468 -10.024476331617223, 194.79916666680836 -10.024476331617223, 194.79916666680836 -17.555268752861593, 186.2253093499468 -17.555268752861593))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "This record holds the bathymetry chart of the Eastern foreshore areas around Savai, Samoa towards the North Western foreshore of Upolu Island, Apia. The chart is the result of the multibeam bathymetry survey that was undertaken by the Applied Geoscience and Technology Division (SOPAC) of SPC \nin between the island of Upolu and Savai in the EU-SOPAC Samoa Survey. High-resolution bathymetric mapping survey was carried out ,resulting in the acquisition of over 2754 line-km of MBES data for the whole of the Samoa Survey. The entire survey achieved 100% coverage of the seafloor from approximately 50 m depth in the nearshore area to an average offshore distance of 10 km, reaching water depths of some 1500 m. The resultant data compilation was used to produce bathymetry charts. The result of these survey is presented as Chart 3 of the Samoa High resolution bathymetric survey.This work was initiated by the SOPAC/EU Reducing Vulnerability of Pacific ACP States Project (Task no.: NR 1.1.1). Bathymetry chart can be downloaded from this record under the Distribution Info section with appropriate permission from the Secretariat.The objective of the survey was to investigate the seabed and provide information about water depths around\nthe islands using a multibeam echosounder (MBES).\nThese new bathymetric maps provide a descriptive picture of the ocean bottom terrain, vividly revealing the size, shape and distribution of underwater features. They serve as the basic tool for scientific, engineering, marine geophysical and environmental studies, as well as for marine and coastal resource management.This chart shows a large extent of the Apolima Strait at water depths of generally 100–200 m, with predominantly featureless seabed. A shelf break is well defined at depths of 200–700 m, before leveling off into a deeper terracethat extends into water depth of 1200 m. One of the dominant features is a plateau approximately 27 km north of Leulumoega, rising to about 100 m below sealevel from the surrounding terrace in 600 m water depths. Slopeangles of the plateau are between 55o to 65o with a maximum of 70o. At its peak in water depths of 100 m, the plateau has an areal extend of 1.3 km2. An escarpment that terminates the terrace is evident at water depths of approximately 1200 m running for approximately 8 km in a seaward convexarc subparallel to the shoreline.DESCRIPTION of MORPHOLOGICAL FEATURES on the BATHYMETRIC CHART:A narrow shelf runs along the northern and southern coasts of Savai’i island, terminating at a shelf break in approximately 150 m water depths. The breakexhibits an average slope angle of around 40o. Note that the vessel surveyedacross the shelf in a water depth of around 100 m at the western extent of theisland. The seafloor is relatively featureless except for a few bathymetry highsat the southwestern corner.",
    "keywords": "bathymetry, eez, multibeam-bathymetry-survey, multibeam-echo-sounder-system, samoa",
    "name": "Samoa - East Savai to North West Upolu, 2004, Bathymetry Chart No:3 #1",
    "url": "https://pacificdata.org/data/dataset/samoa-east-savai-to-north-west-upolu-2004-bathymetry-chart-no-3-1"
}