{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-a-practical-guide-to-measuring-women-s-and-girls-empowerment-in-impact-evaluations",
    "@type": "Dataset",
    "description": "This research resource document provides guidance on how to best measure women’s and girls’ empowerment in impact evaluations, based on the experiences of J-PAL affiliated researchers around the world. This research resource document offers practical tips for measuring women’s and girls’ empowerment in impact evaluations. It is designed to support the work of monitoring and evaluation practitioners, researchers, and students. The document emphasises the importance of conducting in-depth formative research to understand gender dynamics in the specific context before starting an evaluation, developing locally tailored indicators to complement internationally standardised ones, and reducing the potential for reporting bias in using the instruments and data collection plan set out in the document.\n\nThe guide provides a catalogue of examples of survey questions and modules related to women’s and girls’ empowerment that have been used by J-PAL affiliated researchers in previous impact evaluations on the following topics:\n\n- Economic indicators.\n\n- Social indicators.\n\n- Intimate partner and family indicators.\n\n- Political and civic indicators.\n\n- Psychological indicators.\n\n- Education indicators.\n\n- Health indicators.\n\nThe document also includes examples of non-survey instruments that can be used to measure women’s empowerment, the pros and cons of each approach, and tips on how and when to use them.",
    "keywords": "Education, Health, data, development-programming, economic-empowermnet, ending-violence-against-women, enhancing-agency, land-sea-and-livelihoods, leadership-and-decision-making, leadership-and-politics, pacific-women, social-norms, violence",
    "name": "A Practical Guide to Measuring Women’s and Girls’ Empowerment in Impact Evaluations",
    "url": "https://pacificdata.org/data/dataset/pwl-a-practical-guide-to-measuring-women-s-and-girls-empowerment-in-impact-evaluations"
}