{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-a-summary-of-pacific-women-s-webinar-on-women-s-economic-empowerment-and-covid-19",
    "@type": "Dataset",
    "description": "During the webinar, the following points about women’s economic empowerment raised the most questions and discussion: \n\n- Women’s economic status is disproportionately affected by the impacts of COVID-19: \n\n- Women are more likely than men to work in low-paying, informal and precarious work, without safety nets, job security, paid leave or insurance for economic shocks. \n\n- Small island countries (or ‘big ocean countries’) have been particularly affected by challenges with food security during COVID-19 due to their reliance on food imports and remittances. Changes to global transport and food supply chains and drops in the overseas employment income of relatives, have posed significant challenges for many Pacific families, with major implications for women who are usually responsible for sourcing and preparing meals for their families and communities. Women also make up the majority of market vendors, many of whom have lost income due to the closure of markets, increased competition in food sales and increased cost of many foods. \n\n- Pacific women are taking on the increased childcare and domestic labour responsibilities, known as the burden of unpaid work. This is arising from the closure of many schools and workplaces, and the movement of people back to rural areas, adding to their existing unpaid work load. Increased care work is also reducing the time women have available for money making activities. \n\n- There are actions Pacific governments can take to ensure responses to the economic impacts of COVID-19 respond to, and support women who are most affected. Important measures include ensuring basic incomes, insurance scheme for the unemployed and those in the informal economy, financial and in-kind relief to rural women bearing the burden of increased domestic labour and cash transfers for immediate needs, focusing on women. These actions can support women as they deal with the dual crisis of COVID-19 and the aftermath of Cyclone Harold in Fiji and Cyclone Tino in Tuvalu. \n\n- Actions to support women’s economic empowerment during COVID-19 must also take into account women’s safety and protection given the increasing rate of men’s violence against women.",
    "keywords": "audio-visual, economic-empowerment, land-sea-and-livelihoods, pacific-women, social-norms",
    "name": "A summary of Pacific Women’s Webinar on Women’s Economic Empowerment and COVID-19",
    "url": "https://pacificdata.org/data/dataset/pwl-a-summary-of-pacific-women-s-webinar-on-women-s-economic-empowerment-and-covid-19"
}