{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/hurst2017elevated-co2-does-not-exacerbate-nutritional-stress-in-larvae-of-a-pacific-flatfish",
    "@type": "Dataset",
    "description": "Multiple aspects of climate change are expected to co-occur such that ocean acidification will take place in conjunction with warming and a range of trophic changes. Previous studies have demonstrated that nutritional condition plays a significant role in the responses of invertebrates to ocean acidification, but similar studies have yet to be conducted with marine fishes. In this study, we examined the potential interactive effects of elevated CO2 levels and nutritional stress on the growth and development of northern rock sole (Lepidopsetta polyxystra). Separate experiments examined the effects of these two environmental stressors during the pre-flexion (3–31 days) and post-flexion (31–87 days) larval stages. In both stages, the larval feeding regime has a much larger impact on growth rates than did the CO2 level, and there was no observed interaction between stressors. By 31 days post-hatch, larvae in the high-feeding treatment were 84.2% heavier than the fish in the low-feeding treatments, but there was no significant effect of CO2 level on body size or condition. While overall growth rates were faster during the pre-flexion stage, the effects of food limitation were greater for post-flexion larvae undergoing metamorphosis, with the high-feeding treatment fish being 3.3 times as heavy as fish in the low-feeding treatments. These results have important implications for understanding the impacts of the multi-faceted nature of climate change on population productivity of commercial fish species in the North Pacific.",
    "keywords": "biological-response, fish, growth, laboratory, morphology, multiple-factors, north-pacific, nutrients, ocean-acidification, performance",
    "name": "Elevated CO2 does not exacerbate nutritional stress in larvae of a Pacific flatfish",
    "url": "https://pacificdata.org/data/dataset/hurst2017elevated-co2-does-not-exacerbate-nutritional-stress-in-larvae-of-a-pacific-flatfish"
}