{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/fiji-exclusive-economic-zone-200-nautical-miles",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((172.7647222222471 -25.095555982733345, 172.7647222222471 -9.7833354565106, 183.7325383879366 -9.7833354565106, 183.7325383879366 -25.095555982733345, 172.7647222222471 -25.095555982733345))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "The Marine spaces Act, 1977, Act. No. 18 of 15 December 1977, as amended by the Marine Spaces (Amendment) Act 1978, Act No. 15 of 6 October 1978 states that the exclusive economic zone of Fiji comprises all areas of sea \r\n\r\n(1) Having, as their innermost limits the outermost limits of the territorial seas, and, as their outermost limits, a line drawn seaward from the baselines every point of which is at a distance of 200 miles from the nearest point of the appropriate baseline. \r\n(2) The Minister responsible for Foreign Affairs may by order, for the purpose of implementing any international agreement or the award of any international body, or otherwise, declare that the outer limits of the exclusive economic zone of Fiji extend to such line, any point of which may be at a distance of less than 200 miles from the nearest point of the appropriate baseline, as may be specified in such order.\r\n(3) Where the median line, as defined in subsection (4), is less than 200 miles from the nearest baseline, and no other line is for the time being specified under the provisions of subsection (2), the outer limits of the exclusive economic zone of Fiji extend to the median line. \r\n(4) The median line is a line every point of which is equidistant from the nearest points of the baselines from which the breadth of the territorial seas of Fiji and of any opposite or adjacent State or territory are measured.\r\n\r\nThe Marine Spaces (Territorial Seas) (Rotuma and its Dependencies) (Amendment) Order 2012 contains amendment of the datum that covers the geographical coordinates by deleting \r\n\r\n(a)\t“World Geodetic System 1972 (WGS72) datum, ”and substituting “International Terrestrial Reference System 2005 (ITRS2005) Geodetic Datum” and \r\n(b)\t“plus 3 seconds of latitude and plus 2 seconds of longitude in each case”\r\n\r\nhttps://www.un.org/Depts/los/LEGISLATIONANDTREATIES/PDFFILES/FJI_1978_Act.pdf\r\n\r\nhttps://www.un.org/Depts/los/LEGISLATIONANDTREATIES/PDFFILES/Fiji_Orders_2012.pdf\r\n\r\n",
    "keywords": "200NM, EEZ, FJ, Fiji Exclusive Economic Zone",
    "name": "Fiji Exclusive Economic Zone (200 Nautical Miles)",
    "url": "https://pacificdata.org/data/dataset/fiji-exclusive-economic-zone-200-nautical-miles"
}