{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/samoa-southwest-savaii-coastal-geological-map-1",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((186.2253093499468 -17.555268752861593, 186.2253093499468 -10.024476331617223, 194.79916666680836 -10.024476331617223, 194.79916666680836 -17.555268752861593, 186.2253093499468 -17.555268752861593))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "Coastal geological and geomorphological mapping was done around Savai'i Island, Samoa. Four map sheets representing the 4 directional quarters of Savai'i island was produced and is available for download with appropriate permission. Geological and geomorphological coastal map of South West Savai'i is contained in this metadata entry.  \n    Aerial photographs taken in 1999 were mainly used for overall mapping. Satellite (Ikonos) images,\n1:100,000-scale geology map and 1:50,000-scale topography maps were also used as supplementary data. In\norder to check image interpretation, in situ surveys were conducted along the whole coastal area of the Savai'i.\nisland. Visual check and description, photographs or video recording, beach profiling, bathymetry survey and\nsampling were performed. In the laboratory, re-interpretation of images was performed based on the results of\nsurveys and laboratory analysis. The final data were compiled using GIS software (MapInfoTM) and produced\ninto 1:12,500- to 1:50,000-scale map sheets.\n\n\nThis map series was published by the Korea Institute of Geoscience and Mineral resources (KIGAM) with the assistance of Samoa Meteorology Division (SMD) Ministry of Natural Resources ,Environment and Meteorology (MNREM) of Samoa and South Pacific Applied Geoscience and with the grant of UNDP under the auspices of the Ministry of Education , Science and Technology (MEST) of korea and KIGAM.\nA SOPAC task WS 1999.009 intiated by the request of Samoa as apart of the SOPAC-KIGAM program.Savai'i Island coordinates - Latitude: - 13.58333, Longitude: - 172.4167,Latitude (DMS): - 13° 34' 60 S, Longitude (DMS): - 172° 25' 0 W The coast of the Savai’i Island shows approximately 260-km length and could be divided into three types; barrier-reef coast (82 km, 32%), fringing-reef coast (19 km, 19%) and lava-cliffed coast (130 km, 50%)",
    "keywords": "barrier-reef-coast, fringing-reef-coast, geological, geomophological, lava-cliffed-coast, samoa, satuiatua, savaii, taga",
    "name": "Samoa, SouthWest Savai'i ,Coastal Geological Map #1",
    "url": "https://pacificdata.org/data/dataset/samoa-southwest-savaii-coastal-geological-map-1"
}