{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/odonnell2013mussel-byssus-attachment-weakened-by-ocean-acidification",
    "@type": "Dataset",
    "description": "Biomaterials connect organisms to their environments. Their function depends on biological, chemical and environmental factors, both at the time of creation and throughout the life of the material. Shifts in the chemistry of the oceans driven by anthropogenic CO2 (termed ocean acidification) have profound implications for the function of critical materials formed under these altered conditions. Most ocean acidification studies have focused on one biomaterial (secreted calcium carbonate), frequently using a single assay (net rate of calcification) to quantify whether reductions in environmental pH alter how organisms create biomaterials1. Here, we examine biological structures critical for the success of ecologically and economically important bivalve molluscs. One non-calcified material, the proteinaceous byssal threads that anchor mytilid mussels to hard substrates, exhibited reduced mechanical performance when secreted under elevated pCO2 conditions, whereas shell and tissue growth were unaffected. Threads made under high pCO2 (\\textgreater1,200 \\$μ\\$atm) were weaker and less extensible owing to compromised attachment to the substratum. According to a mathematical model, this reduced byssal fibre performance, decreasing individual tenacity by 40%. In the face of ocean acidification, weakened attachment presents a potential challenge for suspension-culture mussel farms and for intertidal communities anchored by mussel beds. ",
    "keywords": "biological-response, laboratory, mollusks, morphology, north-pacific, oaiccnoanswer, ocean-acidification, otherprocess, performance",
    "name": "Mussel byssus attachment weakened by ocean acidification",
    "url": "https://pacificdata.org/data/dataset/odonnell2013mussel-byssus-attachment-weakened-by-ocean-acidification"
}