{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-review-of-violence-against-women-in-melanesia-and-timor-leste",
    "@type": "Dataset",
    "description": "This report comprises a regional report and five country specific reports which contain more specific recommendations for each country. This regional report articulates a framework for action that is relevant for all actors working to address violence against women across the region; and identifies ‘promising practices’ that could guide efforts to scale up efforts to address violence against women.  \n\nPromising practices include the support to organisations including the Fiji Women’s Crisis Centre, Vanuatu Women’s Centre, Family and Sexual Violence Action Committee in Papua New Guinea and the Association of Men Against Violence in Timor-Leste. \n\nThe report finds that there is no doubt that much progress has been made in the last 15 years in addressing violence against women. Thanks largely to the efforts of women’s rights activists, all partner governments have made a public commitment to ending violence against women. \n\nHowever, there remains an enormous gap between public discourse and reality. International donors have made important contributions to ongoing efforts, but support is poorly coordinated – between donors, and even among programs within the same agencies. \n\nTo maximise the impact of development assistance, it is crucial to develop broad strategies involving a greatly increased and sustained contribution of financial resources, but also a commitment to discuss gender equality and violence against women in high level, policy dialogue with partner governments.",
    "keywords": "Report, development-programming, ending-violence-against-women, human-rights, pacific-women, social-norms, violence",
    "name": "Review of Violence Against Women in Melanesia and Timor-Leste",
    "url": "https://pacificdata.org/data/dataset/pwl-review-of-violence-against-women-in-melanesia-and-timor-leste"
}