{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/noisette2018aabiotic-and-biotic-interactions-in-the-diffusive-boundary-layer-of-kelp-blades-cre",
    "@type": "Dataset",
    "description": "1.Seaweeds are able to modify the chemical environment at their surface, in a micro‐zone called the diffusive boundary layer (DBL), via their metabolic processes controlled by light intensity. Depending on the thickness of the DBL, sessile invertebrates such as calcifying bryozoans or tube‐forming polychaetes living on the surface of the blades can be affected by the chemical variations occurring in this microlayer. Especially in the context of ocean acidification (OA), these microhabitats might be considered as a refuge from lower pH, because during the day photosynthesis temporarily raises the pH to values higher than in the mainstream seawater.  2.We assessed the thickness and the characteristics of the DBL at two pH levels (today's average surface ocean pH 8.1 and a reduced pH predicted for the end of the century, pH 7.7) and seawater flows (slow, 0.5 and fast, \\textgreater8 cm/s) on Ecklonia radiata (kelp) blades. Oxygen and pH profiles from the blade surface to the mainstream seawater were measured with O2 and pH microsensors for both bare blades and blades colonized by the bryozoan Membranipora membranacea.  3.The DBL was thicker in slow flow compared with fast flow and the presence of bryozoans increased the DBL thickness and shaped the DBL gradient in dark conditions. Net production was increased in the low pH condition, increasing the amount of oxygen in the DBL in both bare and epiphytized blades. This increase drove the daily pH fluctuations at the blade surface, shifting them towards higher values compared with today's pH. The presence of bryozoans led to lower oxygen concentrations in the DBL and more complex pH fluctuations at the blade surface, particularly at pH 7.7. 4.Overall, this study, based on microprofiles, shows that, in slow flow, DBL microenvironments at the surface of the kelps may constitute a refuge from OA with pH values higher than those of the mainstream seawater. For calcifying organisms, it could also represent training ground for harsh conditions, with broad daily pH and oxygen fluctuations. These chemical microenvironments, biologically shaped by the macrophytes, are of great interest for the resilience of coastal ecosystems in the context of global change. ",
    "keywords": "101594pangaea885807, 101594pangaea885868, 101594pangaea885869, 101594pangaea885870, 101594pangaea885871, 101594pangaea885872, 101594pangaea885873, algae, biological-response, bryozoa, chemistry, communitymf, flow, laboratory, multiple-factors, oaiccdb, ocean-acidification, primary-production, south-pacific",
    "name": "Abiotic and biotic interactions in the diffusive boundary layer of kelp blades create a potential refuge from ocean acidification",
    "url": "https://pacificdata.org/data/dataset/noisette2018aabiotic-and-biotic-interactions-in-the-diffusive-boundary-layer-of-kelp-blades-cre"
}