{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-pacific-women-checklist-gender-inclusive-covid-19-response",
    "@type": "Dataset",
    "description": "This checklist proposes actions in five specific areas: \n\n- Learn from women’s experience and support their leadership. \n\n- Develop and implement gender-sensitive responses to COVID-19. \n\n- Support women’ economic security. \n\n- Prioritise support to domestic violence survivors. \n\n- Ensure continued access to health services. \n\nThe contribution of both women and men is essential to effective crisis response. There is a need to include women, alongside men, in response planning as leaders, policy makers and care givers to assist with key decision making. It is important to understand that women and men are impacted differently by a crisis like the COVID19 pandemic. \n\nDuring a crisis women and girls are disproportionately impacted and typically face even higher rates of violence and sexual abuse, undertake more unpaid domestic work, access fewer essential health services and are more vulnerable to economic hardship. \n\nOnly some Pacific Island countries and territories have so far reported COVID-19 cases but all have implemented some form of COVID-19 response such as border closures, curfews or other restrictions. These responses, moreso than the virus itself, will likely have a greater effect on the Pacific and its resilience to the crisis. Monitoring and assessing the gendered impacts of the COVID-19 response will require consideration of both the negative impacts of the response on many women (such as lockdown restrictions limiting access to employment and services) and aspects of the response that will benefit women (such as government subsidies accessible by women).",
    "keywords": "Health, development-programming, economic-empowerment, ending-violence-against-women, enhancing-agency, land-sea-and-livelihoods, leadership-and-decision-making, leadership-and-politics, pacific-women, social-norms, violence",
    "name": "Pacific Women Checklist: Gender-inclusive COVID-19 Response",
    "url": "https://pacificdata.org/data/dataset/pwl-pacific-women-checklist-gender-inclusive-covid-19-response"
}