{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/feely2010the-combined-effects-of-ocean-acidification-mixing-and-respiration-on-ph-and-carbonate",
    "@type": "Dataset",
    "description": "Puget Sound is a large estuary complex in the U.S. Pacific Northwest that is home to a diverse and economically important ecosystem threatened by anthropogenic impacts associated with climate change, urbanization, and ocean acidification. While ocean acidification has been studied in oceanic waters, little is known regarding its status in estuaries. Anthropogenically acidified coastal waters upwelling along the western North American continental margin can enter Puget Sound through the Strait of Juan de Fuca. In order to study the combined effects of ocean acidification and other natural and anthropogenic processes on Puget Sound waters, we made the first inorganic carbon measurements in this estuary on two survey cruises in February and August of 2008. Observed pH and aragonite saturation state values in surface and subsurface waters were substantially lower in parts of Puget Sound than would be expected from anthropogenic carbon dioxide (CO2) uptake alone. We estimate that ocean acidification can account for 24–49% of the pH decrease in the deep waters of the Hood Canal sub-basin of Puget Sound relative to estimated pre-industrial values. The remaining change in pH between when seawater enters the sound and when it reaches this deep basin results from remineralization of organic matter due to natural or anthropogenically stimulated respiration processes within Puget Sound. Over time, however, the relative impact of ocean acidification could increase significantly, accounting for 49–82% of the pH decrease in subsurface waters for a doubling of atmospheric CO2. These changes may have profound impacts on the Puget Sound ecosystem over the next several decades. These estimates suggest that the role ocean acidification will play in estuaries may be different from the open ocean.   ",
    "keywords": "biogeochemistry, chemistry, field, north-pacific, ocean-acidification",
    "name": "The combined effects of ocean acidification, mixing, and respiration on pH and carbonate saturation in an urbanized estuary",
    "url": "https://pacificdata.org/data/dataset/feely2010the-combined-effects-of-ocean-acidification-mixing-and-respiration-on-ph-and-carbonate"
}