{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/ohno2017an-aposymbiotic-primary-coral-polyp-counteracts-acidification-by-active-ph-regulation",
    "@type": "Dataset",
    "description": "Corals build their skeletons using extracellular calcifying fluid located in the tissue-skeleton interface. However, the mechanism by which corals control the transport of calcium and other ions from seawater and the mechanism of constant alkalization of calcifying fluid are largely unknown. To address these questions, we performed direct pH imaging at calcification sites (subcalicoblastic medium, SCM) to visualize active pH upregulation in live aposymbiotic primary coral polyps treated with HCl-acidified seawater. Active alkalization was observed in all individuals using vital staining method while the movement of HPTS and Alexa Fluor to SCM suggests that certain ions such as H(+) could diffuse via a paracellular pathway to SCM. Among them, we discovered acid-induced oscillations in the pH of SCM (pHSCM), observed in 24% of polyps examined. In addition, we discovered acid-induced pH up-regulation waves in 21% of polyps examined, which propagated among SCMs after exposure to acidified seawater. Our results showed that corals can regulate pHSCM more dynamically than was previously believed. These observations will have important implications for determining how corals regulate pHSCM during calcification. We propose that corals can sense ambient seawater pH via their innate pH-sensitive systems and regulate pHSCM using several unknown pH-regulating ion transporters that coordinate with multicellular signaling occurring in coral tissue.",
    "keywords": "biogeochemistry, biological-response, calcification, corals, laboratory, north-pacific, ocean-acidification, physiology",
    "name": "An aposymbiotic primary coral polyp counteracts acidification by active pH regulation",
    "url": "https://pacificdata.org/data/dataset/ohno2017an-aposymbiotic-primary-coral-polyp-counteracts-acidification-by-active-ph-regulation"
}