{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-developing-young-women-s-collective-action-in-vanuatu",
    "@type": "Dataset",
    "description": "This short paper reflects on the experiences of 38 young, educated women in Papua New Guinea, Solomon Islands and Vanuatu. It finds that: \n\n- Young women in Melanesia are subject to intimate forms of control. However educated and able they may be, family members continue to exert or seek to exert control over their behaviour and choices. \n\n- Young, educated Melanesian women derive solidarity and support from one another. This peer group support appears to be particularly important for women who have made countercultural ‘choices’ – for example, to remain single, leave violent partners or bring up children on their own. \n\nThe strengths and capabilities of young educated women in Vanuatu suggest that there is untapped potential in their collective capacity. To date, this potential has been thwarted as a result of the active denigration of young women by older women and by pervasive, but misleading, discourses about women’s inability to co-operate with one another. In Vanuatu, partly as a consequence of this background, there is as yet no group focused on justice and equity for women such as those in Papua New Guinea and Solomon Islands. \n\nThere would be many benefits of local women creating a ‘chosen’ community with shared interests and purpose. the development of a ‘community of practice’ among young women in Vanuatu could work to promote increased status, respect and participation among young, educated ni-Vanuatu women, including those who do not conform to societal expectations about women’s roles.",
    "keywords": "development-programming, enhancing-agency, leadership-and-politics, pacific-women, research-report, short-paper, social-norms",
    "name": "Developing Young Women’s Collective Action in Vanuatu",
    "url": "https://pacificdata.org/data/dataset/pwl-developing-young-women-s-collective-action-in-vanuatu"
}