{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/rivest2015bcomplex-environmental-forcing-across-the-biogeographical-range-of-coral-populations",
    "@type": "Dataset",
    "description": "Although there is a substantial body of work on how temperature shapes coastal marine ecosystems, the spatiotemporal variability of seawater pH and corresponding in situ biological responses remain largely unknown across biogeographic ranges of tropical coral species. Environmental variability is important to characterize because it can amplify or dampen the biological consequences of global change, depending on the functional relationship between mean temperature or pH and organismal traits. Here, we characterize the spatiotemporal variability of pH, temperature, and salinity at fringing reefs in Moorea, French Polynesia and Nanwan Bay, Taiwan using advanced time series analysis, including wavelet analysis, and infer their potential impact on the persistence and stability of coral populations. Our results demonstrate that both the mean and variance of pH and temperature differed significantly between sites in Moorea and Taiwan. Seawater temperature at the Moorea site passed the local bleaching threshold several times within the ̃45 day deployment while aragonite saturation state at the Taiwan site was often below commonly observed levels for coral reefs. Our results showcase how a better understanding of the differences in environmental conditions between sites can (1) provide an important frame of reference for designing laboratory experiments to study the effects of environmental variability, (2) identify the proximity of current environmental conditions to predicted biological thresholds for the coral reef, and (3) help predict when the temporal variability and mean of environmental conditions will interact synergistically or antagonistically to alter the abundance and stability of marine populations experiencing climate change.",
    "keywords": "chemistry, field, north-pacific, ocean-acidification, south-pacific",
    "name": "Complex environmental forcing across the biogeographical range of coral populations",
    "url": "https://pacificdata.org/data/dataset/rivest2015bcomplex-environmental-forcing-across-the-biogeographical-range-of-coral-populations"
}