{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/ihnken2011adifferential-responses-of-growth-and-photosynthesis-in-the-marine-diatom-chaetoceros",
    "@type": "Dataset",
    "description": "This study investigated the impact of photon flux and elevated CO2 concentrations on growth and photosynthetic electron transport on the marine diatom Chaetoceros muelleri and looked for evidence for the presence of a CO2-concentrating mechanism (CCM). pH drift experiments clearly showed that C. muelleri has the capacity to use bicarbonate to acquire inorganic carbon through one or multiple CCMs. The final pH achieved in unbuffered cultures was not changed by light intensity, even under very low photon flux, implying a low energy demand of bicarbonate use via a CCM. In short-term pH drift experiments, only treatment with the carbonic anhydrase inhibitor ethoxyzolamide (EZ) slowed down the rise in pH considerably. EZ was also the only inhibitor that altered the final pH attained, although marginally. In growth experiments, CO2 availability was manipulated by changing the pH in closed flasks at a fixed dissolved inorganic carbon (DIC) concentration. Low-light-treated samples showed lower growth rates in elevated CO2 conditions. No CO2 effect was recorded under high light exposure. The maximal photosynthetic capacity, however, increased with CO2 concentration in saturating, but not in subsaturating, light intensities. Growth and photosynthetic capacity therefore responded in opposite ways to increasing CO2 availability. The capacity to photoacclimate to high and low photon flux appeared not to be affected by CO2 treatments. However, photoacclimation was restricted to growth photon fluxes between 30 and 300 µmol photons m−2 s−1. The light saturation points for photosynthetic electron transport and for growth coincided at 100 µmol photons m−2 s−1. Below 100 µmol photons m−2 s−1 the light saturation point for photosynthesis was higher than the growth photon flux (i.e. photosynthesis was not light saturated under growth conditions), whereas at higher growth photon flux, photosynthesis was saturated below growth light levels.  ",
    "keywords": "101594pangaea769749, biological-response, growth, laboratory, light, multiple-factors, oaiccdb, ocean-acidification, photosynthesis, phytoplankton, south-pacific",
    "name": "Differential responses of growth and photosynthesis in the marine diatom Chaetoceros muelleri to CO2 and light availability",
    "url": "https://pacificdata.org/data/dataset/ihnken2011adifferential-responses-of-growth-and-photosynthesis-in-the-marine-diatom-chaetoceros"
}