{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/mabardy2015aperception-and-response-of-the-u-s-west-coast-shellfish-industry-to-ocean-acidifica",
    "@type": "Dataset",
    "description": "In the mid-2000s the U.S. west coast oyster industry experienced several years of significant production failures. This industry has been referred to as the “canary in a coal mine” for ocean acidification (OA). Industry-led collaboration with university and government scientists identified a relationship between elevated carbon dioxide in seawater and poor oyster seed production. This multiyear production slow-down resulted in significant economic losses to the industry and spurred state and regionally led initiatives to examine the current and potential future impacts of OA. To examine the perceptions and understanding of OA by the U.S. west coast shellfish industry, a regional survey of the industry was conducted, covering oyster, mussel, clam, geoduck, and abalone producers. The web-based survey addressed four general areas: experience, understanding, concern, and adaptability. There were 86 total respondents from industry, resulting in a response rate of 46% with 96% of respondents answering all 44 questions. Seventy percent of respondents were owners or managers of a shellfish business. Findings from the survey indicate that approximately half of the industry had personally experienced a negative impact from OA. This personal experience generally led to a higher level of concern about OA; however, self-reported level of understanding of OA resulted in slightly less concordance with the level of concern. Greater than 80% of the shellfish industry noted that OA will have consequences today, approximately four times higher than the U.S. public's perception of the threat. Finally, greater than 50% of the industry felt that they would be able to somewhat or definitely adapt to OA.",
    "keywords": "fisheries, north-pacific, ocean-acidification",
    "name": "Perception and response of the U.S. West Coast shellfish industry to ocean acidification: the voice of the canaries in the coal mine",
    "url": "https://pacificdata.org/data/dataset/mabardy2015aperception-and-response-of-the-u-s-west-coast-shellfish-industry-to-ocean-acidifica"
}