{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-phama-program-gender-analysis-tonga",
    "@type": "Dataset",
    "description": "Agriculture constitutes over 65% of the country’s TOP $26 million exports (approximately AU$16 million) and accounts for 14% of Tonga’s GDP. Two-thirds of Tonga’s households are involved in agricultural production, with approximately 2.4% of households operating as commercial producers in the formal economy. Another 39% of households produce some crops to sell through markets and roadside stalls in the informal economy. \n\nAgricultural exports rely heavily on horticultural crops, and the PHAMA program is focussed on supporting these, but there has been minimal investigation of the gender aspects of the value chains. It was recognised that a basic gender analysis was required to better inform future support by the PHAMA program and other relevant donor or Government of Tonga led programs. \n\nIn developing the scope of the analysis, it was also identified that handicraft (e.g. woven mats) production and sales was anecdotally a significant source of income for women throughout Tonga but due to being largely informal the trade was not reflected in official statistics such as export volumes or earnings. Hence it was agreed as useful to also consider the production and sale of handicrafts within this analysis. With a focus on these value chains, the analysis was to identify the respective roles, responsibilities, expectations and challenges of women (and men) and recommend specific aspects or approaches for the PHAMA or other programs to better address gender issues and in particular women’s economic empowerment. It was also to include a summary of the gender context in Tonga and relevant community, donor or Government of Tonga led programs or activities aimed at addressing gender issues. \n\nThe PHAMA Program is in some ways undermined by a design document written prior to an important shift in gender equality programming at the Australian department of Foreign Affaris and Trade. While the Program is not necessarily entrenching gender and social inequality and vulnerability, nor has it (until now) taken deliberate steps to factor gender into strategic planning. Gender should be a core consideration in the design of any future program. In the meantime, a gender focus could be introduced into PHAMA’s final annual strategic plan, with associated budget allocations. PHAMA should also continue to seek sex-disaggregated data as part of its monitoring and evaluation efforts.",
    "keywords": "Report, development-programming, economic-empowerment, land-sea-and-livlihoods, pacific-women",
    "name": "PHAMA Program Gender Analysis -Tonga",
    "url": "https://pacificdata.org/data/dataset/pwl-phama-program-gender-analysis-tonga"
}