{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-do-no-harm-the-relationship-between-vaw-and-women-s-economic-empowerment-in-the-pacific",
    "@type": "Dataset",
    "description": "Even as the importance of women’s economic inclusion and empowerment is acknowledged and acted on, it is also known that such gains are not without risk; for increasing command over financial resources can expose women to domestic conflict and violence.\n\nFew studies have addressed this issue comprehensively in the Pacific, with only a small amount of discussion of the relationship. Findings from research on the gender equality outcomes of economic growth in the Pacific suggest that in semi-subsistence Melanesian communities in Solomon Islands and Fiji, any cash in the hands of women can expose them to risk of violence by men, often in association with resource-depleting activities such as gambling and drinking. The relationship between gender-based violence and the provision of financial services is not yet fully understood.\n\nPacific women continue to experience poor development outcomes, with high levels of both economic exclusion and violence against them. Given this, and the policy priority attached to sustainable economic development in the region, understanding what factors enhance women’s economic inclusion and empowerment in the fullest sense, and what factors mitigate against this, is essential to enabling change that also advances security. \n\nResearch that indicates clearly to donor agencies what needs to be incorporated in the design and implementation of economic empowerment initiatives, and in organisational policies, in order to minimise possible harm and to maximise positive gender equality outcomes will assist them to meet their minimum ethical responsibility to do no harm.",
    "keywords": "development-programming, economic-empowerment, ending-vioelnce-against-women, land-sea-and-livelihoods, pacific-women, short-paper, social-norms, violence",
    "name": "Do No Harm: The Relationship between VAW and Women’s Economic Empowerment in the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-do-no-harm-the-relationship-between-vaw-and-women-s-economic-empowerment-in-the-pacific"
}