{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/vanuatu-efate-bathymetry-survey-charts-1-to-50000-6",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((163.30859653600123 -21.642881857686405, 163.30859653600123 -12.28215002989981, 173.60893256515192 -12.28215002989981, 173.60893256515192 -21.642881857686405, 163.30859653600123 -21.642881857686405))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "A high-resolution bathymetric mapping survey of the seabed surrounding the island of Efate in Vanuatu.This bathymetric map is a blend of multibeam (MBES), and singlebeam (SBES) echosounder data. All slope angles exceeding 60 degrees (degrees from horizontal) were interpreted as scarps. Any Inclined area of the seafloor that was laterally confined by distinctive slopes, with or without an upslope headscarp, was interpreted as a channel. This work was initiated by the SOPAC/EU Reducing Vulnerability of Pacific ACP States Project.To give a descriptive picture of the ocean bottom terrain, vividly revealing the size, shape and distribution of underwater features, and serve as the basic tool for scientific, engineering, marine geophysical and environmental studies, as well as marine and coastal resource management.The general morphological trend of the seabed around Efate:-    (1)  ~0m - Modern fringing reef and rock platform, up to 50 m wide.     (2) ~40m - Submarine terrace, 500 m wide.     (3) 60-250m - Seaward sloping seabed, slope angles 30-40 degrees.     (4) 250-800m - Seaward sloping seabed, slope angles 0-20 degrees. Occasional large blocks.     (5) 800-1400m - Numerous seaward convex scarps, slope angles 30-60 degrees, exceeding 60 degrees to the north and northeast.     (6) 1400m to max. survey depths - Variable relief including numerous arcuate scarps, sidewalls, canyons, and flats. Slope angles 0-40 degrees.",
    "keywords": "bathymetry, vanuatu",
    "name": "Vanuatu, Efate, Bathymetry Survey Charts, 1 to 50,000 #6",
    "url": "https://pacificdata.org/data/dataset/vanuatu-efate-bathymetry-survey-charts-1-to-50000-6"
}