{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/tuvalu-high-resolution-bathymetry-survey-report-er-050",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((172.71256944444497 -13.240386111110979, 172.71256944444497 -3.965563888888767, 183.243352777778 -3.965563888888767, 183.243352777778 -13.240386111110979, 172.71256944444497 -13.240386111110979))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "The Pacific Islands Applied Geoscience Commission (SOPAC) carried out a marine survey for Tuvalu in the waters around all nine atolls and low reef islands, namely, Nanumea,\nNiutao, Nanumanga, Nui, Vaitupu, Nukufetau, Funafuti, Nukulaelae, Niulakita.  This work was initiated by the SOPAC/EU Reducing Vulnerability of Pacific ACP States Project. \nThis report describes the high-resolution bathymetric mapping survey carried out over a\nperiod of five weeks in September and October 2004. The survey achieved good coverage of the seafloor from approximately 10 m depth in the nearshore reef slope area, to an average offshore depth of some 2000 m, at an average slope angle of 27°.\nThe resultant data was used to produce nine bathymetry charts for Tuvalu at scales ranging\nfrom 1 : 20 000 to 1 : 50 000 available as separate metadata entry, under the different surveyed islands. The report is available for download from the Distribution Info section.The objective of the survey described in the report was to investigate the seabed and provide information about water depths around the islands using a multibeam echosounder (MBES).Bathymetric data are SRTM30 PLUS, predicted water depths are in meters.",
    "keywords": "bathymetry, exclusive-economic-zone, tuvalu",
    "name": "Tuvalu High Resolution Bathymetry Survey Report (ER 050)",
    "url": "https://pacificdata.org/data/dataset/tuvalu-high-resolution-bathymetry-survey-report-er-050"
}