{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/papua-new-guinea-madang-bathymetry-chart-1-to-50-000-1",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((139.20137452543452 -14.748448665973001, 139.20137452543452 2.5923770264788, 162.80337908773708 2.5923770264788, 162.80337908773708 -14.748448665973001, 139.20137452543452 -14.748448665973001))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "High-resolution swath mapping, using multibeam echo sounder was used to delineate the seabed morphology around Madang ,Papua New guinea at the maximum depth coverage in the lagoon of 50 m at the entrance around the southern end,near the main harbour. \nThe resultant data was used to produce bathymetry charts and the Madang Bathymetry chart is available for download from its appropriate link under Distribution Info. This work was initiated by the Pacific Islands Applied Geoscience Commission (SOPAC) and the European Union (EU) Reducing Vulnerability of Pacific ACP States Project.The objective of the survey was to investigate the seabed and provide information about water depths in the coastal areas using a Multibeam echosounder (MBES). Bathymetry maps/ charts should provide information about water depths around the islands. These new bathymetric maps should also give a descriptive picture of the ocean bottom terrain, vividly revealing the size, shape and distribution of underwater features. They can serve as the basic tool for scientific, engineering, marine geophysical and environmental studies, as well as marine and coastal resource management.Madang, located 5 degrees 10' S and 145 degrees 20' E, on the northern coast of the mainland of Papua New Guinea. SUMMARY OF SEABED AROUND MADANG:The two survey lines in the lagoon did not capture many features of the seafloor. The maximum depth of coverage in the lagoon was 50 m at the entrance around the southern end,near the main harbour. The average water depth in the lagoon was around 15 m. The seafloor appeared to be rather featureless, with a few coral heads. The seafloor around Madang drops off sharply at an angle of about 45 - 50o () to about 200 m water depths. A very prominent south west trending fault scarp is seen about 5 km north of theMadang harbour entrance channel. The seafloor is quite featureless to the south of this fault scarp with an exception of a seamount (planet rock) rising from a depth of around 300 m to about 5 m below sea level. To the north of the fault scarp, numerous small canyons are seen to be originating from the 600 m contour and leveling off at around 1 300 m water depths. Only one canyon is seen originating at the entrance of the northern end of the lagoon and levels off at around 1200 m water depth.",
    "keywords": "bathymetry, eez, multibeam-echo-sounder-system, papua-new-guinea",
    "name": "Papua New Guinea, Madang, Bathymetry Chart 1 to 50 000 #1",
    "url": "https://pacificdata.org/data/dataset/papua-new-guinea-madang-bathymetry-chart-1-to-50-000-1"
}