{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-balance-of-power-brochure",
    "@type": "Dataset",
    "description": "Balance of Power is an innovative approach to supporting Pacific Island countries achieve their objectives of inclusive and effective leadership in line with national policy frameworks. Specifically, Balance of Power aims to contribute to a ‘better balance’ in women’s and men’s leadership roles and opportunities. Building on lessons learned on what works and what doesn’t in the Pacific context, the innovation is in three key parts: \n\n- Balance of Power takes a very different approach by interrogating, in local contexts, the deeply entrenched social norms that define and legitimise leadership – across multiple spaces and institutions. \n\n- Balance of Power is led and managed by highly skilled Pacific Islanders, acknowledging that social norm change is best articulated and driven by local actors.\n\n- Balance of Power takes a ‘thinking and working politically’ approach, which seeks to convene, and understand the interests of, diverse stakeholders, with a focus on influencing and incentivising power-holders and norm-changers. \n\nThe first phase of Balance of Power will initially focus on Vanuatu and Tonga. Small country offices have been established in Port Vila and Nuku’alofa, supported by the regional head office in Suva. The time-frame for this first phase is 2019 to 2024. \n\nThe high-level outcomes of Balance of Power are: \n\n- Women’s right to participate in the public sphere, including in humanitarian response decision-making, is increasingly accepted and valued by women and men in the community. \n\n- There is a shifting balance of power towards women and men sharing decision-making at all levels. \n\n- Traditional, church, and democratic governance institutions demonstrate action consistent with their commitments on women in leadership, and role-model integration of women’s voice and agency.",
    "keywords": "development-programming, leadership-and-decision-making, leadership-and-politics, pacific-women, pamphlet-flyer, social-norms",
    "name": "Balance of Power brochure",
    "url": "https://pacificdata.org/data/dataset/pwl-balance-of-power-brochure"
}