{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-pacific-young-women-s-leadership-alliance-summary-of-online-dialogues",
    "@type": "Dataset",
    "description": "The Pacific Young Women’s Leadership Alliance is a network of regional, international, and locally based organisations working with and for young women leaders across the Pacific region. The Alliance’s strategy focuses on five key themes, supporting young women to be: Safe, Respected, Included, Connected, and Skilled. The goal of the Alliance is to provide a network to share information, and best practices and resources; and provide a united voice to ensure that governments, donors, and other stakeholders are accountable to the needs of young Pacific women.\n\nThere were a number of common ideas which emerged across every topic discussed, which suggest key entry points for interventions aiming to assist young women to realize their potential and their human rights. These include: \n\n- The need for comprehensive sexual education in schools.\n\n- The barriers which young women face as a result of traditional and cultural ideas about young women's roles and the worth of their skills, knowledge and contributions.\n\n- The important of religion, family and community as either a barrier to leadership or a much needed support network.\n\n- The multiple barriers of intersecting discrimination for young women who are LGBTI, living with disability, living in poverty, or members of other minority groups.\n\n- The need for women young and old to support each other and work collaboratively to advocate for change.",
    "keywords": "Education, Health, Report, human-rights, leadership-and-decision-making, leadership-and-politics, pacific-women, social-norms",
    "name": "Pacific Young Women’s Leadership Alliance: Summary of Online Dialogues",
    "url": "https://pacificdata.org/data/dataset/pwl-pacific-young-women-s-leadership-alliance-summary-of-online-dialogues"
}