{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-national-study-on-domestic-violence-on-women-in-tonga",
    "@type": "Dataset",
    "description": "The Tongan study shows that violence against women is prevalent:\n\n- 79% of Tongan women and girls have experienced physical or sexual violence in their lifetime. \n\n- 68% of Tongan women and girls are affected by physical violence perpetrated by mainly their fathers or teachers. \n\n- 33% of married or ever partnered women are victims of physical violence. \n\n- 17% of married or ever partnered women are victims of sexual violence. \n\n- 24% of married or ever partnered women are subject to emotional violence. \n\n- Perpetrators of violence are just as likely to be well respected and educated Tongan men. \n\n- 83% of women agreed that a good wife obeys her husband even if she disagrees. \n\n- 56% of all respondents (women and men) agreed with the statement that a husband could beat his wife if she was unfaithful. \n\n- Between 73% and 83% of women believe that a wife has the right to refuse sex if the husband is drunk, if she is sick, or if he mistreats her. Fewer women (61%) believe that a wife can refuse sex if she does not want to. \n\nThe results of the study highlight the perception among women that the domestic violence they experience is caused by: \n\n- Shifting values of extended family life. \n\n- Shifting nature of kinship relations. \n\n- Extra-marital affairs. \n\n- Alcohol. \n\n- Living with the extended family. \n\n- Hardship and economic factors. \n\n- Being young and unprepared for married life. \n\n- Having children outside of marriage. \n\n- Gender roles and power dynamics between men and women in Tongan society.",
    "keywords": "data, ending-violence-against-women, pacific-women, research-report, social-norms, violence",
    "name": "National Study on Domestic Violence on Women in Tonga",
    "url": "https://pacificdata.org/data/dataset/pwl-national-study-on-domestic-violence-on-women-in-tonga"
}