{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-women-s-political-and-administrative-leadership-in-the-pacific",
    "@type": "Dataset",
    "description": "There is growing evidence that at both national and sub-national level, the social capital of urban elites (male and female alike) does not translate into votes at the ballot box. Instead, women who perform well at the polls: \n\n- Are “of the people”, i.e. either community based or have deep connections to their electorates; \n\n- Have strong male backers – powerful fathers, brothers, or husbands or, as the 2012 Papua New Guinea elections demonstrated, male supporters who maintain control over polling booths and coordinate the process of 'assisted voting'; \n\n- Are from high-profile often political families; \n\n- Have built good reputations as a local representative; \n\n- Have a solid constituency support base; \n\n- Have significant involvement in the church; \n\n- Are serving the community or delivering benefits locally. \nYet historically, few of the women who contested recent national elections in Papua New Guinea, Solomon Islands and Vanuatu fit this description. \n\nTypically, a greater proportion of women in each electorate reported experiencing intimidation compared to their male counterparts. Even so a quarter (25%) of male voters (159/626) also reported having experienced intimidation when voting. \n\nJust as voting experiences are gendered, so too is money politics Men typically receive cash and gifts more often than women and in larger amounts. Nearly two- thirds (64%) of those who elicited cash from candidates during the 2014 Solomon Islands elections were men. In addition, men reported receiving 20% more than women in exchange for their vote, and were far more likely to have personally elicited cash or gifts in return for their votes. They also reported a greater confidence to decline gifts or cash when offered to them, and less bound to honour such commitments.",
    "keywords": "data, enhancing-agency, leadership-and-decision-making, leadership-and-politics, pacific-women, research-report, socal-norms",
    "name": "Women’s political and administrative leadership in the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-women-s-political-and-administrative-leadership-in-the-pacific"
}