{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-salamasina-tausala-o-samoa",
    "@type": "Dataset",
    "description": "This report contains information about the activities undertaken as part of the Salamasina - Tausala o Samoa programme, lessons learned and recommendations for the future. \n\nSalamasina - Tausala o Samoa was initiated and established in January 2012 as part of the Emerging Pacific Womens Leadership Programme. The contribution of women in the socio-economic sector in Samoa has been remarkable. However, ad hoc evidence indicates that women are under-represented in the political sphere and in boardrooms. At the grass root level, the challenge is much larger and more concerning as more than 76 percent of Samoan domestic sector workers are women.  These women lack the necessary skills to tap into the employment opportunities available with the growth in the tourism industry and thus most are unpaid, under-paid or under-employed. In addition, these employment opportunities are increasingly being taken up by Fijians, Filipinos and others filling the skills deficit currently in the labour market. \n\nNotwithstanding these realities there are multi-faceted issues regarding the Sector’s lack of protection of workers well-being and natural rights and lack of recognition under current labour legislation. \n\nThe focus of the Salamasina - Tausala o Samoa programme was to address challenges faced by unemployed and vulnerable women at the grass roots level so that they attain self-sufficiency and financial independence. This will help to alleviate alarming statistics in civilian crimes indecent/common assaults, domestic violence, crimes against people and property as ad hoc evidence suggests a correlation between poverty and the abuse of women.",
    "keywords": "Report, development-programing, land-sea-and-livelihoods, leadership-and-decision-making, leadership-and-politics, pacific-women, social-norms",
    "name": "Salamasina – Tausala o Samoa",
    "url": "https://pacificdata.org/data/dataset/pwl-salamasina-tausala-o-samoa"
}