{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/niue-sea-level-information-no-seaframe-station-8",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((187.97298022375855 -22.502371549907053, 187.97298022375855 -16.594166666258502, 193.69870385000291 -16.594166666258502, 193.69870385000291 -22.502371549907053, 187.97298022375855 -22.502371549907053))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "As part of the AusAID-sponsored South Pacific Sea Level and Climate Monitoring Project (“Pacific Project”) for the FORUM region, in response to concerns raised by its member countries over the potential impacts of an enhanced Greenhouse Effect on climate and sea levels in the South Pacific region, SEAFRAME (Sea Level Fine Resolution Acoustic Measuring Equipment) gauges have been installed in twelve forum countries. They record sea level, air and water temperature, atmospheric pressure, wind speed and direction. They form an array designed to monitor changes in sea level and climate in the Pacific.\nThis report provides background information regarding sea level and climate in the region of Niue based on available data. As far as could be determined by this study, the only pre-existent climate monitoring based at Niue is the data collection from the local meteorological office. A tsunami- warning gauge (similar to a tide gauge) was installed at one time, but is no longer operative. This project is sponsored by the Australian Agency for International Development (AusAID), managed by Australian Marine Science and Technology Ltd (AMSAT), and supported by NTF Australia at the Flinders University of South Australia.To monitor changes in sea level and climate in the Pacific.",
    "keywords": "niue, sea-level-and-climate-change-in-niue",
    "name": "Niue Sea Level Information - No Seaframe Station #8",
    "url": "https://pacificdata.org/data/dataset/niue-sea-level-information-no-seaframe-station-8"
}