{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-sorcery-and-witchcraft-in-papua-new-guinea-problems-in-definition",
    "@type": "Dataset",
    "description": "This short paper looks at how the terms ‘sorcery’ and ‘witchcraft’ are frequently fused or used interchangeably, and are rarely conceptually distinguished. This blurring of the two occurs not only in popular accounts in the media but is widely reproduced by NGOs, donor organisations, and government institutions. A new acronym has even been coined SRK (‘sorcery-related killing’) that perpetuates the definitional lack of clarity, since it uses one term, sorcery, to refer to both sorcery and witchcraft. Some of the confusion in understanding is compounded by the range of terms used ‘poison,’ ‘sangguma,’ ‘puripuri,’ ‘blak pawa,’ and ‘wiskrap’. Some of these are derived from various places in Papua New Guinea, and some from English. The meanings these borrowed words carry in their original context are often lost in the new context. \n\nSorcery involves the purposeful actions of a person who intends to cause misfortune or harm to others (or to benefit them), and who sets about doing this through ritual means or incantations. In Papua New Guinea, a large range of techniques exist for this and these can be passed down the generations, acquired from relatives or friends, or simply purchased for cash. For those who believe in the efficacy of sorcery in Papua New Guinea, it is a set of practices that can be learnt and is something a person sets out to do. \n\nWitchcraft, on the other hand, does not comprise a set of practices that can be learnt. Rather, it is believed to be a form of possession by the ‘witch substance’ or creature, which resides in the body (abdomen, chest, scrotum, vagina, womb, head, armpit, etc.) and takes control of the possessed person.",
    "keywords": "development-programming, ending-vioelnce-against-women, pacific-women, short-paper, social-norms, violence",
    "name": "Sorcery and Witchcraft in Papua New Guinea: Problems in Definition",
    "url": "https://pacificdata.org/data/dataset/pwl-sorcery-and-witchcraft-in-papua-new-guinea-problems-in-definition"
}