{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-developing-insecurity-sorcery-witchcraft-and-melanesian-economic-development",
    "@type": "Dataset",
    "description": "This paper draws explicit links between witchcraft and sorcery practices and beliefs in Melanesia, and poor development outcomes. It notes four distinct categories of impact: \n\n- The prevalence of these beliefs and practices mean that many are unwilling to engage fully in the cash economy or to exploit their particular skills or opportunities to the maximum, so as to avoid becoming a target of an attack by a sorcerer or witch motivated by envy. \n\n- The prevalence of sorcery and witchcraft as explanations for misfortunes of all kinds, including lack of development, means that blame and responsibility for these factors are often avoided by the government officials and politicians who in many cases are responsible for them. \n\n- Sorcery and witchcraft accusations and counter-accusations can lead to immediate negative development outcomes through individual acts of violence or by provoking and fuelling large-scale tribal conflicts. Such conflicts often have long-term consequences for food security and housing for individuals, families and sometimes whole villages. \n\n- The climates of distrust and suspicion imparted by sorcery and witchcraft beliefs and fears erode family and communal bonds, undermining community development projects and communal support networks in general. \n\nGiven the pervasiveness of fear and mistrust that is haunting many communities in Melanesia, there is a need for development practitioners (including governments, non- government organisations and development organisations) to promote initiatives that seek to restore the social capital that is eroded by that fear and mistrust. \n\nThe case material presented suggests that it is important for development practitioners to work, not only with communities where relations are obviously strained and where there are antagonisms and competition, but also more widely, as such fear and mistrust may not always be visible. Given the importance of Christianity in Melanesia, there is an important role for churches in building trust and establishing social capital in communities fractured by fear and mistrust. Such outside facilitators can act as a very useful catalyst in encouraging communities to reflect critically on such beliefs and practices and to search for alternative explanations for misfortune or failure in particular instances.",
    "keywords": "development-programming, ending-violence-against-women, human-rights, pacific-women, short-paper, social-norms, violence",
    "name": "Developing Insecurity: Sorcery, Witchcraft and Melanesian Economic Development",
    "url": "https://pacificdata.org/data/dataset/pwl-developing-insecurity-sorcery-witchcraft-and-melanesian-economic-development"
}