{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/anthony2008ocean-acidification-causes-bleaching-and-productivity-loss-in-coral-reef-builders",
    "@type": "Dataset",
    "description": "Ocean acidification represents a key threat to coral reefs by reducing the calcification rate of the major reef framework builders.  In addition, acidification is likely to affect the important relationship between corals and their symbiotic dinoflagellates, and on the productivity of this association.  However, little is known about how acidification impacts on the physiology of key reef builders and how acidification interacts with warming.  Here, we report on an eight-week study that compared the bleaching, productivity and calcification responses of crustose coralline algae (CCA) and branching (Acropora) and massive (Porites) coral species in response to acidification and warming. Using a 30-tank flow-through experimental system, we manipulated CO2 levels to simulate doubling and 3- 4-fold increases (projection categories 4 and 6 of the IPCC) relative to present-day levels under cool and warm scenarios. Results demonstrated that acidification is a strong bleaching agent for corals and CCA, acting synergistically with warming to lower thermal thresholds for bleaching.  Overall, acidification impacted more strongly on bleaching and productivity than on calcification. Interestingly, the intermediate CO2 scenario under the warm conditions lead to an 30-50% increase in productivity in corals, whereas the high CO2 level lead to near-zero productivity. Productivity and calcification rates of CCA were more sensitive to acidification than those of corals, with high CO2 dosing leading to negative productivity and high rates of net dissolution. Our findings suggest that, if CO2- emission scenarios unfold as projected, sensitive reef-building species such as CCA may be pushed beyond their thresholds for growth and survival within the next few decades whereas corals will show delayed and mixed responses.  ",
    "keywords": "101594pangaea727744, algae, biological-response, calcification, corals, laboratory, multiple-factors, oaiccdb, ocean-acidification, otherprocess, primary-production, protists, respiration, south-pacific, temperature",
    "name": "Ocean acidification causes bleaching and productivity loss in coral reef builders",
    "url": "https://pacificdata.org/data/dataset/anthony2008ocean-acidification-causes-bleaching-and-productivity-loss-in-coral-reef-builders"
}