{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/sato2017chabitat-compression-and-expansion-of-sea-urchins-in-response-to-changing-climate-condi",
    "@type": "Dataset",
    "description": "Echinoid sea urchins with distributions along the continental shelf and slope of the eastern Pacific often dominate the megafauna community. This occurs despite their exposure to naturally low dissolved oxygen (DO) waters (\\textless60 $μ$mol kg−1) associated with the Oxygen Limited Zone and low-pH waters undersaturated with respect to calcium carbonate ($Ømega$CaCO3 \\textless 1). Here we present vertical depth distribution and density analyses of historical otter trawl data collected in the Southern California Bight (SCB) from 1994–2013 to address the question: Do changes in echinoid density and species' depth distributions along the continental margin in the SCB reflect observed secular or interannual changes in climate? Deep-dwelling burrowing urchins (Brissopsis pacifica, Brisaster spp. and Spatangus californicus), which are adapted to low-DO, low-pH conditions appeared to have expanded their vertical distributions and populations upslope over the past decade (2003–2013), and densities of the deep pink urchin, Strongylocentrotus fragilis, increased significantly in the upper 500 m of the SCB. Conversely, the shallower urchin, Lytechinus pictus, exhibited depth shoaling and density decreases within the upper 200 m of the SCB from 1994 to 2013. Oxygen and pH in the SCB also vary inter-annually due to varying strengths of the El Niño Southern Oscillation (ENSO). Changes in depth distributions and densities were correlated with bi-monthly ENSO climate indices in the region. Our results suggest that both a secular trend in ocean deoxygenation and acidification and varying strength of ENSO may be linked to echinoid species distributions and densities, creating habitat compression in some and habitat expansion in others. Potential life-history mechanisms underlying depth and density changes observed over these time periods include migration, mortality, and recruitment. These types of analyses are needed for a broad suite of benthic species in order to identify and manage climate-sensitive species on the margin.",
    "keywords": "abundance, biological-response, echinoderms, field, north-pacific, ocean-acidification, otherprocess",
    "name": "Habitat compression and expansion of sea urchins in response to changing climate conditions on the California continental shelf and slope (1994–2013)",
    "url": "https://pacificdata.org/data/dataset/sato2017chabitat-compression-and-expansion-of-sea-urchins-in-response-to-changing-climate-condi"
}