{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-the-relationship-between-vaw-and-wee-in-bougainville",
    "@type": "Dataset",
    "description": "The Bougainville Do No Harm research confirms that women do not always gain greater empowerment when they bring money into the household because their access to economic resources does not automatically give them control over those resources. Neither is violence towards them reduced. Bringing economic resources into the household may in fact heighten tensions over the expenditure of the resources. \n\nAn important implication of the research so far is that the design of women’s economic empowerment programs should avoid minimalist initiatives — that is, aiming simply to give women access to economic opportunities without any focus on gender and gender relations, especially the role of gender norms and practices in the context of marital relationships. Addressing women’s economic opportunities in isolation from other dimensions of their lives, including their household — where bargaining over resources takes place — can limit the overall gains possible for women. For example, a woman might be considered empowered economically, if she has (1) the ability to make decisions or influence decisions on issues of livelihood management (such as children’s education and general expenditure) and (2) she has access to and control over resources (including ownership of land and property, an equal role in managing and keeping family cash, her own independent income and control of her savings income). But the same woman may be disempowered in a number of other areas pertaining to the absence of certain personal freedoms (being subject to violence, freedom of movement, freedom to choose who to vote for, and freedom to use family planning). These limitations may be imposed not only by husbands but by social gender norms. \n\nAchieving women’s economic empowerment is contingent not only on having access to economic resources but also the removal of impediments to their freedom which disempower them in other ways.",
    "keywords": "autonomous-region-of-bougainville, development-programming, economic-empowerment, land-sea-and-livelihoods, pacific-women, short-paper, social-norms, violence",
    "name": "The Relationship between VAW and WEE in Bougainville",
    "url": "https://pacificdata.org/data/dataset/pwl-the-relationship-between-vaw-and-wee-in-bougainville"
}