{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-stocktake-of-gender-mainstreaming-in-tonga",
    "@type": "Dataset",
    "description": "The Pacific Community (SPC), in collaboration with the Asian Development Bank and UN Women conducts assessments of national governments’ capacity to conduct gender mainstreaming of programs and policies. The purpose of gender mainstreaming is to promote good governance and sustainable development through the integration of gender analysis at all levels of government. This entails the consideration and inclusion of gender perspectives in all government policy-making, programming and budgeting to ensure that a clear picture exists of the differing needs, experiences and perspectives of women and men. It also involves properly and equally addressing those differences, and supporting women in particular in areas where they have traditionally been marginalised. The stocktake methodology includes desk research, interviews, focus group discussions and strategic planning for further joint support by development agencies to Pacific Island Countries and Territories. The process involves a sample of government ministries, including those responsible for gender equality, as well as civil society groups and development agencies.\n\nThe stocktake reports on the national women’s machinery and the enabling environment for gender mainstreaming; and provides an analysis of the supports and constraints for gender mainstreaming across the whole of government.  It makes recommendations for strategic approaches for future gender mainstreaming in Tonga.",
    "keywords": "Report, development-programming, enhancing-agency, human-rights, leadership-and-politics, pacific-women, social-norms",
    "name": "Stocktake of Gender Mainstreaming in Tonga",
    "url": "https://pacificdata.org/data/dataset/pwl-stocktake-of-gender-mainstreaming-in-tonga"
}