{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/kamya2016near-future-ocean-acidification-enhances-the-feeding-rate-and-development-of-the-herbi",
    "@type": "Dataset",
    "description": "Population outbreaks of the corallivorous crown-of-thorns starfish, Acanthaster planci, are a major contributor to the decline in coral reef across the Indo-Pacific. The success of A. planci and other reef species in a changing ocean will be influenced by juvenile performance because the naturally high mortality experienced at this sensitive life history stage maybe exacerbated by ocean warming and acidification. We investigated the effects of increased temperature and acidification on growth of newly metamorphosed juvenile A. planci and their feeding rates on crustose coralline algae (CCA) during the initial herbivorous phase of their life history. The juveniles were exposed to three temperature (26, 28, 30 °C) and three pH (NIST scale: 8.1, 7.8, 7.6) levels in a flow-through cross-factorial experiment. There were positive but independent effects of warming and acidification on juvenile growth and feeding. Early juveniles were highly tolerant to moderate increases in temperature (+2 °C above ambient) with the highest growth at 30 °C. Growth and feeding rates of A. planci on CCA were highest at pH 7.6. Thus, ocean warming and acidification may enhance the success of A. planci juveniles. In contrast to its coral prey, at this vulnerable developmental stage, A. planci appears to be highly resilient to future ocean change. Success of juveniles in a future ocean may have carry-over effects into the coral-eating life stage, increasing the threat to coral reef systems. ",
    "keywords": "biological-response, echinoderms, growth, laboratory, morphology, multiple-factors, ocean-acidification, performance, south-pacific, temperature",
    "name": "Near-future ocean acidification enhances the feeding rate and development of the herbivorous juveniles of the crown-of-thorns starfish, Acanthaster planci",
    "url": "https://pacificdata.org/data/dataset/kamya2016near-future-ocean-acidification-enhances-the-feeding-rate-and-development-of-the-herbi"
}