{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-political-representation-and-women-s-empowerment-in-samoa",
    "@type": "Dataset",
    "description": "Samoan women have achieved approximate equality to men in most modern spheres of government and the economy, but have never succeeded in winning more than five seats in the 49-seat parliament. Samoa has been among the countries ranked lowest in the world for women’s representation in parliament: in 2015 it ranked 128 out of 140 countries.\n\nThis comprehensive research consisted of:\n\n- A nationwide survey of women’s participation in political and economic village-based organisations, covering all villages and sub-villages in Samoa.\n\n- A qualitative study of village organisation in a sample of 30 villages with and without formal obstacles to women’s participation in village government.\n\n- Interviews of women candidates who have stood for past elections.\n\nThe research found that the system of traditional village government in Samoa presents significant barriers that limit women’s access to and participation in decision-making forums in local government councils, church leadership, school management and community-based organisations.  Without significant participation in leadership decision-making at the village level, it is difficult for women to become – or to be seen as – national leaders.\n\nObstacles to women standing for or being elected to parliament include many cultural factors. Traditional villages have long been organised around separate statuses and roles of men and women in which executive authority is vested in men. \n\nSince the 1960s, increasing numbers of women have become matai, often in recognition of their educational and career achievements; however of all village-based matai, only about 5% are women and 19 villages do not recognise women matai on the grounds of tradition.  This is an impediment to women wishing to stand for parliamentary elections because village councils are highly influential in elections.  The most common obstacle to women’s voice in local government is that very few women matai sit in the village councils.  This is an unspoken norm, often justified by the customary concept of ‘o le va tapuia’ (sacred space).\n\nWhilst much of Samoa’s social stability rests on the continued effectiveness of village concils and churches in village government, the exclusion or marginalisation of women’s voices in the governing of Samoa’s villages and at national level is likely to be counterproductive in relation to some of Samoa’s development issues.",
    "keywords": "data, leadership-and-decision-making, leadership-and-policitcs, pacific-women, research-report, social-norms",
    "name": "Political Representation and Women’s Empowerment in Samoa",
    "url": "https://pacificdata.org/data/dataset/pwl-political-representation-and-women-s-empowerment-in-samoa"
}