{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/gao2016ban-ocean-acidification-acclimatised-green-tide-alga-is-robust-to-changes-of-seawater-ca",
    "@type": "Dataset",
    "description": "Ulva is the dominant genus in the green tide events and is considered to have efficient CO2 concentrating mechanisms (CCMs). However, little is understood regarding the impacts of ocean acidification on the CCMs of Ulva and the consequences of thalli's acclimation to ocean acidification in terms of responding to environmental factors. Here, we grew a cosmopolitan green alga, Ulva linza at ambient (LC) and elevated (HC) CO2 levels and investigated the alteration of CCMs in U. linza grown at HC and its responses to the changed seawater carbon chemistry and light intensity. The inhibitors experiment for photosynthetic inorganic carbon utilization demonstrated that acidic compartments, extracellular carbonic anhydrase (CA) and intracellular CA worked together in the thalli grown at LC and the acquisition of exogenous carbon source in the thalli could be attributed to the collaboration of acidic compartments and extracellular CA. Contrastingly, when U. linza was grown at HC, extracellular CA was completely inhibited, acidic compartments and intracellular CA were also down-regulated to different extents and thus the acquisition of exogenous carbon source solely relied on acidic compartments. The down-regulated CCMs in U. linza did not affect its responses to changes of seawater carbon chemistry but led to a decrease of net photosynthetic rate when thalli were exposed to increased light intensity. This decrease could be attributed to photodamage caused by the combination of the saved energy due to the down-regulated CCMs and high light intensity. Our findings suggest future ocean acidification might impose depressing effects on green tide events when combined with increased light exposure.",
    "keywords": "adaptation, algae, biological-response, growth, laboratory, light, multiple-factors, north-pacific, ocean-acidification, photosynthesis, physiology, primary-production",
    "name": "An ocean acidification acclimatised green tide alga is robust to changes of seawater carbon chemistry but vulnerable to light stress",
    "url": "https://pacificdata.org/data/dataset/gao2016ban-ocean-acidification-acclimatised-green-tide-alga-is-robust-to-changes-of-seawater-ca"
}