{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/mathis2011cthe-role-of-ocean-acidification-in-systemic-carbonate-mineral-suppression-in-the-ber",
    "@type": "Dataset",
    "description": "Ocean acidification driven by absorption of anthropogenic carbon dioxide (CO2) from the atmosphere is now recognized as a systemic, global process that could threaten diverse marine ecosystems and a number of commercially important species. The change in calcium carbonate (CaCO3) mineral saturation states (omega) brought on by the reduction of seawater pH is most pronounced in high latitude regions where unique biogeochemical processes create an environment more susceptible to the suppression of omega values for aragonite and calcite, which are critical to shell building organisms. New observations from the eastern Bering Sea shelf show that remineralization of organic matter exported from surface waters rapidly increases bottom water CO2 concentrations over the shelf in summer and fall, suppressing omega values. The removal of CO2 from surface waters by high rates of phytoplankton primary production increases omega values between spring and summer, but these increases are partly counteracted by mixing with sea ice melt water and terrestrial river runoff that have low omega values. While these environmental processes play an important role in creating seasonally low saturation states, ocean uptake of anthropogenic CO2 has shifted omega values for aragonite to below the saturation horizon in broad regions across the shelf for at least several months each year. Furthermore, we also report that calcite became undersaturated in September of 2009 in the bottom waters over the shelf. The reduction in CaCO3 mineral saturation states could have profound implications for several keystone calcifying species in the Bering Sea, particularly the commercially important crab fisheries.  ",
    "keywords": "biogeochemistry, chemistry, field, north-pacific, ocean-acidification",
    "name": "The role of ocean acidification in systemic carbonate mineral suppression in the Bering Sea",
    "url": "https://pacificdata.org/data/dataset/mathis2011cthe-role-of-ocean-acidification-in-systemic-carbonate-mineral-suppression-in-the-ber"
}