{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-pacific-women-and-fiji-women-s-fund-fiji-annual-reflection-and-planning-workshop-2018-report",
    "@type": "Dataset",
    "description": "This report summarises the workshop approach, objectives, key learning outcomes and participant recommendations of the third Pacific Women and Fiji Women’s Fund Fiji Annual Reflection and Planning Workshop. \n\nThe workshop objectives were to: \n\n- Enable Fiji Government, civil society and stakeholders to reflect on overall progress and key issues to advance gender equality in Fiji. \n\n- Update grantees of the Fund on findings from its six-monthly report analysis. \n\n- Enable grantees and partners to share current progress in advancing women’s empowerment, including women’s economic empowerment, women’s leadership, coalition building and ending violence against women. \n\n-  Provide an opportunity for grantees and partners to increase knowledge and skills in key areas through peer learning and expert panels. \n\n- Facilitate stronger relationships between grantees, partners and other stakeholders. \n\nThis report analyses the three key issues raised at the reflection and planning workshop. The first key issue is the current operating context of Pacific Women partners and the Fund grantees. The second issue is the strategies used by partners and grantees in response to gender equality issues. The third issue is achieving transformational change in support of gender equality. The report also documents skills building sessions and captures grantee feedback on the Fund’s operations.",
    "keywords": "Report, data, developemnt-programming, economic-empowerment, ending-violence-against-women, enhancing-agency, human-rights, land-sea-and-livelihoods, leadership-and-politics, leadershp-and-decision-making, pacific-women, social-norms, vioelnce",
    "name": "Pacific Women and Fiji Women’s Fund Fiji Annual Reflection and Planning Workshop 2018 Report",
    "url": "https://pacificdata.org/data/dataset/pwl-pacific-women-and-fiji-women-s-fund-fiji-annual-reflection-and-planning-workshop-2018-report"
}