{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/papua-new-guinea-bathymetry-survey-technical-report-er115",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((139.20137452543452 -14.748448665973001, 139.20137452543452 2.5923770264788, 162.80337908773708 2.5923770264788, 162.80337908773708 -14.748448665973001, 139.20137452543452 -14.748448665973001))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "The Pacific Islands Applied Geoscience Commission, SOPAC, carried out a marine survey for Papua New Guinea around, Madang, Sissano and Vanimo. \nThis report describes the high-resolution bathymetric mapping survey carried out over a period\nof three weeks from 28 May to 15 June 2006, resulting in the acquisition of over 733 line-km of\nMBES data. The survey achieved variable coverage of 50–100% (less for shallow water areas)\nof the seafloor from approximately 50 m in the inshore area to an average offshore distance of 4\nkm, reaching maximum water depths of some 2000 m.\nThe dashed line in Bathymetric map of Papua New Guinea illustrates approximate boundary of PNG Exclusive Economic Zone (EEZ). The wave and current regime inside Madang lagoon and Vanimo harbour was also investigated. \nThis work was initiated by the SOPAC/EU Reducing Vulnerability of Pacific ACP States ProjectThe objective of the survey contained in the report was to investigate the seabed and provide information about water depths around the islands using a Multibeam echosounder (MBES).Coastline: The coastline is dominated mostly by coral reefs, with mountain ranges rising directly from the sea or from narrow coastal plains.",
    "keywords": "exclusive-economic-zone, papua-new-guinea",
    "name": "Papua New Guinea Bathymetry Survey Technical Report, (ER115)",
    "url": "https://pacificdata.org/data/dataset/papua-new-guinea-bathymetry-survey-technical-report-er115"
}