{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/zhang2018dorigin-and-dynamics-of-dissolved-organic-matter-in-a-mariculture-area-suffering-from-",
    "@type": "Dataset",
    "description": "Based on six cruises from March to September in 2016, we investigated monthly distributions of dissolved organic matter (DOM) and ancillary water chemistry parameters in a mariculture area in the Northern Yellow Sea, where summertime hypoxia and seawater acidification were observed. The most severe oxygen depletion (hypoxia covered approximately one-third of the aquaculture area) and the largest pH decrease (8.07 ± 0.05 in surface layer vs. 7.66 ± 0.07 in bottom layer) were revealed in August. Concentration of dissolved organic carbon (DOC) and the absorption properties of chromophoric DOM (CDOM) were used to characterize DOM. Results showed that DOM mainly originated from marine in situ processes. In March, a DOM pool with the lowest DOC concentration of 211 ± 23 $μ$mol L−1 and nearly uniform optical characteristics were presented in the well-mixed water column. In August, however, DOC increased to 361 ± 29 $μ$mol L−1 in the surface layer and 342 ± 25 $μ$mol L−1 in the bottom layer. Two non-linear relationships between the absorption coefficient at 355 nm [aCDOM(355)] and the absorption spectral slope over 275–295 nm (S275−295) were revealed. According to modeling results, the non-linear relationships were mostly caused by the conservative mixing of a refractory CDOM pool with a freshly produced CDOM pool. Apparent oxygen utilization in August was positively related to DOC, but not to aCDOM(355) and S275−295, presumably due to multiple sources of CDOM in bottom waters. Both aCDOM(355) and S275−295 respond largely to decreasing pH; however, they would be less affected by ocean acidification since this process leads to a limited pH decline.",
    "keywords": "chemistry, field, north-pacific, ocean-acidification",
    "name": "Origin and dynamics of dissolved organic matter in a mariculture area suffering from summertime hypoxia and acidification",
    "url": "https://pacificdata.org/data/dataset/zhang2018dorigin-and-dynamics-of-dissolved-organic-matter-in-a-mariculture-area-suffering-from-"
}