{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-women-mps-in-samoa-and-kiribati",
    "@type": "Dataset",
    "description": "This short paper looks at the example of women parliamentarians in Kiribati and Samoa to identify common characteristics of women who have been successful at being elected: \n\n- Coming from a large and influential family provides an important ‘base vote’, willing campaign helpers, and potential financiers. Women MPs also tend to come from political families. That is, one or both of their parents, uncles or brothers have tended to have been in politics and they often act as patrons and mentors. \n\n- Women MPs tend to have above-average levels of education — usually from overseas. \n\n- The most common pre-political background for Pacific MPs has been the public service. \n\n- Along with a profile, having a good reputation is important for any prospective candidate in the Pacific. There are all manner of community events — weddings, funerals, birthdays etc. — that could be included here, but most of these revolve around church activities. Many MPs, including women, hold leadership positions with local churches and derive a reputation for community involvement. \n\n- Two in particular campaign strategies stand out for women: First, or those with a large national profile and significant financial resources, involvement in day-to-day community events is often unnecessary as they largely win on the basis of being well known. Secondly, most women MPs in the Pacific tend to form part of a group of waged elites who retain connections with their constituency while working away in the capital and who return and contest on the strength of that reputation. This requires years of hard work, but those who do not put in the time and effort are unlikely to succeed. \n\n- One common entry point for women MPs is via by-elections where their husband, brother, father or uncle passes away, leaving their seat vacant.",
    "keywords": "leadership-and-decision-making, leadership-and-politics, pacific-women, short-paper, social-norms",
    "name": "Women MPs in Samoa and Kiribati",
    "url": "https://pacificdata.org/data/dataset/pwl-women-mps-in-samoa-and-kiribati"
}