{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/lidecomposing-monthly-declines-in-subsurface-water-ph-and-aragonite-saturation-state-from-sprin",
    "@type": "Dataset",
    "description": "The North Yellow Sea (NYS) is a western North Pacific marginal sea of major ecological and economic importance, where seasonal thermocline and subsurface cold water mass are well developed from spring to autumn. Earlier researchers have shown monthly/bimonthly declines of pH ($Δ$pH) and aragonite saturation state ($Δ$$Ømega$arag) in the NYS cold water mass. To quantify the biogeochemical processes controlling these variations, we applied a systematic decomposition methodology to $Δ$$Ømega$arag and $Δ$pH values, using the Redfield ratio and published data sets of NYS carbonate and ancillary parameters for 2011 and 2013. Results show that the contributions of the NYS cold water mass community respiration ($Δ$$Ømega$Resp), calcification ($Δ$$Ømega$Calc) and temperature changes ($Δ$$Ømega$$Δ$T) to the monthly $Δ$$Ømega$arag from spring to summer were 84±9%, 30±16%, and −13±10%, while the $Δ$$Ømega$Resp, $Δ$$Ømega$$Δ$T and contributions of CaCO3 dissolution ($Δ$$Ømega$Diss) to the bimonthly $Δ$$Ømega$arag from late summer to autumn were 103%, 1% and −5%. Meanwhile, the contributions of the NYS cold water mass community respiration ($Δ$pHResp), temperature changes ($Δ$pH$Δ$T) and calcification ($Δ$pHCalc) to the monthly $Δ$pH from spring to summer were 50±23%, 39±23%, and 13±4%, while the $Δ$pHResp, $Δ$pH$Δ$T and contributions of CaCO3 dissolution ($Δ$pHDiss) to the bimonthly $Δ$pH from late summer to autumn were 110%, −5%, and −5%. Our results suggest that the NYS cold water mass net calcification rate declines to nearly zero when $Ømega$arag reaches a critical level of 1.5−1.6. Using a future scenario to predict the impacts of rising atmospheric CO2 levels on seasonal variations of $Ømega$arag and pH values, we show that very low $Ømega$arag values of \\textless1.5 may exist all year round in the NYS subsurface waters by the 2050 s, while aragonite undersaturated water ($Ømega$arag \\textless1) may appear in autumn months, causing great stress to its benthic faunal community.",
    "keywords": "chemistry, field, north-pacific, ocean-acidification",
    "name": "Decomposing monthly declines in subsurface-water pH and aragonite saturation state from spring to autumn in the North Yellow Sea",
    "url": "https://pacificdata.org/data/dataset/lidecomposing-monthly-declines-in-subsurface-water-ph-and-aragonite-saturation-state-from-sprin"
}