{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/kiribati-exclusive-economic-zone-gilbert-islands",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((167.8692703406989 -4.361697222222119, 167.8692703406989 5.617075000105842, 180.1797277777781 5.617075000105842, 180.1797277777781 -4.361697222222119, 167.8692703406989 -4.361697222222119))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "The Marine Zones (Declaration) Act 2011 repeals the Marine Zones (Declaration) Act 1983. It states that the exclusive economic zone comprises those waters beyond the territorial sea of Kiribati, but within a distance of two hundred (200) nautical miles from the baseline of Kiribati, shall be the exclusive economic zone of the Republic of Kiribati.\r\n\r\nThe Exclusive Economic Zone Sea Outer Limits Regulations 2014 in accordance with the MZA 2011 specifies the geographical coordinates that defines the boundaries of Cook Islands EEZ and are referenced to the World Geodetic System 1984 (WGS 84). The Regulations also contains charts for general illustrations of the territorial sea lines. Kiribati has sovereignty beyond its land territory and internal waters over the territorial sea, and to the airspace above and the seabed and subsoil beneath the territorial sea. Ships of all States shall enjoy the right of innocent passage in accordance with international law in the territorial sea of Kiribati.\r\n\r\nThe following information are also highlighted in the Regulation\r\n\r\n(i) a treaty reference point (for the relevant treaty for a point, see section 4), or (ii) 200 nm, where the exclusive economic zone is adjacent to the high seas.\r\n\r\nWhere an agreement is in force between the Republic of Kiribati and an opposite or adjacent coastal State provides for the delimitation of an exclusive economic zone boundary, the relevant area of exclusive economic zone shall be delimited in accordance with such agreement.\r\n\r\nhttp://www.un.org/Depts/los/LEGISLATIONANDTREATIES/PDFFILES/KIR_2011_Act.pdf https://www.un.org/Depts//los/LEGISLATIONANDTREATIES/PDFFILES/KIR_2014_eez_outer_limits_regulations.pdf",
    "keywords": "200NM, EEZ, Gilbert Islands, KI, Kiribati, Kiribati Exclusive Economic Zone",
    "name": "Kiribati Exclusive Economic Zone - 200 Nautical Miles (Gilbert Group)",
    "url": "https://pacificdata.org/data/dataset/kiribati-exclusive-economic-zone-gilbert-islands"
}