{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/rivest2018ahost-and-symbionts-in-pocillopora-damicornis-larvae-display-different-transcriptomic",
    "@type": "Dataset",
    "description": "As global ocean change progresses, reef-building corals and their early life history stages will rely on physiological plasticity to tolerate new environmental conditions. Larvae from brooding coral species contain algal symbionts upon release, which assist with the energy requirements of dispersal and metamorphosis. Global ocean change threatens the success of larval dispersal and settlement by challenging the performance of the larvae and of the symbiosis. In this study, larvae of the reef-building coral Pocillopora damicornis were exposed to elevated pCO2 and temperature to examine the performance of the coral and its symbionts in situ and better understand the mechanisms of physiological plasticity and stress tolerance in response to multiple stressors. We generated a de novo holobiont transcriptome containing coral host and algal symbiont transcripts and bioinformatically filtered the assembly into host and symbiont components for downstream analyses. Seventeen coral genes were differentially expressed in response to the combined effects of pCO2 and temperature. In the symbiont, 89 genes were differentially expressed in response to pCO2. Our results indicate that many of the whole-organism (holobiont) responses previously observed for P. damicornis larvae in scenarios of ocean acidification and warming may reflect the physiological capacity of larvae to cope with the environmental changes without expressing additional protective mechanisms. At the holobiont level, the results suggest that the responses of symbionts to future ocean conditions could play a large role in shaping success of coral larval stages.",
    "keywords": "abundance, biological-response, corals, laboratory, molecular-biology, morphology, multiple-factors, ocean-acidification, otherprocess, physiology, protists, south-pacific, temperature",
    "name": "Host and symbionts in Pocillopora damicornis larvae display different transcriptomic responses to ocean acidification and warming",
    "url": "https://pacificdata.org/data/dataset/rivest2018ahost-and-symbionts-in-pocillopora-damicornis-larvae-display-different-transcriptomic"
}