{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-economic-status-of-women-in-the-pacific",
    "@type": "Dataset",
    "description": "Key findings of the research note are: \n\n- In 2010 the Pacific region lost 65 percent in potential human development due to gender inequality. But this average hides considerable regional differences. \n\n- Papua New Guinea and Solomon Islands have high gender inequality, but perhaps surprisingly, so do the Federated States of Micronesia and Nauru. \n\n- Polynesia averages the same as high human development nations, with an average loss of 57 percent in potential human development due to gender inequality. \n\n- Cook Islands, Niue and Fiji have the least gender inequality of the Pacific region. \n\n- Gender inequality in Solomon Islands appears to have increased considerably due to the ethnic conflict limiting women’s participation in the work force and access to education. \n\n- High maternal mortality rates correlate with a lower percentage of births attended by skilled health personnel. However, Samoa and Tonga have high maternal mortality rates despite nearly 100 percent of births attended by skilled health professionals. \n\n- In Melanesia, Papua New Guinea has the worst female to male education rates (12 percent to 24 percent), followed by Solomon Islands (32 percent to 38 percent). \n\n- High fertility rates across the Pacific suggest an essentially reproductive role for women, which limit economic and political participation. \n\n- In developed countries, life expectancy for women is 5 to 10 years higher than men. Most Pacific nations fall below this norm, but especially PNG and Solomon Islands (+1 year).",
    "keywords": "Education, Health, data, development-progamming, economic-empowerment, factsheet, land-sea-and-livelihoods, pacific-women, policy-notes-and-papers, social-norms",
    "name": "Economic Status of Women in the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-economic-status-of-women-in-the-pacific"
}