{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/tokelau-territorial-sea-12-nautical-mile",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((184.11193970795122 -11.048131664144762, 184.11193970795122 -6.46642777781949, 191.99540869605468 -6.46642777781949, 191.99540869605468 -11.048131664144762, 184.11193970795122 -11.048131664144762))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "Tokelau has been on the United Nations list of Non-Self-Governing Territories since 1946, following the declaration of the intention by New Zealand to transmit information on the Tokelau Islands under Article 73 e of the Charter of the United Nations.\r\n•\tSee General Assembly resolution 66 (I) of 14 December 1946\r\n\r\nAdministering Power - New Zealand\r\n\r\nThe Tokelau (Territorial Sea and Exclusive Economic Zone) Act 1977 defines the territorial sea as those areas of the sea having, as their inner limits, the baseline measured from the low-water line along the seaward edge of the reef, except that where there is a break or passage through or over the reef, the baseline shall be a straight line joining the entrance points of that break or passage and, as their outer limits, a line measured seaward from that baseline, every point of which is distant 12 nautical miles from the nearest point of that baseline.\r\n\r\nProhibition of foreign fishing in territorial sea \r\n(1) No foreign fishing craft shall be used for fishing within the territorial sea. \r\n(2) Where any foreign fishing craft is used in contravention of subsection (1) of this section, each of them the owner, the master and every crew member of the craft commits an offence against this Act and is liable on conviction: \r\n(a) In the case of the owner or master, to a fine not exceeding $100,000; and \r\n(b) In the case of any other crew member, to a fine not exceeding $5,000. \r\n\r\n(3) The Court, on the conviction of any person of an offence under this section, may order in addition to any penalty that it may impose: \r\n(a) The immediate forfeiture to the Crown of the foreign fishing craft in respect of which the offence was committed, and of any equipment on board or used by the craft, and of any fish on board the craft; or \r\n(b) The detention for a specified period of the foreign fishing craft and of any such equipment and fish, and the forfeiture to the Crown of the craft, equipment and fish if any fine or fines imposed in respect of the offence are not paid within that specified period.\r\n\r\nhttps://www.un.org/depts/los/LEGISLATIONANDTREATIES/PDFFILES/NZL_1977_Act.pdf\r\n\r\nhttps://www.un.org/dppa/decolonization/en/nsgt/tokelau\r\n\r\n",
    "keywords": "12NM",
    "name": "Tokelau Territorial Sea (12 Nautical Mile)",
    "url": "https://pacificdata.org/data/dataset/tokelau-territorial-sea-12-nautical-mile"
}