{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/yates2006co32-concentration-and-pco2-thresholds-for-calcification-and-dissolution-on-the-moloka",
    "@type": "Dataset",
    "description": "The severity of the impact of elevated atmospheric pCO2 to coral reef ecosystems depends, in part, on how seawater pCO2 affects the balance between calcification and dissolution of carbonate sediments. Presently, there are insufficient published data that relate concentrations of pCO2 and CO32− to in situ rates of reef calcification in natural settings to accurately predict the impact of elevated atmospheric pCO2 on calcification and dissolution processes. Rates of net calcification and dissolution, CO32− concentrations, and pCO2 were measured, in situ, on patch reefs, bare sand, and coral rubble on the Molokai reef flat in Hawaii. Rates of calcification ranged from 0.03 to 2.30 mmol CaCO3 m−2 h−1 and dissolution ranged from –0.05 to –3.3 mmol CaCO3 m−2 h−1. Calcification and dissolution varied diurnally with net calcification primarily occurring during the day and net dissolution occurring at night. These data were used to calculate threshold values for pCO2 and CO32− at which rates of calcification and dissolution are equivalent. Results indicate that calcification and dissolution are linearly correlated with both CO32− and pCO2. Threshold pCO2 and CO32− values for individual substrate types showed considerable variation. The average pCO2 threshold value for all substrate types was 654±195 $μ$atm and ranged from 467 to 1003 $μ$atm. The average CO32− threshold value was 152±24 $μ$mol kg−1, ranging from 113 to 184 $μ$mol kg−1. Ambient seawater measurements of pCO2 and CO32− indicate that CO32− and pCO2 threshold values for all substrate types were both exceeded, simultaneously, 13% of the time at present day atmospheric pCO2 concentrations. It is predicted that atmospheric pCO2 will exceed the average pCO2 threshold value for calcification and dissolution on the Molokai reef flat by the year 2100. ",
    "keywords": "101594pangaea743388, biological-response, calcification, corals, dissolution, field, north-pacific, oaiccdb, ocean-acidification, yates2006",
    "name": "CO32- concentration and pCO2 thresholds for calcification and dissolution on the Molokai reef flat, Hawaii",
    "url": "https://pacificdata.org/data/dataset/yates2006co32-concentration-and-pco2-thresholds-for-calcification-and-dissolution-on-the-moloka"
}