{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-gender-based-violence-prevention-lessons-from-world-bank-impact-evaluations",
    "@type": "Dataset",
    "description": "Emerging policy lessons from World Bank evaluations of programs to prevent violence against women include: \n\n- Programs to increase women’s economic empowerment may reduce GBV by increasing women’s bargaining power and ability to leave abusive relationships, though there are also risks that increased empowerment could threaten household patriarchies and exacerbate violence. \n\n- Gender norms and attitudes are shaped by history andcontext, and are often resistant to change. Social norms about gender roles and violence can influence the risk of experiencing GBV. Since gendered expectations and limitations on agency can establish a pattern of subordination and voicelessness, changing norms can be an important part of a comprehensive approach to violence prevention. Creating groups or a safe space where participants can meet and have positive interactions is an important component of many programmatic approaches to changing behaviors, attitudes and norms related to violence. \n\n- Involving men in interventions that aim to empower women and reduce violence can be critical. \n\n- For any intervention it is important to consider the duration (length of intervention) and frequency (of activities) needed to achieve the desired outcome. The evidence base on this is still very small; few interventions have compared multiple frequencies and durations.",
    "keywords": "development-programming, ending-violence-against-women, factsheet, pacific-women, social-norms, violence",
    "name": "Gender-Based Violence Prevention: Lessons from World Bank Impact Evaluations",
    "url": "https://pacificdata.org/data/dataset/pwl-gender-based-violence-prevention-lessons-from-world-bank-impact-evaluations"
}