{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/thisner2016effects-of-ocean-acidification-on-sperm-motility-in-the-red-abalone-haliotis-rufesce",
    "@type": "Dataset",
    "description": "Fossil fuel emissions are changing global temperature and ocean water chemistry. These changes are already altering the seasonal upwelling events that bring deeper ocean water with lower temperature, dissolved oxygen, and pH to shallower areas of the California Current Large Marine Ecosystem. For example, increase absorption of CO2 by the ocean is expected to lower the pH of current upwelling events (observed to be ̃7.5) by a further 0.4 pH units. These changes in seawater chemistry are expected to affect reproduction, growth, and survival for many coastal marine invertebrates. To gain insights into this process, this study seeks to evaluate the effects of ocean acidification on the swimming behavior of sperm from the red abalone (Haliotis rufescens), an economically and ecologically important species along the California coast. Abalone and many other marine organisms reproduce by releasing gametes into the ocean and fertilization success may be influenced by ocean conditions during this process. The effects of pH on sperm swimming behavior, which likely play an important role during fertilization, are unknown for red abalone. Thus, evaluating sperm motility under different pH conditions may reveal how fertilization could be affected by seawater chemistry. In this experiment, sperm were exposed to a pH of 8.0 and pH of 7.2 for one minute. Samples of sperm were recorded by video and analyzed using ImageJ ManualTracking software to measure speed. No significant difference in sperm speed was found between the high and low pH for this experiment. These findings will help gain insights into the effects of ocean acidification on the reproductive success of red abalone and other coastal marine invertebrates with similar reproductive modes.",
    "keywords": "biological-response, laboratory, mollusks, north-pacific, ocean-acidification, performance, reproduction",
    "name": "Effects of ocean acidification on sperm motility in the red abalone, Haliotis rufescens",
    "url": "https://pacificdata.org/data/dataset/thisner2016effects-of-ocean-acidification-on-sperm-motility-in-the-red-abalone-haliotis-rufesce"
}