{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/hurd2011metabolically-induced-ph-fluctuations-by-some-coastal-calcifiers-exceed-projected-22nd-",
    "@type": "Dataset",
    "description": "Anthropogenically-mediated decreases in pH, termed ocean acidification (OA), may be a major threat to marine organisms and communities. Research has focussed mainly on tropical coral reefs, but temperate reefs play a no less important ecological role in colder waters, where OA effects may first be manifest. Here, we report that trends in pH at the surface of three ecologically-important cold-water calcifiers (a primary producer and herbivores), under a range of fluid flows, differ substantially from one another, and for two of the three calcifiers the pH, during darkness, is lower than the mean projected pH due to OA for the surface waters of the global ocean beyond the year 2100. Using micro-optodes, we show that each calcifier had a different pH gradient between its surface and mainstream seawater, i.e. within the diffusion boundary layer which appears to act as an environmental buffer to mainstream pH. Abalone encountered only mainstream seawater pH, whereas pH at the sea urchins' surface was reduced by ̃0.35 units. For coralline algae, pH was \\̃0.5 units higher in the light and \\~̃0.35 units lower under darkness than in ambient mainstream seawater. This wide range of pH within the DBL of some calcifiers will probably affect their performance under projected future reductions in pH due to OA. Differing exposure to a range of surface pH may result in differential susceptibility of calcifiers to OA. Such fluctuations are no doubt regulated by the interplay of water movement, morphology and metabolic rates (e.g. respiration, calcification and/or photosynthesis). Our study, by considering physics (flow regime), chemistry (pH gradients versus OA future projections) and biology (trophic level, physiology and morphology), reveals that predicting species-specific responses and subsequent ecosystem restructuring to OA is complex and requires a holistic, ecomechanical, approach.  ",
    "keywords": "algae, biological-response, chemistry, echinoderms, laboratory, mollusks, oaiccincomplete, ocean-acidification, south-pacific",
    "name": "Metabolically-induced pH fluctuations by some coastal calcifiers exceed projected 22nd century ocean acidification: a mechanism for differential susceptibility?",
    "url": "https://pacificdata.org/data/dataset/hurd2011metabolically-induced-ph-fluctuations-by-some-coastal-calcifiers-exceed-projected-22nd-"
}