{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/anthony2013benthic-buffers-and-boosters-of-ocean-acidification-on-coral-reefs",
    "@type": "Dataset",
    "description": "Ocean acidification is a threat to marine ecosystems globally. In shallow-water systems, however, ocean acidification can be masked by benthic carbon fluxes, depending on community composition, seawater residence time, and the magnitude and balance of net community production (NCP) and calcification (NCC). Here, we examine how six benthic groups from a coral reef environment on Heron Reef (Great Barrier Reef, Australia) contribute to changes in the seawater aragonite saturation state ($Ømega$a). Results of flume studies using intact reef habitats (1.2 m by 0.4 m), showed a hierarchy of responses across groups, depending on CO2 level, time of day and water flow. At low CO2 (350–450 $μ$atm), macroalgae (Chnoospora implexa), turfs and sand elevated $Ømega$a of the flume water by around 0.10 to 1.20 h−1 – normalised to contributions from 1 m2 of benthos to a 1 m deep water column. The rate of $Ømega$a increase in these groups was doubled under acidification (560–700 $μ$atm) and high flow (35 compared to 8 cm s−1). In contrast, branching corals (Acropora aspera) increased $Ømega$a by 0.25 h−1 at ambient CO2 (350–450 $μ$atm) during the day, but reduced $Ømega$a under acidification and high flow. Nighttime changes in $Ømega$a by corals were highly negative (0.6–0.8 h−1) and exacerbated by acidification. Calcifying macroalgae (Halimeda spp.) raised $Ømega$a by day (by around 0.13 h−1), but lowered $Ømega$a by a similar or higher amount at night. Analyses of carbon flux contributions from benthic communities with four different compositions to the reef water carbon chemistry across Heron Reef flat and lagoon indicated that the net lowering of $Ømega$a by coral-dominated areas can to some extent be countered by long water-residence times in neighbouring areas dominated by turfs, macroalgae and carbonate sand.  ",
    "keywords": "algae, biological-response, brcommunity, calcification, chemistry, corals, laboratory, oaiccnoanswer, ocean-acidification, primary-production, south-pacific",
    "name": "Benthic buffers and boosters of ocean acidification on coral reefs",
    "url": "https://pacificdata.org/data/dataset/anthony2013benthic-buffers-and-boosters-of-ocean-acidification-on-coral-reefs"
}