{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/samoa-south-upolu-2004-bathymetry-chart-no-7-1",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((186.2253093499468 -17.555268752861593, 186.2253093499468 -10.024476331617223, 194.79916666680836 -10.024476331617223, 194.79916666680836 -17.555268752861593, 186.2253093499468 -17.555268752861593))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "This record holds the bathymetry chart of the Southern foreshore areas of Upolu, Samoa. The chart is the result of the multibeam bathymetry survey that was undertaken by the Applied Geoscience and Technology Division (SOPAC) of SPC around the islands of Savaii and Upolu for the EU-SOPAC Samoa Survey. High-resolution bathymetric mapping survey was carried out ,resulting in the acquisition of over 2754 line-km of MBES data for the whole of Samoa Survey. The entire survey achieved 100% coverage of the seafloor from approximately 50 m depth in the near-shore area to an average offshore distance of 10 km, reaching water depths of some 1500 m. The resultant data compilation was used to produce bathymetry charts and XYZ datasets available from a separate record . This work was initiated by the SOPAC/EU Reducing Vulnerability of Pacific ACP States Project (Task no.: NR 1.1.1). The result of the survey conducted in this area is presented as Chart 7 of the Samoa High resolution bathymetric survey and can be downloaded from this record under the Distribution Info section with appropriate permission from the Secretariat.The bathymetry chart also includes smaller-scale insets of 3D images, slope angle and shaded relief maps.The objective of the survey was to investigate the seabed and provide information about water depths around the islands using a multibeam echosounder (MBES). These new bathymetric maps provide a descriptive picture of the ocean bottom terrain, vividly revealing the size, shape and distribution of underwater features. They serve as the basic tool for scientific, engineering, marine geophysical and environmental studies, as well as for marine and coastal resource management.DECSCIPTION  of MORPHOLOGICAL FEATURES in Chart 7  The shelf break is narrow and occurs at approximatley 2 km offshore in the east of the chart, widening toward the west to 7 km offshore. Numerous small channels originate at the base of the shelf break scarp.",
    "keywords": "bathymetry, high-resolution-multibeam-bathymetry-survey, multibeam-echo-sounder-system, samoa, shaded-relief-map, slope-angle-map, three-dimentional-perspective-image, upolu",
    "name": "Samoa - South Upolu, 2004, Bathymetry Chart No 7 #1",
    "url": "https://pacificdata.org/data/dataset/samoa-south-upolu-2004-bathymetry-chart-no-7-1"
}