{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-bougainville-young-women-s-leadership-research",
    "@type": "Dataset",
    "description": "For this research, 12 young Bougainvillean women were trained in research methods. Six teams of two women then undertook research in six districts, covering the three regions of Bougainville (North, Central and South). The teams conducted 52 individual interviews and 49 group discussions. Field researchers participated in an initial analysis workshop and the lead researcher was mentored as a co-author of the research report. \n\nThe barriers to young women’s participation identified during the research include community and family attitudes, limits to young women’s confidence and education, patterns of interaction between older and younger women, and family and household responsibilities. \n\nThe research also highlights pathways to leadership for young women including opportunities within community organisations, and the motivations that encourage them to join groups such as Bougainville Women’s Federation (BWF). \n\nThe findings frame recommendations that focus on how BWF can engage and empower young women and create safe spaces for them to contribute to the organisation’s work and future. The report also provides guidance for other organisations that wish to understand the perspectives of young women and the issues they face in seeking to participate, develop their skills and leadership experience and contribute to their communities and the sustainability of local women’s organisations. The Bougainville Young Women’s Leadership Research Study is the first of its kind in Bougainville, exploring the opportunities for, and barriers to, young women’s leadership.",
    "keywords": "autonomous-region-of-bougainville, development-programming, leadership-and-decision-making, leadership-and-politics, pacific-women, research-report, social-norms",
    "name": "Bougainville Young Women’s Leadership Research",
    "url": "https://pacificdata.org/data/dataset/pwl-bougainville-young-women-s-leadership-research"
}