{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-women-s-representation-and-the-use-of-reserved-seats-in-bougainville",
    "@type": "Dataset",
    "description": "The Autonomous Region of Bougainville introduced the Pacific’s first parliamentary reserved seats for women system in 2004. While the system guarantees a minimum level of representation for women in the Bougainville House of Representatives, concerns have been raised that the reserved seats act as a ceiling for women’s representation and prevent women from successfully contesting other seats. No women candidates contested the 33 open seats in the 2005 election. In the 2010 election, five women contested open seats. All the women candidates contesting open seats lost in their constituencies.  \n\nThere is a misconception in Bougainville that women are restricted to contesting only the reserved seats. It is unclear how widespread this is, but women’s groups have actively worked to dispel the myth. \n\nWomen who were elected in the reserved seats tended to have adult children, although some had younger families. Educational backgrounds were varied, from grade eight to tertiary educated. They tended to have had careers in the public service, and significant involvement in church, community and women’s organisations. \n\nA significant factor in successful campaigns was access to resources, such as a candidate owning a personal computer to design and print campaign materials. \n\nA considerable challenge for both candidates and members of the House of Representatives is the size of the reserved seat electorates, which are significantly larger than the open electorates. To campaign effectively for a reserved seat requires time and significant financial resources. Once elected, regional members are entitled to the same amount of discretionary funds as all other members, despite their electorates being much larger. \n\nOne potential method of increasing consistency would be to hold a ‘mock parliament’ for women. Many women felt a mock legislative session would be beneficial in both building the confidence of possible women candidates, and increasing women’s knowledge of legislative processes.",
    "keywords": "autonomous-region-of-bougainville, leadership-and-decision-making, leadership-and-politics, pacific-women, short-paper, social-norms",
    "name": "Women’s Representation and the Use of Reserved Seats in Bougainville",
    "url": "https://pacificdata.org/data/dataset/pwl-women-s-representation-and-the-use-of-reserved-seats-in-bougainville"
}