{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/chapa-balcorta2015ainfluence-of-post-tehuano-oceanographic-processes-in-the-dynamics-of-the-co-",
    "@type": "Dataset",
    "description": "This investigation reports, for the first time, results of CO2 system variables in the Gulf of Tehuantepec, located in the Mexican tropical Pacific. We quantified the post-Tehuano concentration of dissolved inorganic carbon (DIC) and pH (April 2013). These values were used to calculate pCO2, aragonite saturation ($Ømega$Ar), and air-sea CO2 fluxes (FCO2). The intense vertical stratification was found to contribute to the biogeochemical processes in surface waters (\\textless70 m). However, in post-Tehuano conditions, high pCO2 (∼1000 µatm) and DIC concentrations (2200 µmol kg−1), as well as low $Ømega$Ar (∼1.1) and pH (∼7.5), remain in surface waters for a few days after Tehuano winds have weakened. We identified four oceanographic areas: (a) a highly mixed region due to previous Tehuano events; (b) coastal upwelling in the western region; (c) mesoscale eddies; (d) a poleward surface coastal current. The first three promoted the influence of Subtropical Subsurface Water in the chemistry of surface waters, whereas the coastal current contributed to the horizontal advection of DIC. The calculated CO2 fluxes ranged from −2.3 mmol m−2 d−1 in areas with stratified waters to over 25 mmol m−2 d−1 for mixed areas. Positive values indicate an ocean-to-atmosphere flux. Our findings suggest that the Gulf of Tehuantepec is a major source of CO2 into the atmosphere.",
    "keywords": "biogeochemistry, chemistry, field, north-pacific, ocean-acidification",
    "name": "Influence of post-Tehuano oceanographic processes in the dynamics of the CO system in the Gulf of Tehuantepec, Mexico",
    "url": "https://pacificdata.org/data/dataset/chapa-balcorta2015ainfluence-of-post-tehuano-oceanographic-processes-in-the-dynamics-of-the-co-"
}