{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-pacific-sisters-with-disabilities-at-the-intersection-of-discrimination",
    "@type": "Dataset",
    "description": "This report considers each of the key areas of discrimination and disadvantage. Key interrelationships between the various challenges are discussed to illustrate the complexity of the issues they face. \n\nThere are limited laws, policies and programs in the Pacific for women and girls with disabilities. \n\nThe report looks certain stakeholders have leadership roles. The evaluation of current policies, laws, and programs in the Pacific for women and girls with disabilities and the identification of further work required by the various stakeholders focus on a rights-based approach relevant to supporting women and girls with disabilities. \n\nComprehensive rights-based responses will be required to change attitudes and cultural practices where they result in discrimination, and to end the poverty, isolation, violence and abuse suffered by many women and girls with disabilities. While governments must take a leadership role, other stakeholders also have important roles to play. \n\nIn particular, urgent work is needed to: \n\n- Develop and implement laws, policies and programs that advance the rights of women and girls with disabilities. \n\n- Raise the educational attainment of girls with disabilities. \n\n- Increase access to comprehensive and quality health care for women and girls with disabilities. \n\n- Reduce of unemployment of women with disability. \n•Improve access to all buildings and transportation. \n\nThis can best be done with a series of measures that promote the mainstreaming of support and activities for women and girls with disabilities together with a series of targeted actions. Such work must be complemented with continuous awareness raising to change negative attitudes towards them.",
    "keywords": "development-programming, enhancing-agency, human-rights, pacific-women, research-report, social-norms",
    "name": "Pacific Sisters with Disabilities at the Intersection of Discrimination",
    "url": "https://pacificdata.org/data/dataset/pwl-pacific-sisters-with-disabilities-at-the-intersection-of-discrimination"
}