{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/wisshak2013effects-of-ocean-acidification-and-global-warming-on-reef-bioerosionlessons-from-a-c",
    "@type": "Dataset",
    "description": "Coral reefs are under threat, exerted by a number of interacting effects inherent to the present climate change, including ocean acidification and global warming. Bioerosion drives reef degradation by recycling carbonate skeletal material and is an important but understudied factor in this context. Twelve different combinations of pCO2 and temperature were applied to elucidate the consequences of ocean acidification and global warming on the physiological response and bioerosion rates of the zooxanthellate sponge Cliona orientalis—one of the most abundant and effective bioeroders on the Great Barrier Reef, Australia. Our results confirm a significant amplification of the sponges' bioerosion capacity with increasing pCO2, which is expressed by more carbonate being chemically dissolved by etching. The health of the sponges and their photosymbionts was not affected by changes in pCO2, in contrast to temperature, which had significant negative impacts at higher levels. However, we could not conclusively explain the relationship between temperature and bioerosion rates, which were slightly reduced at both colder as well as warmer temperatures than ambient. The present findings on the effects of ocean acidification on chemical bioerosion, however, will have significant implications for predicting future reef carbonate budgets, as sponges often contribute the lion's share of internal bioerosion on coral reefs.",
    "keywords": "101594pangaea831660, biological-response, corals, dissolution, laboratory, multiple-factors, oaiccdb, ocean-acidification, porifera, protists, south-pacific, temperature",
    "name": "Effects of ocean acidification and global warming on reef bioerosion—lessons from a clionaid sponge",
    "url": "https://pacificdata.org/data/dataset/wisshak2013effects-of-ocean-acidification-and-global-warming-on-reef-bioerosionlessons-from-a-c"
}