{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/guilloteau2016impacts-of-ocean-acidification-on-multiplication-and-caste-organisation-of-parasi",
    "@type": "Dataset",
    "description": "Ocean acidification is predicted to impact the structure and function of all marine ecosystems in this century. As focus turns towards possible impacts on interactions among marine organisms, its effects on the biology and transmission potential of marine parasites must be evaluated. In the present study, we investigate two marine trematode species (Philophthalmus sp. and Parorchis sp., both in the family Philophthalmidae) infecting two marine gastropods. These trematodes are unusual in that their asexually multiplying stages within snails display a division of labour, with two distinct castes, a large-bodied morph producing infective stages and a smaller morph playing a defensive role against other competing parasites. Using a potentiometric ocean acidification simulation system, we test the impacts of acidified seawater (7.8 and 7.6 pH) on the production of free-living infective stages (cercariae), the size and survival of encysted resting stages (metacercariae), and the within-host division of labour measured as the ratio between numbers of the two morphs. In general, low pH conditions caused an increase in cercarial production and a reduction in metacercarial survival. The ratio of the two castes within snail hosts tended to shift towards more of the smaller defensive morphs under low pH. However, the observed effects of reduced pH were species specific and not always unimodal. These results suggest that ocean acidification can affect the biology of marine parasites and may also impact transmission success and parasite abundance of some trematodes, with possible consequences for marine communities and ecosystems.  ",
    "keywords": "101594pangaea861876, biological-response, brcommunity, laboratory, morphology, mortality, oaiccdb, ocean-acidification, performance, platyhelminthes, reproduction, south-pacific",
    "name": "Impacts of ocean acidification on multiplication and caste organisation of parasitic trematodes in their gastropod host",
    "url": "https://pacificdata.org/data/dataset/guilloteau2016impacts-of-ocean-acidification-on-multiplication-and-caste-organisation-of-parasi"
}