{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-breaking-down-barriers-coming-of-age-becoming-the-change",
    "@type": "Dataset",
    "description": "Findings from this study include: \n\n- There is a knowledge gap amongst school-aged girls related to menstruation and reproductive health more generally. This lack of knowledge also extends to the school-aged boys and mothers. \n\n- Some teachers interviewed indicated that they were unaware that Menstrual Hygiene Management is part of the curriculum. \n\n- Traditional beliefs and practices related to menstruation are strong in Kiribati communities, in both the urban and rural settings. These traditional beliefs affect girls’ lives in a number of intersecting ways. \n\n- Cultural beliefs make speaking about menstruation amongst men and boys taboo. \n\n- Girls, teachers and their mothers commonly stated that absenteeism and decreased participation in class was common due to poor WASH facilities in schools, girls’ unpreparedness for their period due to inability to track their period, feeling uncomfortable because of stomach pain and the threat of bullying and teasing. \n\n- A combination of ‘buru’ (cloth made from old materials), kimbi (diaper) and moteti (sanitary pads) were reported as the main types of materials used by girls across all three islands. \n\n- Due to cultural taboos around menstrual blood, the disposal of sanitary materials in Kiribati is considered to be extremely important. \n\n- Safe sanitation facilities in schools are far below standard for menstruating girls. \n\n- Girls with disabilities face additional barriers when managing their menstruation. \n\nRecommendations include: \n\n- Assess and strengthen the menstruation, reproductive health and puberty sections of the school curriculum. \n\n- Develop teacher training on menstruation, Menstrual Hygiene Management and Sexual and Reproductive Health in collaboration with subject matter experts such as the Kiribati Family Health Association in line with UNESCOs ‘International technical guidance on sexuality education’. \n\n- Develop learning materials related to menstruation, puberty and reproductive health that will help support teachers in the classroom and promote comprehensive learning. \n\n- The Ministry of Education and stakeholders to monitor more closely and implement the national WASH in Schools Policy on continuous basis. \n\n- Develop a ‘Kiribati Girls Empowerment Programme’ that will contribute to girls’ empowerment and gender equality in Kiribati. \n\n- Advocate for community-wide MHM awareness raising that is inclusive of men, women, boys and girls across all age groups. \n\n- Integrate anti-bulling messaging related to menstruation into the ‘Respectful Relationships’ Curriculum as a culturally relevant example of gender stereotypes. \n\n- Consider the feasibility of providing free access to sanitary pads in school, preferably reusable sanitary pads.",
    "keywords": "Education, Health, Report, enhancing-agency, pacific-women, social-norms",
    "name": "Breaking Down Barriers: Coming of Age, Becoming the Change",
    "url": "https://pacificdata.org/data/dataset/pwl-breaking-down-barriers-coming-of-age-becoming-the-change"
}