{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/ye2018amapping-of-recent-brachiopod-microstructure-a-tool-for-environmental-studies",
    "@type": "Dataset",
    "description": "Shells of brachiopods are excellent archives for environmental reconstructions in the recent and distant past as their microstructure and geochemistry respond to climate and environmental forcings. We studied the morphology and size of the basic structural unit, the secondary layer fibre, of the shells of several extant brachiopod taxa to derive a model correlating microstructural patterns to environmental conditions. Twenty-one adult specimens of six recent brachiopod species adapted to different environmental conditions, from Antarctica, to New Zealand, to the Mediterranean Sea, were chosen for microstructural analysis using SEM, TEM and EBSD. We conclude that: 1) there is no significant difference in the shape and size of the fibres between ventral and dorsal valves, 2) there is an ontogenetic trend in the shape and size of the fibres, as they become larger, wider, and flatter with increasing age. This indicates that the fibrous layer produced in the later stages of growth, which is recommended by the literature to be the best material for geochemical analyses, has a different morphostructure and probably a lower organic content than that produced earlier in life. In two species of the same genus living in seawater with different temperature and carbonate saturation state, a relationship emerged between the microstructure and environmental conditions. Fibres of the polar Liothyrella uva tend to be smaller, rounder and less convex than those of the temperate Liothyrella neozelanica, suggesting a relationship between microstructural size, shell organic matter content, ambient seawater temperature and calcite saturation state.",
    "keywords": "biological-response, brachiopods, chemistry, field, mediterranean, morphology, ocean-acidification, south-pacific",
    "name": "Mapping of recent brachiopod microstructure: A tool for environmental studies",
    "url": "https://pacificdata.org/data/dataset/ye2018amapping-of-recent-brachiopod-microstructure-a-tool-for-environmental-studies"
}