{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-evaluation-of-the-rpngc-family-and-sexual-violence-units-for-png",
    "@type": "Dataset",
    "description": "Key findings from the evaluation include: \n\n- Family and Sexual Violence Units (FSVUs) are highly relevant for expanding services to survivors of family and sexual violence (FSV). \n\n- The effectiveness of FSVU services is constrained by internalised gender norms of male dominance and authority and women’s dependence and obedience. These internalised gender norms have a profound impact on the quality of services offered to FSVU survivors.  \n\n- FSVUs need to improve their timeliness of response to cases, as well as the information they provide to survivors about the FSVU roles, responsibilities and processes related to FSV cases, and the services that network partners provide to FSV survivors. \n\n- There are systematic weaknesses and failures in holding perpetrators accountable for FSV and rarely are there immediate arrests or removal. \n\n- Despite progress, much needs to be done for FSVUs to achieve efficiency in the delivering of FSVU services. \n\n- Female staffing within FSVUs has helped to increase the number of FSV cases reported. \n\n- All FSVU officers have received training; however, the levels of skills vary and there is no systematised training plan for FSVU staff and for RPNGC staff more broadly on the Constabulary’s response to FSV. \n\n- Few FSVU cases are investigated because: \n- FSVU staff are overloaded with the number of cases received. \n- Most FSVU cases are not indictable and have limited chances of making it to the prosecution stage. \n- The survivor withdraws the case or accepts compensation. \n- Police disinterest and/or lack of FSVU resources cause the matter to falter prior to the prosecution stage. \n\n- Those cases investigated are due to the strong determination of a survivor to get the offender arrested and prosecuted. Compensation and mediation are embedded in the FSVU processes. \n\n- The 8 am to 5 pm Monday to Friday opening hours are inadequate as they can require the survivor to return to police station several times, delaying the provision of urgent protection services. \n\n- There is an FSV referral system in place, of which FSVUs are an integral part. \n\n- The RPNGC has demonstrated ownership towards a response to FSV by introducing FSVUs across 15 police stations. \n\n- More needs to be done for FSVUs to have an impact in offering improved safety, stability and crime prevention to FSV survivors. \n\n- Much needs to be done in order to improve the quality of services offered by FSVUs. \n\nThe report includes recommendations in relation to structure; staffing; training; facilities and equipment; operations, systems and processes; reporting; and awareness of the fight against FSV.",
    "keywords": "Report, ending-violence-against-women, pacific-women, social-norms, violence",
    "name": "Evaluation of the RPNGC Family and Sexual Violence Units for PNG",
    "url": "https://pacificdata.org/data/dataset/pwl-evaluation-of-the-rpngc-family-and-sexual-violence-units-for-png"
}