{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/american-samoa-exclusive-economic-zone-200-nautical-mile",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((186.2253093499468 -17.555268752861593, 186.2253093499468 -10.024476331617223, 194.79916666680836 -10.024476331617223, 194.79916666680836 -17.555268752861593, 186.2253093499468 -17.555268752861593))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "The Proclamation 5030 by the President of the United States of America (10 March 1983) states that the exclusive economic zone of the United States is a zone contiguous to the territorial sea, including zones contiguous to the territorial sea of the United States, the Commonwealth of Puerto Rico, the Commonwealth of the Northern Mariana Islands (to the extent consistent with the Covenant and the United Nations Trusteeship Agreement), and United States overseas Territories and possessions. The exclusive economic zone extends to a distance 200 nautical miles from the baseline from which the breadth of the territorial sea is measured. In cases where the maritime boundary with a neighbouring State remains to be determined, the boundary of the exclusive economic zone shall be determined by the United States and other State concerned in accordance with equitable principles.\r\n\r\nWithin the exclusive economic zone, the United States has, to the extent permitted by international law, (a) sovereign rights for the purpose of exploring, exploiting, conserving and managing natural resources, both living and non-living, of the sea-bed and subsoil and the superjacent waters and with regard to other activities for the economic exploitation and exploration of the zone, such as the production of energy from the water, currents and winds; and (b) jurisdiction with regard to the establishment and use of artificial islands, and installations and structures having economic purposes, and the protection and preservation of the marine environment.\r\n\r\nhttps://www.un.org/depts/los/LEGISLATIONANDTREATIES/PDFFILES/USA_1983_Proclamation.pdf\r\n",
    "keywords": "200NM",
    "name": "American Samoa Exclusive Economic Zone (200 Nautical Mile)",
    "url": "https://pacificdata.org/data/dataset/american-samoa-exclusive-economic-zone-200-nautical-mile"
}