{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-rural-pacific-island-women-and-agriculture-data-evidence-and-knowledge-in-pacific-islands-countr",
    "@type": "Dataset",
    "description": "This literature review synthesises material from the books, academic articles, and reports listed in the attached annotated bibliography on Pacific Island women and agriculture. Information has been grouped into the following topics: \n\n- Pacific Island women and agriculture. \n\n- Agriculture in Pacific Island social contexts. \n\n- Challenges faced by women in Pacific Island agriculture. \n\n- Pacific Island women in agriculture: Some recommendations. \n\nThe literature review contains some general comments about agriculture across the Pacific, followed by specific information for each Pacific Island country, where available. The amount of information available on each Pacific Island country varies. The most comprehensive information comes from countries with larger population sizes and associated greater likelihood of study by academic researchers and development agencies. Papua New Guinea, Fiji, and Solomon Islands are thus overrepresented in studies of women in agriculture. Little information is available on Micronesia, and islands in this area would be productive sites for future research on women and agriculture. \n\nThe annotated bibliography provides concise summaries of the books, academic articles, and reports referred to in the literature review.",
    "keywords": "Report, climate-change-and-environment, enhancing-agency, land-sea-and-livelihoods, pacific-women, social-norms",
    "name": "Rural Pacific Island Women and Agriculture: Data, Evidence and Knowledge in Pacific Islands Countries",
    "url": "https://pacificdata.org/data/dataset/pwl-rural-pacific-island-women-and-agriculture-data-evidence-and-knowledge-in-pacific-islands-countr"
}