{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/lai2017responses-of-neurogenesis-and-neuroplasticity-related-genes-to-elevated-co2-levels-in-th",
    "@type": "Dataset",
    "description": "The continuous increase of anthropogenic CO2 in the atmosphere resulting in ocean acidification has been reported to affect brain function in some fishes. During adulthood, cell proliferation is fundamental for fish brain growth and for it to adapt in response to external stimuli, such as environmental changes. Here we report the first expression study of genes regulating neurogenesis and neuroplasticity in brains of three-spined stickleback (Gasterosteus aculeatus), cinnamon anemonefish (Amphiprion melanopus) and spiny damselfish (Acanthochromis polyacanthus) exposed to elevated CO2 The mRNA expression levels of the neurogenic differentiation factor (NeuroD) and doublecortin (DCX) were upregulated in three-spined stickleback exposed to high-CO2 compared with controls, while no changes were detected in the other species. The mRNA expression levels of the proliferating cell nuclear antigen (PCNA) and the brain-derived neurotrophic factor (BDNF) remained unaffected in the high-CO2 exposed groups compared to the control in all three species. These results indicate a species-specific regulation of genes involved in neurogenesis in response to elevated ambient CO2 levels. The higher expression of NeuroD and DCX mRNA transcripts in the brain of high-CO2-exposed three-spined stickleback, together with the lack of effects on mRNA levels in cinnamon anemonefish and spiny damselfish, indicate differences in coping mechanisms among fish in response to the predicted-future CO2 level.",
    "keywords": "biological-response, fish, laboratory, molecular-biology, north-atlantic, ocean-acidification, physiology, south-pacific",
    "name": "Responses of neurogenesis and neuroplasticity related genes to elevated CO2 levels in the brain of three teleost species",
    "url": "https://pacificdata.org/data/dataset/lai2017responses-of-neurogenesis-and-neuroplasticity-related-genes-to-elevated-co2-levels-in-th"
}