{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-review-of-spa-academy-rural-scholarship-program-report",
    "@type": "Dataset",
    "description": "The review finds that there are very strong outcomes for Spa Academy scholarship graduates and their families. \n\nGraduates feel more confident and valuable. Graduates have increased decision-making power in their families and communities and are considered more of a leader since graduating particularly at work as well as in their families and communities. Graduates have become more empowered and independent. \n\nGraduates have improved their material conditions. They are able to find employment based on their increased skills and knowledge and their nationally or internationally recognised qualification. Almost all graduates now have a career in the tourism industry. They have increased their income and many graduates have increased their assets (an increase in a graduate’s assets is usually correlated with a longer time since graduation). Graduates are using their increased income to improve their own situations as well as the situations of their families. Almost all graduates have their own bank accounts and control over these accounts. \n\nChanges in the lives of the graduates is having a largely positive effect on their families and there is some evidence of effects in their communities. Most family members have changed what they think men and women can do through witnessing the process of the scholarship recipients complete their study and begin working. This change in thinking has not fully translated into practice, however. For example, most women are working more since graduating. They now have paid employment and are still undertaking most of the care work in the house. In some households, women and men have renegotiated this workload. This is an example of joint decision making that is occurring in most households. \n\nWithin the community, women are serving as role models and have contributed to an improved view of women. This change of community attitude is not complete, however, with women still facing discriminative attitudes in general and negative attitudes about working in the spa industry specifically. \n\nThe scholarships have contributed to two formal changes to systems: the beginning of a collective association, through the Fiji Section of the international beauty association International Committee of Aesthetics and Cosmetology (CIDESCO), which will advocate for consistent pay rates across the sector; and the implementation of sexual harassment policy in spas and hotels across Fiji.",
    "keywords": "Education, Report, development-programming, economic-empowerment, land-sea-and-livelihoods, pacific-women, social-norms",
    "name": "Review of Spa Academy Rural Scholarship Program Report",
    "url": "https://pacificdata.org/data/dataset/pwl-review-of-spa-academy-rural-scholarship-program-report"
}