{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-a-deeper-silence-the-unheard-experiences-of-women-with-disabilities-sexual-and-reproductive-heal",
    "@type": "Dataset",
    "description": "Similarities across the situation analyses in Kiribati, Solomon Islands and Tonga include:\n\n- Women with disabilities make significant contributions to their communities. However, while they have similar talents, skills and experience as other women, they may be more often underrecognised and have fewer opportunities. \n\n- Each country has a committed and active disabled persons organisation and a family health association that are in a good position to increase their focus on disability and sexuality. \n\n- The report lists programs and activities that have dealt with the intersection of disabilities and sexual reproductive health and rights (SRHR). \n\n- The three countries have policies relating to people with disabilities, health and ending violence against women to which SRHR issues could be incorporated into implementation. \n\n- The Incheon Declaration to “Make the Right Real for Persons with Disabilities in Asia and the Pacific 2013 to 2022” specifically discusses SRH issues. \n\n- Family is central to the lives of women with a disabilities, providing the vast majority of support and assistance. Where families were less supportive or caring, women experienced significant hardship. Families require training, support and assistance. \n\n- Generally, community attitudes conform with stereotypical and prejudiced perspectives on people with disabilities. Women with disabilities tend to feel that their closest community accepted them but often felt that the wider community ridiculed them, leading to feelings of shame and fear. \n\n- Women with disabilities experience a range of intimate relationships throughout their lives. Many are married and had children. Most enjoy consensual sexual relations. \n\n- Women with disabilities do not have a good understanding of their full SRHR and need more education and easy access to services. \n\n- Women with disabilities tended to interact with health services most regularly when they are pregnant. There is a need for more engagement with health services. \n\n- Health professionals and other social service staff require capacity building to enhance their skills and confidence in working with women with disabilities. \n\n- Appropriate and accessible information, education and communication resources are required to meet the information needs of women with vision, hearing and/or intellectual impairments. \n\n- Some women with disabilities experience violence. There are indications that women with disabilities may experience sexual violence perpetrated by acquaintances or strangers at a higher rate than other women. \n\n- Several women interviewed became pregnant as a result of rape. \n\n- Women with disabilities living in institutions have particular needs that do not appear to be adequately addressed. These women are at risk of abuse. \n\n- Women with a mental illness or intellectual disability sometimes experience particularly severe discriminations, including multiple rapes, involuntary sterilisation and the imposition of contraceptive use despite their inability to give informed consent.",
    "keywords": "Health, development-programming, ending-violence-against-women, human-rights, pacific-women, research-report, social-norms",
    "name": "A Deeper Silence: The Unheard Experiences of Women with Disabilities – Sexual and Reproductive Health and Violence against Women in Kiribati, Solomon Islands and Tonga",
    "url": "https://pacificdata.org/data/dataset/pwl-a-deeper-silence-the-unheard-experiences-of-women-with-disabilities-sexual-and-reproductive-heal"
}