{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-eves-do-no-harm-report-png-2018",
    "@type": "Dataset",
    "description": "This research, exploring connections between women’s economic empowerment initiatives and increased violence against women in two provinces of Papua New Guinea and the Autonomous Region of Bougainville, found that the economic advancement that many women are achieving rarely translates into actual empowerment, because they are rarely able to negotiate a decrease in domestic workloads when they bring income — often the only income — into the household. These women endure extremely heavy work burdens for, besides working to earn income, most continue to bear the responsibility for the agricultural labour that ensures sufficient food for the family to eat and for the unpaid house and care work (such as carrying water and firewood to the house, cooking, cleaning and childcare). \n\nThe extent to which women are involved in household decision-making varies. The belief that the husband should be the head of the household is commonly held in Chimbu and Jiwaka, indicating the extent to which gender norms with negative outcomes for women are accepted by women themselves. Several women told of domineering husbands who made most decisions and told their wives what to do, in detail. Cases of husbands and wives discussing decisions together were rare, with few women citing this as a valued aspect of their marriage.  In Bougainville, joint decision-making is a feature of some marriages and women value sitting down with their husbands to discuss things, as well as helping\neach other and working together. For some women, joint decision-making was a sign of a good marriage and of an ideal husband. Some of the male respondents interviewed during the research also considered joint decision-making an attribute of an ideal husband and said they practised this themselves. Although the claim of joint decision-making may give the impression of a cooperative household where the woman has a degree of respect and power, both male and female respondents confirmed that this sometimes\nbelies the fact that the wife actually has little power and is merely a rubber stamp for the man’s decisions. In some cases, joint decision-making does not extend to important decisions, especially when it comes to significant resources. \n\nThe most violence reported during the research was connected to men’s alcohol consumption. The numerous reports of violence we heard confirm that when women bring economic resources into the household, they do not inevitably become more empowered or suffer less violence. \n\nAn important implication of the research is that women’s economic empowerment programs should avoid minimalist initiatives — that is, they should not aim simply to give women access to economic opportunities without any consideration of gender and gender relations, especially the role of gender norms in marital relationships. Changes in marriage practices are having a negative impact on women in Jiwaka and Chimbu. The exchange of bride price is today widely understood to be a simple property transaction, in which the wife becomes the property of the husband, her purchaser. Husbands therefore consider themselves fully justified in treating their wives domineeringly and violently. The exchange of bride price also has the effect of increasing women’s work burden, since the bride price creates debts that must be repaid. Though such debts are meant to be borne by both partners, the responsibility for repaying them often falls solely on the wife. \n\nMen often feel excluded from initiatives that seek to improve women’s access to economic resources and this can result in backlash, which is one reason why women’s economic empowerment programs need to embrace ways of working with men. However, a greater need exists beyond fear of backlash. The failure to recognise that women are not a separate category from men but are intimately bound in relations with them in the household weakens the empowerment potential of women’s economic empowerment programming. But, above all, women should not be considered a separate category from men in the community either. Concentrating on men and women separately fails to address the need for community cohesiveness — that is, it fails to grasp the opportunity to build a strong, constructive and cooperative community. That women’s economic empowerment programming needs to be integrated more fully with community-based approaches that have a focus on violence against women is recognised internationally. \n\nKey lessons to inform economic empowerment initiatives are: \n\n- Working with men is neccessary. \n\n- There is a need for community-based gender transformative programs. \n\n- Women’s economic empowerment programming needs to adopt a do no harm approach.",
    "keywords": "autonomous-region-of-bougainville, development-programming, economic-empowerment, ending-violence-against-women, land-sea-and-livelihoods, pacific-women, research-report, social-norms, violence",
    "name": "Eves-Do-No-Harm-Report-PNG-2018",
    "url": "https://pacificdata.org/data/dataset/pwl-eves-do-no-harm-report-png-2018"
}