{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-the-women-s-economic-opportunity-index-weoi-and-the-pacific-a-summary",
    "@type": "Dataset",
    "description": "Highlights of this Pacific summary of the 2012 Women’s Economic Empowerment Index include:\n\n- Fiji is the highest ranked Pacific country (81 out of 128 ranked countries). \n\n- Solomon Islands (125/128) and Papua New Guinea (126/128) are in the bottom  five, ranked lower than all Sub-Saharan African countries except Sudan.\n\n- One of the key findings is that while the six Pacific countries are categorised as Low Middle Income, when it comes to women’s economic opportunity they track similarly to Low Income Countries (with the exception of Fiji, which nevertheless performs below the global average in every category and on most indicators.) \n\n- Pacific countries perform well on some indicators, primarily Citizenship Rights which includes freedom of social participation and movement, and education; PNG, however, ranks second worst in the world on education with the average woman able to expect only 5.2 years of formal education. \n\n-  Of relevance to development programs and policies are the indicators where the Pacific scores particularly badly: \n- Property ownership / equal legal ownership rights: customary law doesn’t take precedence over statutory law (Pacific Island countries are the lowest group of countries in the world). \n- Equal pay, non-discrimination and legal protection in the workplace: enforcing of an equal pay policy.  \n- Access to finance: includes outreach programmes, financial services and financial literacy. \n- Political participation: Share of women in ministerial positions, parliament and public office. \n- Levels of violence against women: laws that protect women from domestic violence, rape, physical attacks and sexual harassment (these are not indicators of the incidence of violence against women). \n- Tertiary education: total number of years a woman could expect in tertiary education. \n- Maternity and paternity entitlements: leave and provision. \n- Infrastructure risk: risk that deficiencies will cause loss of income and business (Samoa and Fiji are exceptions).",
    "keywords": "Report, data-education, economic-empowerment, land-sea-and-livelihoods, pacific-women, social-norms",
    "name": "The Women’s Economic Opportunity Index (WEOI) and the Pacific: A Summary",
    "url": "https://pacificdata.org/data/dataset/pwl-the-women-s-economic-opportunity-index-weoi-and-the-pacific-a-summary"
}