{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-helpdesk-research-report-women-s-economic-empowerment-in-the-pacific",
    "@type": "Dataset",
    "description": "This review looks at major trends in spending (comparing women and men), the chief barriers to women having more income and control of their finances, and the key opportunities for programs to address economic empowerment of women at household and community levels. \n\nMuch of the available evidence on women’s economic situation in the Pacific comes from household income and expenditure surveys, which do not usually disaggregate on the grounds of gender. While there are some data about women’s income, most analysis of expenditure is conducted at the household level and it is therefore difficult to examine trends in women and men’s spending.  \n\nCompared with other parts of the world, women in the Pacific region experience limited economic empowerment. In most Pacific countries, women tend to be under-represented in the formal workforce, spend more time doing household work, and are paid less than men.  Female-headed households are twice as likely to be in poverty than male-headed households.  \n\nKey barriers to women’s economic empowerment include poor educational attainment, patriarchal norms, customary law and a lack of land/property rights, a lack of access to finance, a lack of skills and knowledge, and poor infrastructure. \n\n Few studies have examined which economic empowerment strategies offer the best opportunities for success in Pacific countries. Two studies advocate supporting female financial literacy training as a means to improving the efficacy of female-targeted microfinance strategies. The broader literature on women’s economic empowerment emphasises the importance of tackling multiple constraints when designing women’s economic empowerment programs.",
    "keywords": "data, development-programming, economic-empowerment, land-sea-and-livelihoods, literature-review, pacific-women, social-norms",
    "name": "Helpdesk Research Report: Women’s Economic Empowerment in the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-helpdesk-research-report-women-s-economic-empowerment-in-the-pacific"
}