{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-pacific-women-thematic-brief-impacts-of-the-covid-19-pandemic-on-adolescent-girls-in-the-pacific",
    "@type": "Dataset",
    "description": "This Thematic Brief discusses five key messages about the emerging impacts of COVID-19 on adolescent girsl in the Pacific:\n\nDisrupted education: School closures have disrupted girl’s learning and they are less able than boys to access online learning options. Girls are experiencing increased pressure to undertake domestic labour and care responsibilities for their families.\nIncreased anxiety and loneliness: Particular impacts related to adolescent girl’s age and developmental stage include: a loss of peer support, leading to depression and anxiety; an increased propensity to boredom and risk-taking behaviours; and for those with online access, an increased exposure to predators, online harassment, exploitation and bullying.\nFeeling isolated and unsafe at home and online: Prolonged school closures and economic recession due to the COVID-19 pandemic have the potential to significantly increase the risk of gender-based violence, early and forced marriage, sexual exploitation and child labour.\nIncreased care burden at home: The COVID-19 pandemic has increased the burden of care on women and girls. Caring for siblings and children in the community, especially during school closures, and additional household work often falls to adolescent girls. This is because they are traditionally expected to assist their mothers and female relatives undertake the vast majority of unpaid domestic labour and childcare.\nDisrupted access to menstrual hygiene and sexual health services: Restricted movement decreases access to sexual and reproductive health information and services, while increasingly crowded living conditions impinges on girl’s access to water, sanitation and hygiene (WASH) and menstrual hygiene management.",
    "keywords": "Health, development-programming, economic-empowerment, ending-violence-against-women, enhancing-agency, land-sea-and-livelihoods, leadership-and-decision-making, pacific-women, social-norms, violence",
    "name": "Pacific Women Thematic Brief: Impacts of the COVID-19 pandemic on adolescent girls in the Pacific",
    "url": "https://pacificdata.org/data/dataset/pwl-pacific-women-thematic-brief-impacts-of-the-covid-19-pandemic-on-adolescent-girls-in-the-pacific"
}