{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-candidates-training-transformative-leadership-and-campaign-training-for-potential-women-candidat",
    "@type": "Dataset",
    "description": "The candidates’ training was held from 2-6 December 2013. Fifteen participants from 8 provinces in the Solomon Islands attended the training. This included twelve potential women candidates from 8 provinces (including Honiara) and three men who expressed interest in contesting the 2014 National Elections were identified by the Solomon Islands National Council of Women to participate in the training. The goal of the candidate training workshop was to strengthen women candidates for 2014 elections by utilising the transformational leadership approach combined with other strategies for effective election campaigning. Through the program, the participants: • Gained an understanding of three types of leadership – Transactional, Transformative, and Servant-hood leadership. • Identified areas that need change and gaps in their leadership and set goals to make the change happen. • Acquired skills in how to prepare themselves and plan their election strategies and plans. • Realised the importance of preparation for the election. • Signed an MOU and created a network with the Electoral Commission. • Gained knowledge, wisdom and empowerment through sharing and discussions. • Had hands on experience in developing a campaign plan and message. • Gained experience in public speaking.",
    "keywords": "Education, Report, leadership-and-decision-making, leadership-and-politics, pacific-women, social-norms",
    "name": "Candidates Training: ‘Transformative Leadership and Campaign Training for potential women candidates’",
    "url": "https://pacificdata.org/data/dataset/pwl-candidates-training-transformative-leadership-and-campaign-training-for-potential-women-candidat"
}