{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/teck2010using-expert-judgment-to-estimate-marine-ecosystem-vulnerability-in-the-california-curr",
    "@type": "Dataset",
    "description": "As resource management and conservation efforts move toward multi-sector, ecosystem-based approaches, we need methods for comparing the varying responses of ecosystems to the impacts of human activities in order to prioritize management efforts, allocate limited resources, and understand cumulative effects. Given the number and variety of human activities affecting ecosystems, relatively few empirical studies are adequately comprehensive to inform these decisions. Consequently, management often turns to expert judgment for information. Drawing on methods from decision science, we offer a method for eliciting expert judgment to (1) quantitatively estimate the relative vulnerability of ecosystems to stressors, (2) help prioritize the management of stressors across multiple ecosystems, (3) evaluate how experts give weight to different criteria to characterize vulnerability of ecosystems to anthropogenic stressors, and (4) identify key knowledge gaps. We applied this method to the California Current region in order to evaluate the relative vulnerability of 19 marine ecosystems to 53 stressors associated with human activities, based on surveys from 107 experts. When judging the relative vulnerability of ecosystems to stressors, we found that experts primarily considered two criteria: the ecosystem's resistance to the stressor and the number of species or trophic levels affected. Four intertidal ecosystems (mudflat, beach, salt marsh, and rocky intertidal) were judged most vulnerable to the suite of human activities evaluated here. The highest vulnerability rankings for coastal ecosystems were invasive species, ocean acidification, sea temperature change, sea level rise, and habitat alteration from coastal engineering, while offshore ecosystems were assessed to be most vulnerable to ocean acidification, demersal destructive fishing, and shipwrecks. These results provide a quantitative, transparent, and repeatable assessment of relative vulnerability across ecosystems to any ongoing or emerging human activity. Combining these results with data on the spatial distribution and intensity of human activities provides a systematic foundation for ecosystem-based management.  ",
    "keywords": "north-pacific, ocean-acidification, policy, review",
    "name": "Using expert judgment to estimate marine ecosystem vulnerability in the California Current",
    "url": "https://pacificdata.org/data/dataset/teck2010using-expert-judgment-to-estimate-marine-ecosystem-vulnerability-in-the-california-curr"
}