{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-do-no-harm-research-report-solomon-islands",
    "@type": "Dataset",
    "description": "This research, exploring connections between women’s economic empowerment initiatives and increased violence against women in Solomon Islands, found that any equation between women’s economic empowerment and domestic violence is not always straightforward. \n\nThe men and women interviewed identified a number of causes of marital conflict and violence, including sexual jealousy, disagreement over the disciplining of children, disagreement over spending priorities, men’s alcohol consumption, men’s failure to work, men coercing women to work harder and failure of wives to fulfil husbands’ expectations. The most violence reported during the research was connected to men’s alcohol consumption, which drains resources from the household, and so is questioned by women. \n\nWhile many of the women interviewed during the study were economically empowered to the extent that they had increased access to and control over economic resources through income generating activities or wage labour, this did not always translate into increased control over other areas of their lives. \n\nPowerful norms play an influential role in determining whether women’s greater earning capacity translates into more power for women in the household. The research found that women’s greater financial resources often enable men to lessen their own contributions to the household, or in some cases to contribute nothing at all. This allows men to use their money for their own personal consumption resource depleting behaviour that is often central to marital conflict. In such circumstances, when men contribute little either financially or by helping in the home, women’s increased income means a large increase in their work burden, now that income earning is added to their other customary duties. \n\nAlthough gender norms prescribe that women are largely responsible for unpaid household labour and childcare, various changes have brought some loosening of these norms. The broader social changes effected by Western education, Christianisation and colonisation, for example, have been influential in this, but some recent changes to gender norms have resulted from initiatives such as savings groups which have stimulated conversations about gender roles in communities. \n\nThe research found, in communities where gender awareness training and forums for discussions of gender roles had been introduced alongside economic empowerment programming, there were instances of increased cooperation between men and women in households, which in some cases see men doing forms of labour usually associated with women. But the research also revealed that some of the changes occurring in gender roles are due to men’s opting out of contributing to the household, so that some women, out of necessity, are doing forms of labour traditionally associated with men. \n\nThe research also examined the way financial decisions are made within households, finding that considerable variation exists in financial management and decision-making in Solomon Islands households. Income pooling and cooperative decision-making is common, although even within households that identified as having cooperative models of decision-making, the male head of the household sometimes ultimately controlled decisions. However, many respondents perceived that women were better financial managers, and so it was also common for women to manage pooled income. \n\nEnsuring that women’s access to and control over economic resources leads to increased control over other areas of their lives is critical for women’s economic empowerment. Key lessons to inform economic empowerment initiatives are: \n\n- Women’s savings groups are a potential pathway for women’s economic empowerment. \n\n- Working with men to challenge gender inequitable behaviour and norms is an imperative. \n\n- There is a need for community-based gender transformative programs. \n\n- Women’s economic empowerment programming should adopt a do no harm approach.",
    "keywords": "development-programming, economic-empowerment, ending-violence-against-women, land-sea-and-livelihoods, pacific-women, research-report, social-norms, violence",
    "name": "Do No Harm Research Report: Solomon Islands",
    "url": "https://pacificdata.org/data/dataset/pwl-do-no-harm-research-report-solomon-islands"
}