{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/koweek2018expected-limits-on-the-ocean-acidification-buffering-potential-of-a-temperate-seagras",
    "@type": "Dataset",
    "description": "Ocean acidification threatens many marine organisms, especially marine calcifiers. The only global‐scale solution to ocean acidification remains rapid reduction in CO2 emissions. Nevertheless, interest in localized mitigation strategies has grown rapidly because of the recognized threat ocean acidification imposes on natural communities, including ones important to humans. Protection of seagrass meadows has been considered as a possible approach for localized mitigation of ocean acidification due to their large standing stocks of organic carbon and high productivity. Yet much work remains to constrain the magnitudes and timescales of potential buffering effects from seagrasses. We developed a biogeochemical box model to better understand the potential for a temperate seagrass meadow to locally mitigate the effects of ocean acidification. Then we parameterized the model using data from Tomales Bay, an inlet on the coast of California, USA which supports a major oyster farming industry. We conducted a series of month‐long model simulations to characterize processes that occur during summer and winter. We found that average pH in the seagrass meadows was typically within 0.04 units of the pH of the primary source waters into the meadow, although we did find occasional periods (hours) when seagrass metabolism may modify the pH by up to ±0.2 units. Tidal phasing relative to the diel cycle modulates localized pH buffering within the seagrass meadow such that maximum buffering occurs during periods of the year with midday low tides. Our model results suggest that seagrass metabolism in Tomales Bay would not provide long‐term ocean acidification mitigation. However, we emphasize that our model results may not hold in meadows where assumptions about depth‐averaged net production and seawater residence time within the seagrass meadow differ from our model assumptions. Our modeling approach provides a framework that is easily adaptable to other seagrass meadows in order to evaluate the extent of their individual buffering capacities. Regardless of their ability to buffer ocean acidification, seagrass meadows maintain many critically important ecosystem goods and services that will be increasingly important as humans increasingly affect coastal ecosystems.",
    "keywords": "biogeochemistry, chemistry, mitigation, modeling, north-pacific, ocean-acidification, phanerogams, regionalmodeling",
    "name": "Expected limits on the ocean acidification buffering potential of a temperate seagrass meadow",
    "url": "https://pacificdata.org/data/dataset/koweek2018expected-limits-on-the-ocean-acidification-buffering-potential-of-a-temperate-seagras"
}