{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/chen2018carbon-and-nitrogen-accumulation-in-the-economic-seaweed-gracilaria-lemaneiformis-affec",
    "@type": "Dataset",
    "description": "During mariculture period, maricultured macroalga Gracilaria lemaneiformis experienced seasonal temperature changes. In this study, we examine the effects of predicted ocean acidification on carbon and nitrogen accumulation and amino acids (AA) contents in G. lemaneiformis under different temperature levels. The results showed that G. lemaneiformis exhibited higher growth rates under high temperature conditions than under low temperature conditions, regardless of CO2 levels. Moreover, compared with low temperature, the culture conditions of high temperature enhanced N accumulation in G. lemaneiformis, resulting in increased N and AA contents and lowered C/N ratios. While low temperature had no significant effects on the C and N acquisition, it would alter the N conversion and assimilation in this alga. It appeared that the effects resulted from ocean acidification on carbon and N accumulation were more pronounced at high temperature than at low temperature. Additionally, the enhancement percentages of growth, as well as the decrease extent of C/N ratios, resulted from acidified seawater conditions of culture, were more pronounced at high temperature than at low temperature. We suggested that ocean acidification owing to atmospheric CO2 rising would be more effective on G. lemaneiformis growth and nutritional constituent accumulation during the middle and later periods of mariculture concurring with increased seasonal temperature.",
    "keywords": "algae, biological-response, laboratory, morphology, multiple-factors, north-pacific, ocean-acidification, physiology, temperature",
    "name": "Carbon and nitrogen accumulation in the economic seaweed Gracilaria lemaneiformis affected by ocean acidification and increasing temperature",
    "url": "https://pacificdata.org/data/dataset/chen2018carbon-and-nitrogen-accumulation-in-the-economic-seaweed-gracilaria-lemaneiformis-affec"
}