{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/leal2017cocean-acidification-and-kelp-development-reduced-ph-has-no-negative-effects-on-meiospo",
    "@type": "Dataset",
    "description": "The absorption of anthropogenic CO2 by the oceans is causing a reduction in the pH of the surface waters termed ocean acidification (OA). This could have substantial effects on marine coastal environments where fleshy (non-calcareous) macroalgae are dominant primary producers and ecosystem engineers. Few OA studies have focused on the early life stages of large macroalgae such as kelps. This study evaluated the effects of seawater pH on the ontogenic development of meiospores of the native kelp Macrocystis pyrifera and the invasive kelp Undaria pinnatifida, in south-eastern New Zealand. Meiospores of both kelps were released into four seawater pH treatments (pHT 7.20, extreme OA predicted for 2300; pHT 7.65, OA predicted for 2100; pHT 8.01, ambient pH; and pHT 8.40, pre-industrial pH) and cultured for 15 d. Meiospore germination, germling growth rate, and gametophyte size and sex ratio were monitored and measured. Exposure to reduced pHT (7.20 and 7.65) had positive effects on germling growth rate and gametophyte size in both M. pyrifera and U. pinnatifida, whereas, higher pHT (8.01 and 8.40) reduced the gametophyte size in both kelps. Sex ratio of gametophytes of both kelps was biased towards females under all pHT treatments, except for U. pinnatifida at pHT 7.65. Germling growth rate under OA was significantly higher in M. pyrifera compared to U. pinnatifida but gametophyte development was equal for both kelps under all seawater pHT treatments, indicating that the microscopic stages of the native M. pyrifera and the invasive U. pinnatifida will respond similarly to OA. This article is protected by copyright. All rights reserved.",
    "keywords": "algae, biological-response, growth, laboratory, morphology, oaiccnoanswer, ocean-acidification, reproduction, south-pacific",
    "name": "Ocean acidification and kelp development: Reduced pH has no negative effects on meiospore germination and gametophyte development of Macrocystis pyrifera and Undaria pinnatifida",
    "url": "https://pacificdata.org/data/dataset/leal2017cocean-acidification-and-kelp-development-reduced-ph-has-no-negative-effects-on-meiospo"
}