{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/jameselevated-pco2-alters-marine-heterotrophic-bacterial-community-composition-and-metabolic-po",
    "@type": "Dataset",
    "description": "Factors that affect the respiration of organic carbon by marine bacteria can alter the extent to which the oceans act as a sink of atmospheric carbon dioxide. We designed seawater dilution experiments to assess the effect of pCO2 enrichment on heterotrophic bacterial community composition and metabolic potential in response to a pulse of phytoplankton‐derived organic carbon. Experiments included treatments of elevated (1000 ppm) and low (250 ppm) pCO2, amended with 10 $μ$mol L‐1 dissolved organic carbon from Emiliana huxleyi lysates, and were conducted using surface‐seawater collected from the South Pacific Subtropical Gyre. To assess differences in community composition and metabolic potential, shotgun metagenomic libraries were sequenced from low and elevated pCO2 treatments collected at the start of the experiment and following exponential growth. Our results indicate bacterial communities changed markedly in response to the organic matter pulse over time and was significantly affected by pCO2 enrichment. Elevated pCO2 also had disproportionate effects on the abundance of sequences related to proton pumps, carbohydrate metabolism, modifications of the phospholipid bilayer, resistance to toxic compounds and conjugative transfer. These results contribute to a growing understanding of the effects of elevated pCO2 on bacteria‐mediated carbon cycling during phytoplankton bloom conditions in the marine environment.",
    "keywords": "abundance, biological-response, community-composition, laboratory, molecular-biology, ocean-acidification, otherprocess, prokaryotes, south-pacific",
    "name": "Elevated pCO2 alters marine heterotrophic bacterial community composition and metabolic potential in response to a pulse of phytoplankton organic matter",
    "url": "https://pacificdata.org/data/dataset/jameselevated-pco2-alters-marine-heterotrophic-bacterial-community-composition-and-metabolic-po"
}