{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/pwl-women-s-economic-empowerment-practice-and-policy-implications-from-the-enterprise-challenge-fund",
    "@type": "Dataset",
    "description": "This paper encourages a more targeted focus on women’s economic empowerment through private sector development partnerships, not least through a greater mutual allocation of funds, and design effort. \n\nThe findings suggest that the ECF has contributed both to women’s economic advancement and perhaps to a lesser extent, to women’s power and agency. \n\nECF has increased women’s access to employment, training and income, and access to markets, and supported women-owned enterprises to expand their businesses. Specific initiatives that have affected women include: \n\n- Investing in technology that reduced physical workload. \n\n- Allowing flexible working conditions. \n\n- Training women into areas where they are well suited. \n\n- Improving access to goods and services such as education and financial services targeted at women. \n\nWomen with increased opportunities and income reported that they were more confident and acted as role models to other women and girls. Improved incomes in the household also allowed more income to be invested in improving the livelihood of family members. \n\nThe flow-on development benefits include contributions to the Millennium Development Goals. Although there is a strong donor policy commitment to women’s economic empowerment, a relative lack of public sector funding has been allocated to addressing it.\n\nDesign (including monitoring and evaluation) processes need to directly consider women’s economic empowerment, and to draw on the significant and helpful literature readily available on this issue. ECF reporting tends to confirm research demonstrating that consideration of women’s economic empowerment also increases business profit and sustainability. \n\nPrivate sector interest has increased in the challenge fund model, demonstrating commercial and social impacts that ECF-funded activities have achieved for employees, suppliers or customers. However, the gap remains between existing research and private sector understanding on gender and commercial impact. \n\nECF has seen a growing recognition among grantee businesses of both a strong business and development rationale for supporting women’s economic empowerment in their value chains and local communities. This is encouraging, particularly as the public and private sectors look for opportunities and incentives to work together for poverty alleviation.",
    "keywords": "data, development-programming, economic-empowerment, human-rights, literature-review, pacific-women, social-norms, violence",
    "name": "Women’s Economic Empowerment – Practice and Policy Implications from the Enterprise Challenge Fund",
    "url": "https://pacificdata.org/data/dataset/pwl-women-s-economic-empowerment-practice-and-policy-implications-from-the-enterprise-challenge-fund"
}