{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://pacificdata.org/data/dataset/aguilera2019aupwelling-modulation-of-functional-traits-of-a-dominant-planktonic-grazer-during-w",
    "@type": "Dataset",
    "description": "Climate change is expected to exacerbate upwelling intensity and natural acidification in Eastern Boundaries Upwelling Systems (EBUS). Conducted between January-September 2015 in a nearshore site of the northern Humboldt Current System directly exposed to year-round upwelling episodes, this study was aimed at assessing the relationship between upwelling mediated pH-changes and functional traits of the numerically dominant planktonic copepod-grazer Acartia tonsa (Copepoda). Environmental temperature, salinity, oxygen, pH, alkalinity, chlorophyll-a (Chl), copepod adult size, egg production (EP), and egg size and growth were assessed through 28 random oceanographic surveys. Agglomerative clustering and multidimensional scaling identified three main di-similitude nodes within temporal variability of abiotic and biotic variables: A) “upwelling”, B) “non-upwelling”, and C) “warm-acid” conditions. Nodes A and B represented typical features within the upwelling phenology, characterized by the transition from low temperature, oxygen, pH and Chl during upwelling to higher levels during non-upwelling conditions. However, well-oxygenated, saline and “warm-acid” node C seemed to be atypical for local climatology, suggesting the occurrence of a low frequency oceanographic perturbation. Multivariate (LDA and ANCOVA) analyses revealed upwelling through temperature, oxygen and pH were the main factors affecting variations in adult size and EP, and highlighted growth rates were significantly lower under node C. Likely buffering upwelling pH-reductions, phytoplankton biomass maintained copepod reproduction despite prevailing low temperature, oxygen and pH levels in the upwelling setting. Helping to better explain why this species is among the most recurrent ones in these variable yet productive upwelling areas, current findings also provide opportune cues on plankton responses under warm-acid conditions, which are expected to occur in productive EBUS as a consequence of climate perturbations. ",
    "keywords": "chemistry, field, growth, morphology, ocean-acidification, reproduction, south-pacific, zooplankton",
    "name": "Upwelling modulation of functional traits of a dominant planktonic grazer during “warm-acid” El Niño 2015 in a year-round upwelling area of Humboldt Current",
    "url": "https://pacificdata.org/data/dataset/aguilera2019aupwelling-modulation-of-functional-traits-of-a-dominant-planktonic-grazer-during-w"
}