{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://raw.githubusercontent.com/iodepo/odis-arch/schema-dev-jm/code/notebooks/Exploration/data-ama/ama-6b1aea80-0a32-48e9-a364-8c0f36a40252.json",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((-11 -4, -11 9, 10 9, 10 -4, -11 -4))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "In 1996 an Oil Spill Contingency Plan was prepared for the coast of Ghana. The Contingency Plan should raise the level of awareness and competence of the various parties involved to ensure that a high level of oil spill response preparedness is achieved and maintained. One element in this plan is an Environmental Sensitivity Map, which will be an important tool in the planning of the development along the coastline as well as in the preparation of licensing for petroleum exploration offshore Ghana.\n\nIt is impossible to give total protection to the entire coastline against oil pollution from navigation or oil exploration and exploitation activities. It is therefore necessary to carefully plan how to minimise the risk for the most sensitive and important areas and further to prioritise the oil spill combat activities in the event of oil pollution threatening the marine environment and the coastal zone areas.\n\nMapping the ecological and human use features sensitive to marine oil spill, the coastline, field surveys and aerial photography was classified into different geological coast types. Protected areas and areas that serve as important habitats for birds, fish, plankton, marine turtles, marine mammals and benthic fauna were mapped. Marine turtles nest on many of the sandy beaches in Ghana. The juvenile turtles are very sensitive to oil spill in the period shortly after hatching. Furthermore there are more than 90 lagoons along the coast serving as important areas for migrating birds and spawning areas for fish. The human use activities depending on access to marine resources such as fishery, hotels and recreation, water intakes etc. were also mapped. The fishing industry is one of the most promising in West Africa, in terms of resources and experience of the people engaged in the industry. All the data was stored in a GIS database.\n\nRanking of the coastline: Ecological features and Human use features where subsequently ranked in four categories in terms of sensitivity to oil spill: Very high sensitivity, High sensitivity, Medium sensitivity, and Low sensitivity.  The entire coastline was sub-divided into segments of 1 km. Each segment was ranked according to ecological sensitivity of oil spill and human use features separately. The most sensitive feature in each particular segment determines the overall rank.",
    "keywords": [
        "Sensitivity map: Oil Spill: Pollution: Beaches",
        "World"
    ],
    "name": "Environmental Sensitivity Mapping of the Coastal Zone of Ghana",
    "url": "http://164.214.12.45/MSISiteContent/StaticFiles/NAV_PUBS/WPI/WPI_Shapefile.zip"
}