{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://geonode.nodc.id/layers/geonode:geonode:OSD_VIEW",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((80.0 -20.0, 80.0 20.0, 160.0 20.0, 160.0 -20.0, 80.0 -20.0))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "OSD (Ocean Station Data) dataset observed from any measurements. The dataset has been recovered at region between 80°E – 160°E and 20°N-20°S including Indonesia water from any national and international research institute who conduct research survey at this region. This dataset consists several parameters including temperature, salinity, oxygen, phosphate, silicate, nitrate, nitrite, pH, chlorophyll, plankton, alkalinity, partial pressure of carbon dioxide, dissolved inorganic carbon, transmissivity, pressure, tritium, helium, δ-helium-3, δ-carbon-14, δ-carbon-14, argon, neon, Chlorofluorocarbon 11 (CFC 11), Chlorofluorocarbon 12 (CFC 12), Chlorofluorocarbon 113 (CFC 113) and δ-oxygen-18. InaNODC has reformat the data and found that has more than 68.310 stations data and more than 889.728 samples data from November 13, 1817. It was identified that several countries involved including Australia, Austria, China, Denmark, France, Germany, Great Britain, India, Indonesia, Japan, Korea, Panama, Philippines, Russia, Singapore, Sweden, Taiwan, Thailand and United States had made observations using CTD measurement.",
    "keywords": "Batimetri_Selat_Lombok_GEBCO_2_, CFC 11, CFC 113, CFC 12, Ocean Station Data, alkalinity, argon, carbon, carbon dioxide, chlorophyll, features, helium, mv_station_osd, neon, nitrate, nitrite, oxygen, oxygen-18, pH, phosphate, plankton, pressure, salinity, silicate, temperature, transmissivity, tritium, δ-carbon-14, δ-helium-3, Global",
    "name": "Ocean Station VIEW",
    "url": "https://geonode.nodc.id/layers/geonode:geonode:OSD_VIEW"
}