{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "https://raw.githubusercontent.com/iodepo/odis-arch/collection/tempHosting/data-acma/acma-0d9fa186-da06-4f92-8aef-9b27e59eb5c9.json",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((1.790541666679928 4.274291666679346, 1.790541666679928 14.45159722223616, 15.682819444456982 14.45159722223616, 15.682819444456982 4.274291666679346, 1.790541666679928 4.274291666679346))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "A wetland is a land area that is saturated with water, either permanently or seasonally, such that it takes on the characteristics of a distinct ecosystem. Primarily, the factor that distinguishes wetlands from other land forms or water bodies is the characteristic vegetation that is adapted to its unique soil conditions: Wetlands consist primarily of hydric soil, which supports aquatic plants. The water found in wetlands can be saltwater, freshwater, or brackish. Main wetland types include swamps, marshes, bogs and fens while Sub-types include mangrove, carr, pocosin, and varzea. Simply put, wetlands are in-between areas that have something of both dry uplands and open water environments: they are neither land nor water - they are a transition zone, which is what makes them so interesting. Wetlands have both upland and aquatic characteristics, and, thus, they often have a richer flora and fauna than other environments.  This dataset was re-shaped from the  global distribution of wetlands. It was produced at UNEP-WCMC from various sources alongside the publication 'Wetlands in Danger\", Dugan, P ed. (1993).",
    "keywords": [
        "Atlas",
        "HUMAN DIMENSIONS | BOUNDARIES | BIOSPHERE |WETLAND|COASTAL",
        "Nigeria"
    ],
    "name": "Nigeria Coastal Wetland",
    "url": "https://acma.africanmarineatlas.org/catalogue/#/dataset/26"
}