{
    "@context": {
        "@vocab": "https://schema.org/"
    },
    "@id": "https://raw.githubusercontent.com/iodepo/odis-arch/master/collection/tempHosting/data-acma/acma-49edd26a-d539-4d27-8063-dcb4be15f450.json",
    "@type": "Dataset",
    "description": "L’âge des chemins de fer à Madagascar risque fort d’avoir été bref. De 1901, qui vit l’ouverture du premier chantier, à 1936, un embryon de réseau de quelque 860 kilomètres fut constitué. Mais, en 2001 sur les 4 lignes qui le composaient, seul le FCE (Fianarantsoa-Côte-Est, 163 km) était encore animé par un modeste convoi quotidien, alors même que le problème des transports était plus aigu que jamais. Depuis, le TCE (Tananarive-Côte-Est, 369 km) a repris du service pour l’acheminement de pondéreux, les hydrocarbures principalement. Mais la tentative de remise en service du TA (Tananarive-Antsirabe, 158 km) s’est soldée par un déraillement de bien mauvais augure. Dans le contexte politique et idéologique actuel qui privilégie la privatisation de toutes les activités économiques, l’avenir des chemins de fer malgaches est plus qu’incertain. 2 Or incriminer la mauvaise gestion des Républiques successives depuis 1960 n’est pas une explication suffisante. Car une analyse remontant aux origines de ces voies ferrées fait apparaître clairement que l’entreprise a été dès l’origine mal pensée et encore plus mal exécutée. Le calcul économique resta déficient, ce qui rendait illusoires les espérances de développement, elles-mêmes obérées par de sévères contraintes, qu’il s’agisse des conditions de financement, du parasitisme d’intérêts particuliers ou d’effets pervers source de blocage économique. Et surtout, la réalisation fut menée au prix d’un coût social et humain très élevé, qui éclaire notamment les origines de l’insurrection de 1947 dont les chemins de fer furent les axes et la cible, et au-delà, l’hostilité des populations à une modernité toujours perçue comme oppressive.",
    "keywords": [
        "Cemin de fre",
        " transport",
        " Madagascar",
        "Cemin de fer",
        " transport",
        " Madagascar",
        "Africa"
    ],
    "name": "Madagascar AOI: Railways",
    "spatialCoverage": {
        "@type": "Place",
        "geo": {
            "@type": "GeoShape",
            "box": "-22.148622523526598 47.03845589099999 -17.6418209445266 49.40401836109758"
        }
    },
    "url": "https://acma.africanmarineatlas.org/catalogue/#/dataset/20"
}