{
    "@context": {
        "@vocab": "https://schema.org/"
    },
    "@id": "https://raw.githubusercontent.com/iodepo/odis-arch/master/collection/tempHosting/data-acma/acma-eda23369-1898-493d-a62b-ab66f30b0c57.json",
    "@type": "Dataset",
    "description": "Particulièrement choyée par la nature, Madagascar, île de l’océan Indien, est mondialement réputée pour la richesse de sa biodiversité. La faune et la flore malgaches possèdent un taux d’endémicité très élevé : 80 % des espèces animales et 90% de la végétation n’existent que sur l’île. À l’échelle mondiale, Madagascar est représentative d’une mégadiversité impressionnante. En effet, Madagascar, île de l’océan Indien occidental (COI) fait partie des 34 hot-spots de la biodiversité mondiale. C’est un label plutôt flatteur car il fait de la Grande île l’une des plus importantes régions en termes d’habitats rares et d’espèces phares. La conservation de ces richesses naturelles est ainsi inscrite dans l’agenda international. La mise en place d'aires protégées marines figure parmi les priorités de la politique de Madagascar en matière de préservation de l'environnement. Au vu de l’importance de ces zones marines et côtières et dans le but de les préserver face aux menaces et pressions d’origine anthropique et naturelle, Madagascar s’est résolument investie dans la création et la mise en place d’aires marines protégées et de réserves marines afin de contribuer au bien-être des communautés locales qui en dépendent. La première aire marine protégée a été officiellement créée en 1989 avec le parc marin de Nosy Antafana intégré à la Réserve de Biosphère de Mananara Nord, suivie par les trois parcelles marines du Parc National de Masoala. Vingt ans après le premier parc marin, de nouvelles aires marines protégées et réserves marines ont été créées ou sont en voie de création dans l’attente de l’obtention de leur statut définitif1. Les aires protégées sur les rivages et dans les eaux malgaches sont le fruit d’un travail réalisé dans un étroit partenariat avec les communautés locales pour assurer une bonne gestion des parcs dont le contrôle et la surveillance, le suivi écologique et l’application des régulations du parc et le développement des activités liées au tourisme.",
    "keywords": [
        "Aires",
        " Marines",
        " Protection",
        " Madagascar",
        "Africa"
    ],
    "name": "Madagascar AOI: Les Aires Marines Protegees",
    "spatialCoverage": {
        "@type": "Place",
        "geo": {
            "@type": "GeoShape",
            "box": "-25.45696467576 43.06967321723259 -11.98249895707104 50.47724461161199"
        }
    },
    "url": "https://acma.africanmarineatlas.org/catalogue/#/dataset/18"
}