{
    "@context": {
        "@vocab": "https://schema.org/"
    },
    "@id": "https://raw.githubusercontent.com/iodepo/odis-arch/master/collection/tempHosting/data-acma/acma-189b4971-ce42-4255-bcab-47eac9e1c36c.json",
    "@type": "Dataset",
    "description": "Madagascar has the highest surface area of mangroves in the Eastern African region. Mangroves in Madagascar are the breeding grounds for several globally threatened species, including the endangered Madagascar teal (Anas bernieri) and the critically endangered Madagascar fish eagle (Haliaeetus vociferoides. They are also nurseries for a wide range of commercially and artisanally important fish, crustaceans and mollusks which are important to both numerous local western coastal communities and the country’s fisheries, one of the primary industries in Madagascar. Mangroves are under increasing pressure as terrestrial forests dwindle, Agricultural lands are fully occupied elsewhere leading to migration into once undisturbed mangroves. The reduction in terrestrial forest cover has led to more and more harvesting of mangrove timber which, at the same time, is increasingly prized for its construction versatility, value as charcoal and resistance to parasites. The search for new agricultural lands has led to locally extensive clearing of mangroves. This increasese the risks of negative ecological and humanitarian impacts through flooding as sea levels rise.",
    "keywords": [
        "Land Surface",
        " Coastal Area",
        "Madagascar",
        "Mangroves",
        " Climate Change",
        "Madagascar",
        " Mangroves",
        " Vulnerability",
        " Assesment",
        "Africa"
    ],
    "name": "Madagascar: Mangroves Hot spots areas",
    "spatialCoverage": {
        "@type": "Place",
        "geo": {
            "@type": "GeoShape",
            "box": "-23.767911911010742 43.24011993408203 -11.958700180053711 49.99799346923828"
        }
    },
    "url": "https://acma.africanmarineatlas.org/catalogue/#/dataset/7"
}