{
    "@context": {
        "@vocab": "https://schema.org/"
    },
    "@id": "https://raw.githubusercontent.com/iodepo/odis-arch/master/collection/tempHosting/data-acma/acma-7e1f759c-d724-4276-a221-01649fb8cd54.json",
    "@type": "Dataset",
    "description": "Les routes nationales avancent bien dans les zones goudronnées. Il manque en général les obstacles de type gués et radiers. Il y a de petites différences entre les longueurs constatées dans OSM et les chiffres gouvernementaux. Pour les N6 et N7, il manque certainement quelques longueurs dans les villes terminus mais ça n'explique pas toute la différence. Certains virages tracés sommairement dans OSM peuvent aussi réduire le total. Enfin, les chiffres gouvernementaux ne sont pas fiables non plus. Le Document de stratégie pays pour Madagascar au titre du 9ième FED a adopté comme secteurs prioritaires de financement pour la période 2000-2007: les infrastructures routières et le développement rural. Les interventions, initialement déployées dans tout Madagascar, ont été concentrées depuis 2002 sur les régions du Sud (Fianarantsoa et Toliara), zones identifiées alors comme les plus pauvres. Dans le domaine des infrastructures, le bilan global est positif. De nombreux ouvrages ont été inaugurés et le réseau routier national s'est nettement amélioré, notamment le réseau reliant la capitale aux quatre principaux ports du pays et les autres routes nationales, desservant les régions productrices de cultures à l'exportation. L'amélioration des cultures de rente et des filières d'exportation a porté sur la diversification horticole, la normalisation agricole, la promotion des cultures de rente et la surveillance des pêches. Les programmes de structuration du monde rural ont permis de renforcer l'environnement productif du monde paysan (micro finances, services agricoles) et ont facilité l'émergence de leaders dans le milieu rural. Les programmes de développement local ont reflété, quant à eux, une évolution importante de la coopération avec la CE, des micro réalisations vers le financement direct et l'aménagement du territoire local. Pour de plus amples informations sur les projets et programmes à Madagascar financés par le FED et le budget général de l'UE, veuillez visiter la section projet du site de la Délégation de l'Union européenne à Madagascar.",
    "keywords": [
        "routes",
        "infrastructures",
        "Land Surface",
        "Africa"
    ],
    "name": "Madagascar AOI: Les Routes",
    "spatialCoverage": {
        "@type": "Place",
        "geo": {
            "@type": "GeoShape",
            "box": "-25.582077828218765 43.24164345473169 -11.958135264831853 50.47736082978478"
        }
    },
    "url": "https://acma.africanmarineatlas.org/catalogue/#/dataset/21"
}