{
    "@context": {
        "@vocab": "https://schema.org/"
    },
    "@id": "https://raw.githubusercontent.com/iodepo/odis-arch/master/collection/tempHosting/data-acma/acma-be144135-465f-4588-8e7e-6f3beb3394bd.json",
    "@type": "Dataset",
    "description": "A wetland is a land area that is saturated with water, either permanently or seasonally, such that it takes on the characteristics of a distinct ecosystem. Primarily, the factor that distinguishes wetlands from other land forms or water bodies is the characteristic vegetation that is adapted to its unique soil conditions: Wetlands consist primarily of hydric soil, which supports aquatic plants. The water found in wetlands can be saltwater, freshwater, or brackish. Main wetland types include swamps, marshes, bogs and fens. Sub-types include mangrove, carr, pocosin, and varzea. Wetlands play a number of roles in the environment, principally water purification, flood control, and shoreline stability. Wetlands are also considered the most biologically diverse of all ecosystems, serving as home to a wide range of plant and animal life. Wetlands occur naturally on every continent except Antarctica. They can also be constructed artificially as a water management tool, which may play a role in the developing field of water-sensitive urban design. Nigeria is blessed with rich and unique array of ecosystems, and a great variety of wild fauna and flora. This rich natural endowment is a product of the climatic variations resulting into various north-south gradations of habitats and ecosystems. The habitats support more than 1,340 species of animals among which is 274 mammalian species, making it the 8th highest in Africa.",
    "keywords": [
        "ATLAS",
        "Human Dimensions | National Reserves|Special Reserves| Places|Parks|",
        "Nigeria"
    ],
    "name": "Nigeria Special Reserves",
    "spatialCoverage": {
        "@type": "Place",
        "geo": {
            "@type": "GeoShape",
            "box": "4.632015150776756 3.708460000000059 13.384602677552516 14.206603437568461"
        }
    },
    "url": "https://acma.africanmarineatlas.org/catalogue/#/dataset/46"
}