{
    "@context": {
        "@vocab": "https://schema.org/"
    },
    "@id": "https://raw.githubusercontent.com/iodepo/odis-arch/master/collection/tempHosting/data-acma/acma-e0453b24-6357-4ed4-b3a5-6f3f3c863218.json",
    "@type": "Dataset",
    "description": "Seagrasses are unusual marine flowering plants which grows in the sea. They are grass-like flowering plants that live completely submerged in marine and estuarine waters. Many species leaves are long and narrow, and these plants often grow in large meadows which look like grassland: in other words many of the species of seagrasses superficially resemble terrestrial grasses of the family Poaceae. The canopy of seagrass protects smaller marine animals, including the young of such species as drums, sea bass, snappers and grunts from larger predators. Some animals, such as manatees, urchins, conches and sea turtles, eat seagrass blades. Other animals derive nutrition from eating algae and small animals that live upon seagrass leaves. Bottlenose dolphins and a variety of wading and diving birds also use seagrass beds as feeding grounds. Seagrass-based detritus formed by the microbial breakdown of leaves and roots is also an important food source. The seagrass dataset has been compiled by UNEP-WCMC in collaboration with Dr Frederick T. Short, University of New Hampshire, USA to show the global distribution of seagrass species. This dataset has been created from multiple sources and was used in the creation of the World Atlas of Seagrasses(2003). This polygon feature dataset is an update of the data used in the Atlas and is a unique data holding about the state of the world’s seagrasses.\"",
    "keywords": [
        "ATLAS",
        "HUMAN DIMENSIONS | BOUNDARIES | BIOSPHERE |SEAGRASS",
        "Nigeria"
    ],
    "name": "Nigeria Seagrass Area",
    "spatialCoverage": {
        "@type": "Place",
        "geo": {
            "@type": "GeoShape",
            "box": "4.13353921800001 2.718090512641197 6.43523704100005 7.619263100000012"
        }
    },
    "url": "https://acma.africanmarineatlas.org/catalogue/#/dataset/44"
}