{
    "@context": {
        "@vocab": "https://schema.org/"
    },
    "@id": "https://raw.githubusercontent.com/iodepo/odis-arch/master/collection/tempHosting/data-acma/acma-a72df6e5-7b1b-49e7-95b5-92d08804dbb6.json",
    "@type": "Dataset",
    "description": "Les écosystèmes côtiers et marins de la planète, y compris ceux de l’OIO, sont de plus en plus exposés à une multitude de facteurs de changement. L’identification, la quantification et la cartographie des facteurs de changement représentent une étape importante dans le processus de planification de la conservation et pour la gestion des écosystèmes. Dans cette étude, nous avons identifié 15 facteurs de changement anthropiques qui peuvent être regroupés en 8 catégories : pêche industrielle pélagique, pêche côtière, pêche à pied, sédimentation terrigène, pollution des bassins versants par les activités urbaines et agricoles, dégradations locales dues aux activités urbaines, tourisme et transport maritime. Les facteurs de changement ont été cartographiés en utilisant plusieurs techniques d’analyse spatiale dont celle de la logique floue, de l’analyse de voisinage et l’analyse d’image satellite océanographique. Les 8 catégories de facteurs de changement ont ensuite été classées et pondérées par des experts de la région réunis au cours d’un atelier, sur la base de leur impact potentiel sur les cinq principaux types d’habitats : récifs coralliens, mangroves, herbiers, autres habitats côtiers et habitats pélagiques profondeur > 200m, distance de la côte > 25km). Afin de développer un système de pondération valide, nous avons utilisé un processus analytique de hiérarchie basé sur la comparaison par paires de facteurs de changement. L’objectif était d’étudier une partie des facteurs de changement (FdC) dans l’OIO et de cartographier leur distribution spatiale et leur intensité en se basant sur des données de télédétection et socio-économiques et en utilisant les techniques de modélisation spatiale des SIG. La technique de logique floue et l’analyse d’images satellites ont été utilisées pour cartographier les FdC. La logique floue est une orme d’algèbre utilisant une gamme de valeurs comprises entre « vrai » et faux » qui est appliquée dans la cartographie de données imprécises ou peu sûres (Ross 2004). Les données sont codées de 0 à 1 rapportant à une fonction d’appartenance floue. Par exemple, une valeur de 1 indique qu’un site est fortement affecté par un FdC alors qu’une valeur de 0 indique que le site ne fait pas partie de la catégorie des sites affectés.",
    "keywords": [
        "Facteur de changement",
        " pecherie industrialisee",
        " Madagascar",
        "Africa"
    ],
    "name": "Madagascar AOI: Influences de la pecherie pelagique industrialisee",
    "spatialCoverage": {
        "@type": "Place",
        "geo": {
            "@type": "GeoShape",
            "box": "-34.773333333499984 23.2266666665 4.7533336155000185 69.75333366550001"
        }
    },
    "url": "https://acma.africanmarineatlas.org/catalogue/#/dataset/17"
}