{
    "@context": {
        "@vocab": "https://schema.org/",
        "geosparql": "http://www.opengis.net/ont/geosparql#"
    },
    "@id": "http://www.vliz.be/hisgiskust",
    "@type": "Dataset",
    "geosparql:hasGeometry": {
        "@type": "http://www.opengis.net/ont/sf#Polygon",
        "geosparql:asWKT": {
            "@type": "geosparql:wktLiteral",
            "@value": "POLYGON((2.350239238994 50.445475229843, 2.350239238994 51.526422916591, 3.6868796478568 51.526422916591, 3.6868796478568 50.445475229843, 2.350239238994 50.445475229843))"
        },
        "geosparql:crs": {
            "@id": "http://www.opengis.net/def/crs/OGC/1.3/CRS84"
        }
    },
    "description": "In het kader van het initiatief HisGISKust werd een samenwerkingsovereenkomst afgesloten tussen het Vlaams Instituut voor de Zee (VLIZ) en het Provinciaal Archief West-Vlaanderen (PAWV) met betrekking tot historische kaarten. Deze kaarten maken deel uit van de collectie van het PAWV en werden door het VLIZ gegeorefereerd teneinde deze samen met de nodige metadata in open access aan te bieden aan eindgebruikers. Op basis van de gegeorefereerde kaarten kunnen ook shapefiles (bv. de kustlijn, duingebieden, etc.) gegenereerd worden.",
    "keywords": "{hgauth}D. Raes, {hgloc}Belgische Kust, {hgtheme}Topografische kaart, {hgcent}19° eeuw, {hglang}Frans, {hgid}PAWV_K133, {picid}119212, {hgdistid}119296, {hgowner}<a href=\"http://www.west-vlaanderen.be/overwvl/archiefdienst/Paginas/default.aspx\" target=\"_blank\">Provinciaal Archief West-Vlaanderen</a> (verwerkt door <a href=\"http://www.vliz.be\" target=\"_blank\">VLIZ</a>), Citatie: HisGISKust; Provinciaal Archief West-Vlaanderen (2017) Nouvelle carte de la Province de la Flandre Occidentale divisée en Arrondissemens, Communaux et Cantons de Justice de Paix, indiquant le tracé du Chemin de Fer. Kaart van de Provincie West-Vl, ",
    "name": "Nouvelle carte de la Province de la Flandre Occidentale divisée en Arrondissemens, Communaux et Cantons de Justice de Paix, indiquant le tracé du Chemin de Fer. Kaart van de Provincie West-Vlaanderen.",
    "url": "http://www.vliz.be/hisgiskust"
}