{
  "@context": {
    "@vocab": "https://schema.org/"
  },
  "@type": "Organization",
  "@id": "https://edmo.seadatanet.org/report/5102",
  "name": "Oxford Archaeology (South)",
  "identifier": "5102",
  "url": "https://edmo.seadatanet.org/report/5102",
  "description": "Oxford Archaeology (OA) has a 40-year history of quality, innovation and service. As a multi-disciplinary practice, OA covers all aspects of the historic environment, providing everything from archaeological excavations and survey, landscape and buildings studies, complex geospatial data management systems to heritage consultancy services. Most archaeological work today is carried out in advance of development. Oxford Archaeology is one of the leading service-providers in this field, with thousands of clients who recognise us as experts in excavation and heritage management. As a registered charity with a heritage and education focus, we also care about helping people to discover and enjoy their heritage. We have welcomed many thousands of visitors to our excavation sites on open days and tours, and volunteers have taken part in many of our projects. Our vision is to be at the forefront of advancing knowledge about the past and working in partnership with others for the public benefit. Based in Oxford, Oxford Archaeology (OA) South operates nationwide and beyond, with a particular focus on southern England. Since its beginnings as the Oxfordshire Archaeological Unit in 1973, OA South has offered a comprehensive range of archaeology and heritage services that combine cost-effectiveness with academic excellence. Work includes desk-based research and assessments, heritage and planning advice, geophysical survey, building survey, and a full range of excavation strategies, from evaluation to full excavation and watching brief investigations. With about 130 staff, there are wide range of in-house specialists and dedicated post-excavation staff.",
  "location": {
    "@type": "Place",
    "latitude": 51.7477,
    "longitude": -1.2763
  },
  "contactPoint": {
    "@type": "ContactPoint",
    "telephone": "+44(0)185 980 700",
    "email": "mail@oxfordarch.co.uk"
  },
  "address": {
    "@type": "PostalAddress",
    "addressLocality": "Oxford, United Kingdom",
    "addressRegion": "Oxfordshire",
    "postalCode": "OX2 0ES",
    "streetAddress": "Janus House, Osney Mead"
  },
  "sameAs": [
    "https://oxfordarchaeology.com"
  ],
  "memberOf": {
    "@type": "ProgramMembership",
    "programName": "European Directory of Marine Organisations (EDMO)"
  }
}